Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src.po
Languages: de, fr, ru

source: Defines file filters to apply to file names for inclusion and exclusion from a larger set (such as scanned disk files or all project files). Each filter is named and contains one list of inclusion patterns and one list of exclusion patterns. The patterns can be a wildcard on the file name, wildcard on a directory name, or a mime type name. Only a single pattern needs to be matched for inclusion or exclusion. Exclusion patterns take precedence over inclusion patterns, so any match on an exclusion pattern will always exclude a file from the selected set. Filters are used in constraining search, adding project files, and for other operations on collections of files.
de: Definiert Datei-Filter, die auf Dateinamen angewendet werden, um deren Einbeziehung oder Ausschluss aus einer größeren Gruppe festzulegen (wie durchsuchte Festplattendateien oder alle Projektdateien). Jeder Filter hat einen Namen und enthält eine Liste mit den Einschluss-Muster und eine Liste mit den Ausschluss-Muster. Die Muster können entweder eine Wildcard auf den Dateinamen, eine Wildcard auf den Verzeichnisnamen oder ein Mime-Typ-Name sein. Nur ein einziges Kriterium muss übereinstimmen, um die Einbeziehung oder den Ausschluss zu bewirken. Ausschlusskriterien haben Vorrang gegenüber Einschlusskriterien, so dass eine Übereinstimmung mit einem Ausschlusskriterium die Datei immer von der gewählten Gruppe ausschließt. Filter werden für begrenzende Suchen, beim Hinzufügen von Projektdateien und für andere Operationen an Dateisammlungen verwendet.
fr: Défini les filtres à appliquer aux noms de fichiers pour les inclusions et les exclusions dans un ensemble plus grand (comme des fichiers scannés sur le disque ou tous les fichiers d’un projet). Chaque filtre est nommé et contient une liste de modèles d’inclusion et une liste de modèles d’exclusion. Les modèles peuvent être des jokers sur le nom de fichier ou de répertoire ou un type mime. Il n’y a besoin que d’un modèle pour la correspondance en inclusion ou en exclusion. Les modèles d’exclusion ont la précédence sur les modèles d’inclusion, donc n’importe quelle correspondance sur un modèle d’exclusion va toujours exclure un fichier du jeu sélectionné. Les filtres sont utilisés pour la recherche avec contraintes, l’ajout de fichiers au projet, et pour les autres opérations sur les collections de fichiers.
ru: Определяет фильтры файлов для применения к именам файлов для включения и исключения из большего набора (например, файлы отсканированных дисков или все файлы проекта). Каждый фильтр назван и содержит один список шаблонов включения и один список шаблонов исключений. Шаблоны могут быть подстановочными знаками имени файла, подстановочного знака в имени каталога или имени типа mime. Для включения или исключения нужно подобрать только один шаблон. Шаблоны исключения имеют приоритет над шаблонами включения, поэтому любое совпадение по шаблону исключения всегда исключает файл из выбранного набора. Фильтры используются для ограничения поиска, добавления файлов проекта и для других операций с коллекциями файлов.

source: Specification
de: Spezifikation
fr: Spécification
ru: Описание

source: If True and a gtk, gdk, or glib critical message is logged, Wing tries to start a C debugger and break at the current execution point
de: Wenn Wahr und eine kritische gtk-, gdk- oder glib-Nachricht protokolliert wurde, versucht Wing, einen C-Debugger zu starten und am aktuellen Ausführungspunkt zu halten.
fr: Si c'est option est activée et qu'un message critique gtk, gdk ou glib est logué, Wing va essayer de démarrer un débogueur C et d'arrêter l'exécution au point actuel
ru: Если регистрируется значение True и критическое сообщение gtk, gdk или glib, Wing пытается запустить отладчик C и прервать выполнение в текущей точке выполнения

source: Controls whether or not the splash screen is shown at startup.
de: Kontrolliert ob das Einschalt-Bildschirm gezeigt wird
fr: Contrôle si oui ou non l'écran de présentation est affiché au démarrage.
ru: Определяет, отображается ли экран заставки при запуске.

source: Reuse Existing Instance to Open Files
fr: Réutiliser l’instance existante pour ouvrir des fichiers
ru: Повторное использование существующего экземпляра для открытия файлов

source: Always Reuse Existing Instance
de: Immer eine bestehende Instanz wiederverwenden
fr: Toujours réutiliser l’instance existante
ru: Всегда Использовать Существующий Экземпляр

source: Always Launch New Instance
de: Immer eine neue Instanz starten
fr: Toujours Lancer une nouvelle instance
ru: Всегда Запускать Новый Экземпляр

source: Controls whether Wing tries to reuse an existing running instance of the IDE when it is launched again.
fr: Contrôle si Wing essaie de réutiliser une instance existante en cours d’exécution de l’IDE lorsque celui-ci sera lancé à nouveau.
ru: Определяет, пытается ли Wing повторно использовать существующий запущенный экземпляр среды IDE при повторном запуске.

source: When enabled, Wing will show a dialog offerring to update any remote agent that does not match Wing's version.
de: Falls aktiviert, wird Wing in einem Dialog die Aktualisierung von Remote-Agenten anbieten, die nicht der Version von Wing entsprechen.
ru: При включении Wing будет показывать диалоговое окно, предлагающее обновить любой удаленный агент, который не соответствует версии Wing.

source: Find %s on PATH
fr: Trouver %s dans PATH
ru: Найти %s в PATH

source: Use executable:
de: Programmdatei benutzen:
fr: Utiliser l'exécutable :
ru: Использовать исполняемый файл:

source: The maximum time in seconds to wait if a connection to a remote host is not responding. Afterwards the connection is closed and retried.
ru: Максимальное время ожидания в секундах, если подключение к удаленному узлу не отвечает. После этого соединение закрывается и повторяется.

source: Allows manual configuration of an http proxy to be used for feedback, bug reports, and license activation, all of which result in Wing connecting to wingware.com via http. Leave user name and password blank if not required.
fr: Autorise une configuration manuelle d'un proxy http à être utilisée pour un retour d'expérience, des reports de bugs, et l'activation de licence, tout ce qui peut résulter dans Wing de se connecter à wingware.com par http. Laisser le nom d'utilisateur et le mot de passe vierges si ils ne sont pas requis.
ru: Позволяет использовать ручную конфигурацию http-прокси для обратной связи, отчетов об ошибках и активации лицензии, все из которых приводят к подключению Wing к wingware.com через http. Оставьте имя пользователя и пароль пустым, если это не требуется.

source: No proxy server (or auto-detected)
de: Kein Proxy-Server (oder automatische Erkennung)
fr: Pas de serveur proxy (ou auto-détecté)
ru: Нет прокси-сервера (или автоматического обнаружения)

source: Configure proxy server manually:
de: Proxy-Server manuell konfigurieren:
fr: Configurer le serveur proxy manuellement :
ru: Настройка прокси-сервера вручную:

source: Host name
fr: Nom d'hôte
ru: Имя хоста

source: Port
ru: Порт

source: User name
de: Benutzername
fr: Nom d'utilisateur
ru: Имя пользователя

source: Password
de: Passwort
fr: Mot de passe
ru: Пароль

source: Never
de: Nie
fr: Jamais
ru: Никогда

source: When saving files
de: Beim Speichern von Dateien
fr: Lors de l'enregistrement des fichiers
ru: При сохранении файлов

source: When saving files in project
de: Beim Speichern von Dateien im Projekt
fr: Lors de l'enregistrement des fichiers dans le projet
ru: При сохранении файлов в проекте

source: Controls whether to automatically strip trailing white space in the editor. May be enabled for any file or only files that are part of the current project.
de: Steuert ob im Editor Leerraum am Zeilenende automatisch entfernt wird. Kann für alle Dateien aktiviert werden oder nur für Dateien des aktuellen Projektes.
fr: Contrôle le retrait automatique des espaces blancs de fin de chaîne dans l'éditeur. Peut être activé pour tout fichier ou seulement les fichiers qui font partis du projet actuel.
ru: Определяет, следует ли автоматически удалять конечные пробелы в редакторе. Может быть включен для любого файла или только для файлов, которые являются частью текущего проекта.

source: Tools and Layout
de: Werkzeuge and Layout
fr: Outils et Présentation
ru: Инструменты и Макет

source: Tools, Layout, and Editors
de: Werkzeuge, Layout, und Editoren
fr: Outils, Présentation, et Éditeurs
ru: Инструменты, Макет и Редакторы

source: All Visual State
de: Alle visuellen Zustände
fr: Tous les États Visuels
ru: Все Визуальные Состояния

source: Selects the file to use for storing and retrieving shared perspectives. By default (when value is None) the file 'perspectives' in the user settings directory is used.
fr: Sélectionne le fichier à utiliser pour enregistrer et récupérer les perspectives partagées. Par défaut (quand la valeur est None) le fichier 'perspectives' dans le répertoire des préférence utilisateur est utilisé.
ru: Выбор файла для хранения и извлечения общих перспектив. По умолчанию (если значение отсутствует) файл 'perspectives' в каталоге настроек пользователя.

source: Default
de: Standardeinstellung
fr: Par défaut
ru: По умолчанию

source: File:
de: Datei:
fr: Fichier :
ru: Файл:

source: Always
de: Immer
fr: Toujours
ru: Всегда

source: Configured by Perspective
de: Durch die Perspektive konfiguriert
fr: Configuré par Perspective
ru: Настроено по перспективе

source: Selects whether to auto-save perspectives when switching to another perspective. Can always auto-save, never auto-save, prompt each time a perspective is left, or auto-save as configured on a per-perspective basis.
fr: Sélectionne l'auto-enregistrement des perspectives lors du changement vers une autre perspective. Il est possible d'enregistrer automatiquement, ne jamais enregistrer automatiquement, demander à chaque fois qu'une perspective est quittée, ou enregistrer automatiquement comme configuré sur une base par-perspective.
ru: Позволяет выбрать, следует ли автоматически сохранять перспективы при переключении на другую перспективу. Всегда может автоматически сохранять, никогда не сохранять автоматически, запрашивать каждый раз, когда перспектива остается, или автоматически сохранять в соответствии с настройками для каждой перспективы.

source: Selects the file to use for storing and retrieving shared named files sets. By default (when value is None) the file 'filesets' in the user settings directory is used.
fr: Sélectionne le fichier à utiliser pour enregistrer et récupérer les jeux de fichiers nommés partagés. Par défaut (quand la valeur est None) le fichier 'filesets' dans le répertoire des préférence utilisateur est utilisé.
ru: Выбирает файл, который будет использоваться для хранения и получения общих имен файлов. По умолчанию (когда значение равно None) используется файл 'setsets' в каталоге пользовательских настроек.

source: Defines which plugins are enabled or disabled.
de: Legt fest, welche Erweiterungen aktivert oder deaktiviert sind.
fr: Défini quels plugins sont activé ou désactivés.
ru: Определяет, какие плагины включены или отключены.

source: The amount by which to zoom font sizes in or out in the documentation viewer.
fr: Le niveau de zoom pour les tailles de police dans ou en dehors de la visionneuse de la documentation.
ru: Размер, с помощью которого можно масштабировать размеры шрифта в окне просмотра документации.

source: Whether to try parsing docstrings as ReST format for display in the Source Assistant. This may destroy formatting of some docstrings.
ru: Нужно ли анализировать синтаксический анализ docstrings в формате ReST для отображения в Source Assistant. Это может разрушить форматирование некоторых docstrings.

source: Debug
ru: Отладка

source: Informational
fr: Informatif
ru: Информационных

source: Warning
fr: Avertissement
ru: Предупреждение

source: Error
fr: Erreur
ru: Ошибка

source: Severe
fr: Sévère
ru: Жесткий

source: The error level at or above which the source assistant will display parse errors in PEP287 docstrings (if showing PEP287 errors) or will fall back to showing plain text (if not showing PEP287 errors). For errors below this threshold, a best attempt is made to achieve a reasonable rendering.
ru: Уровень ошибок, на котором помощник источника будет отображать ошибки разбора в pep287 docstrings (если показаны ошибки PEP287) или вернется к показу обычного текста (если не показаны ошибки PEP287). Для ошибок ниже этого порога лучше всего попытаться достичь разумного рендеринга.

source: Whether to render docstrings even if they contain parse errors at or above the threshold set by Source Assistant PEP 287 Error Threshold. When disabled, failing docstrings are shown as plain text instead. When enabled, a best effort is made to display the formatted docstring while suppressing errors.
ru: Следует ли отображать docstrings даже в том случае, если они содержат ошибки синтаксического анализа или выше порогового значения, установленного пороговое значение ошибки Source Assistant PEP 287 Error Threshold. Если этот параметр отключен, docstrings не отображаются в виде простого текста. При включении рекомендуется приложить все усилия для отображения форматированного docstring при подавлении ошибок.

source: Whether to rewrap plain text docstrings for display in the Source Assistant. This may destroy formatting of some docstrings.
ru: Следует ли переносить обычный текст docstrings для отображения в Source Assistant. Это может разрушить форматирование некоторых docstrings.

source: Whether to always show docstrings in the Source Assistant. When disabled, only the docstring for the last displayed symbol is shown.
fr: Affiche, ou non, toujours les doctrings dans l’Assistant source. Si désactivé, seulement la docstring pour le dernier symbole affiché est montrée.
ru: Следует ли всегда отображать docstrings в Source Assistant. При отключении отображается только docstring для последнего отображаемого символа.

source: Whether show docstring type and validity in the Source Assistant.
fr: Affiche, ou non, le type et la validité des docstrings dans l’Assistant source.
ru: Показывает ли docstring тип и допустимость в Source Assistant.

source: Top-level Commands
de: Top-Level Befehle
fr: Commandes de haut-niveau
ru: Команды верхнего уровня

source: Project Manager Commands
de: Projektmanager Befehle
fr: Préférences du gestionnaire de projets
ru: Команды Менеджера Проекта

source: Editor Commands
de: Editor Befehle
fr: Commandes de l'éditeur
ru: Команды редактора

source: Search Manager Commands
de: Suchmanager Befehle
fr: Commandes du gestionnaire de recherches
ru: Команды Диспетчера Поиска

source: Unit Testing Commands
de: Modul-Test Befehle
fr: Commandes des tests unitaires
ru: Команды Unit Test

source: Version Control Commands
de: Versionsverwaltung Befehle
fr: Commandes du contrôle de version
ru: Команды Управления Версиями

source: Debugger Commands
de: Debugger Befehle
fr: Commandes du débogueur
ru: Команды отладчика

source: Refactoring Commands
de: Refaktorierung Befehle
fr: Commandes de Refactorisation
ru: Команды рефакторинга

source: Source Browser Commands
de: Source-Browser Befehle
fr: Commandes de l'Explorateur de source
ru: Команды Source Browser

source: Script-provided Add-on Commands
de: Von Skripten gelieferte Zusatzbefehle
ru: Сценарий, предоставляемый командами надстройки

source: Preferences Dialog Path
fr: Chemin
ru: Путь к диалогу настроек

source: Internal Name
de: Interner Name
fr: Nom interne
ru: Внутреннее название

source: Data Specification
de: Daten Spezifikation
fr: Spécification des données
ru: Спецификация данных

source: Default Value
de: Standardeinstellung
fr: Valeur par défaut
ru: Значение по умолчанию

source: Core Preferences
de: Haupteinstellungen
fr: Préférences de base
ru: Основные настройки

source: User Interface Preferences
de: Einstellungen der Benutzeroberfläche
fr: Préférérences de l'interface utilisateur
ru: Настройки пользовательского интерфейса

source: Editor Preferences
de: Einstellungen des Editors
fr: Préférences de l'éditeur
ru: Настройки редактора

source: Diff/Merge Preferences
de: Einstellungen von Vergleichen/Zusammenführen
fr: Préférences de Diff/fusion
ru: Настройки Diff/Merge

source: Project Manager Preferences
de: Einstellungen des Projektmanagers
fr: Préférences du gestionnaire de projet
ru: Настройки Менеджера Проекта

source: Debugger Preferences
de: Einstellungen des Debuggers
fr: Préférences du débogueur
ru: Параметры Отладчика

source: Source Analysis Preferences
de: Einstellungen der Source-Analyse
fr: Préférences de l'analyseur de source
ru: Настройки Source Analysis

source: Source Browser Preferences
de: Einstellungen des Source-Browsers
fr: Préférences de l'Explorateur de source
ru: Настройки обозревателя исходного кода

source: Version Control Preferences
de: Einstellungen der Versionsverwaltung
fr: Préférences du contrôle de version
ru: Настройки Управления Версиями

source: Internal Preferences
de: Interne Einstellungen
fr: Préférences interne
ru: Внутренние Настройки

source: Creating singletons... %s
de: Erstelle Singletons... %s
fr: Création de singletons... %s
ru: Создание singletons... %s

source: Enter Command Arguments
de: Befehlsargumente eingeben
fr: Entrez les arguments de la commande
ru: Введите Аргументы Команды

source: Use console_%s to print a diagnostic log while running.
fr: Utiliser console_%s pour imprimer un log de diagnostic en fonctionnement.
ru: Используйте console_%s для печати журнала диагностики во время работы.

source: --verbose Print a diagnostic log while running
de: --verbose Ausgabe eines Diagnose-Protokolls während der Ausführung
ru: --verbose Печать журнала диагностики во время выполнения

source: Fatal startup error: Exiting Wing
de: Schwerer Fehler beim Start: Wing wird beendet
fr: Erreur fatale au démarrage : Quitte Wing
ru: Фатальная ошибка запуска: Выход из Wing

source: Wing %s version is %s.%s
fr: La version de Wing %s est la %s.%s

source: _Exit
fr: Sortie

source: Mime Type
de: Mime-Typ
fr: Type Mime

source: Comment Characters
de: Kommentarzeichen
fr: Caractères de commentaires

source: System default (%s)
de: Systemvoreinstellung (%s)
fr: Valeur système (%s)

source: Used internally to keep track of latest version the user is not interested in
fr: Utilisé en interne pour garder la trace de la dernière version dont l'utilisateur n'est pas intéressé

source: Prompt
de: Fragen
fr: Demander

source: release candidate
fr: distribution admissible (RC)

source: Use Random Port
de: Zufälligen Port benutzen

source: Use specified port:
de: Angegebenen Port benutzen:

source: The maximum time in seconds to wait for SSH tunnels to be established.
de: Die maximale Wartezeit in Sekunden, bis eine SSH-Tunnel aufgebaut ist.
