Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src.po
Languages: de, fr, ru

source: Advanced indentation analysis and translation
de: Erweiterte Einrückungsanalyse und Übersetzung
fr: Analyse avancée de l'indentation et de la traduction
ru: Расширенный анализ отступов и перевод

source: Folding in the source code editor
de: Falten im Quelltext-Editor
fr: Repliement dans l'éditeur de code source
ru: Складывание в редакторе исходного кода

source: Recent menus
de: Letzte Menüs
fr: Menus récents
ru: Недавние меню

source: Attach/detach to debug processes
de: Anhängen/Abtrennen an/von Debug-Prozessen
fr: Attacher/détacher des processus de débogage
ru: Присоединение/отключение к процессам отладки

source: Expression and value watching for debugger
de: Ausdruck- und Wertbeobachtung für den Debugger
fr: Expression et valeur surveillées par le débogueur
ru: Просмотр выражений и значений для отладчика

source: Interactive debug probe tool
de: Interaktives Debug-Test-Werkzeug
fr: Outil de débogueur interactif avec sonde
ru: Интерактивный инструмент для проверки отладки

source: Debug externally launched processes
de: Extern gestartete Prozesse debuggen
fr: Débogage de processus lancés à l'extérieur
ru: Отладка запущенных извне процессов

source: Advance exception handling modes
de: Erweiterte Exception-Behandlungsmodi
fr: Modes de gestion avancée des exceptions
ru: Режимы предварительной обработки исключений

source: Module-oriented debug data view
de: Modulorientierte Debug-Datenansicht
fr: Vue des données de débogage orientée-module
ru: Модульно-ориентированное представление данных отладки

source: Shared projects for use in revision control
de: Gemeinsame Projekte für die Nutzung mit der Versionsverwaltung
fr: Projets partagés à utiliser dans le contrôle de révision
ru: Общие проекты для использования в управлении ревизиями

source: Advanced breakpoints for debugger
de: Erweiterte Haltepunkte für den Debugger
fr: Points-d'arrêts avancés pour le débogueur
ru: Дополнительные точки останова для отладчика

source: Debugger breakpoint manager
de: Haltepunkt-Manager des Debuggers
fr: Gestionnaire des points-d'arrêts de débogage
ru: Диспетчер точек останова отладчика

source: Source code browser
fr: Explorateur de code source
ru: Браузер исходного кода

source: Source assistant
de: Source-Assistent
fr: Assistant source
ru: Помощник по источникам

source: Scripting support
de: Skripting-Support
fr: Support de script
ru: Поддержка сценариев

source: Keyboard and command macro support
de: Support für Tastatur- und Befehlsmakros
fr: Support du clavier et de commande macro
ru: Поддержка макросов клавиатуры и команд

source: User-defined named bookmarks
de: Benannte Lesezeichen vom Benutzer definiert
fr: Signets nommés définis par l'utilisateur
ru: Пользовательские именованные закладки

source: Autocompletion
de: Auto-Vervollständigung
fr: Autocomplétion
ru: Автозавершение

source: Projects
de: Projekte
fr: Projets
ru: Проекты

source: Wildcard and regular expression search
de: Wildcard- und reguläre Ausdrucksuche
fr: Recherche avec les jokers et les expressions régulières
ru: Поиск подстановочных знаков и регулярных выражений

source: Batch search
de: Batch-Suche
fr: Recherche groupée
ru: Пакетный поиск

source: Disk search
de: Suche auf der Festplatte
fr: Recherche sur le disque
ru: Поиск диска

source: Multi-window GUI support
de: GUI-Support für mehrere Fenster
fr: Support du multi-fenêtres dans l'interface utilisateur graphique
ru: Поддержка нескольких окон GUI

source: Messages view
de: Nachrichtenansicht
fr: Vue des messages
ru: Просмотр сообщений

source: Unit testing tool
de: Unit-Test Werkzeug
fr: Outil de tests unitaires
ru: Инструмент Unit test

source: Support for running external processes in a console
de: Unterstützung für die Ausführung externer Prozesse in einer Konsole
fr: Support pour lancer les processus externes dans une console
ru: Поддержка запуска внешних процессов в консоли

source: Code snippets
de: Code-Schnipsel
fr: Bouts de code
ru: Фрагмент кода

source: Version control
de: Versionsverwaltung
fr: Contrôle de version
ru: Контроль версий

source: Perspectives
de: Perspektiven
ru: Перспективы

source: Difference and merge tool
de: Vergleichen und Zusammenführen-Werkzeug
fr: Outil de différences et fusions
ru: Инструмент 'Сравнение и слияние'

source: Code warnings
de: Code Warnungen
fr: Avertissements de code
ru: Код предупреждения

source: Auto-editing
de: Auto-Bearbeitung
fr: Auto-édition
ru: Авто-редактирование

source: Named file sets
de: Benannte Dateigruppen
fr: Ensemble de fichiers nommés
ru: Именованные наборы файлов

source: Launch Configurations
de: Start-Konfigurationen
fr: Lancer les configurations
ru: Конфигурации запуска

source: Multi-process debugging
de: Multi-Prozess Debuggen
fr: Débogage multi-process
ru: Многопроцессорная отладка

source: Find Symbol in Project
de: Finde Symbol im Projekt
fr: Trouver un symbole dans le projet
ru: Найти символ в проекте

source: Debug code executed in shells
fr: Déboguer le code exécuté dans les shells
ru: Код отладки, выполняемый в shells

source: Automated remote debugging
fr: Débogage distant automatisé
ru: Автоматическая удаленная отладка

source: Generic support specific to Wing 101
de: Allgemeiner Support für Wing 101
fr: Support générique spécifique à Wing 101
ru: Общая поддержка, характерная для Wing 101

source: Generic support specific to Wing Personal
de: Allgemeiner Support für Wing Personal
fr: Support générique spécifique à Wing Personnel
ru: Общая поддержка, характерная для Wing Personal

source: Generic support specific to Wing Pro
de: Allgemeiner Support für Wing Pro
fr: Support générique spécifique à Wing Professionnel
ru: Общая поддержка, характерная для Wing Pro

source: Cannot run without WINGHOME: exiting
de: Kann ohne WINGHOME nicht ausführen: Beenden
fr: Impossible de démarrer sans WINGHOME : Sortie
ru: Не может работать без WINGHOME: выход

source: Could not create or access user settings directory
de: Das Verzeichnis mit den Benutzer-Einstellungen konnte nicht erstellt werden
fr: N'a pas pu créer ou accéder au répertoire des préférences utilisateur
ru: Не удалось создать или получить доступ к каталогу настроек пользователя

source: Creating singletons...
de: Erstelle Singletons...
fr: Création de singletons...
ru: Создание singletons...

source: _Use dotfile locking
fr: _Utiliser le blocage de dotfile
ru: _Использовать блокировку dotfile

source: _Don't use dotfile locking
fr: _Ne pas utiliser le blocage de dotfile
ru: _Не использовать блокировку dotfile

source: Wing may not have started correctly
de: Wing wurde eventuell nicht korrekt gestartet
fr: Wing n'a pas du démarrer correctement
ru: Возможно, Wing запущен неправильно

source: Wing may have hung when trying to open a database file in your ~/.cache directory the last time it was run. This may be caused by a file locking failure with a remote file server. To work around the file locking failure, use the slower dotfile locking.
ru: Возможно, Wing завис при попытке открыть файл базы данных в каталоге ~/.cache при последнем запуске. Это может быть вызвано сбоем блокировки файлов на удаленном файловом сервере. Чтобы обойти сбой блокировки файлов, используйте медленную (slower) блокировку dotfile.

source: System Default
de: Systemvoreinstellung
fr: Système par défaut
ru: Системные установки по умолчанию

source: The language to use for the user interface. Either the default for this system, or set to a specific supported language.
de: Die Sprache, die für die Benutzeroberfläche verwendet werden soll. Verwenden Sie entweder die Voreinstellung für dieses System oder wählen Sie eine andere Sprache, die unterstützt wird.
fr: La langue à utiliser pour l'interface utilisateur. Soit la langue par défaut du système, ou une langue spécifique supportée.
ru: Язык, используемый для пользовательского интерфейса. Либо значение по умолчанию для этой системы, либо значение определенного поддерживаемого языка.

source: Controls whether most recent project is reopened at startup, in the absence of any other project on the command line.
de: Kontrolliert, ob das letzte Projekt mangels eines anderen Projektes in der Befehlszeile beim Starten wieder geöffnet wird.
fr: Contrôle si le projet le plus récemment ouvert est réouvert au démarrage, dans l'absence de tout autre projet passé en ligne de commande.
ru: Управляет повторным открытием последнего проекта при запуске в отсутствие любого другого проекта в командной строке.

source: This is a map from file extension or wildcard to mime type. It adds additional file type mappings to those built into Wing. File extensions can be specified alone without dot or wildcard, for example "xcf" or using wildcards containing "*" and/or "?", for example "Makefile*". The mime type to use for Python files is "text/x-python".
de: Dies ist eine Konvertierung von Dateizusätzen oder Wildcards zu Mime-Typen. Dies fügt zusätzliche Konvertierungen von Dateitypen zu denen, die in Wing IDE erstellt werden, hinzu. Dateizusätze können allein ohne Punkt oder Wildcard angegeben werden, z. B. "xcf" oder sie können Wildcards verwenden, die "*" und/oder "?" enthalten, z. B. "Makefile*". Der Mime-Typ, der für Python-Dateien verwendet wird, lautet "text/x-python".
fr: Ceci est une correspondance entre les extensions de fichiers avec les types mime. Elle ajoute des correspondances additionnelles pour ceux-là dans Wing IDE. Les extensions de fichiers peuvent être spécifiées seules sans point ou jokers, "xcf" par exemple, ou en utilisant les jokers "*" et/ou "?", "Makefile*" par exemple. Le type mime à utiliser pour les fichiers Python est "text/x-python".
ru: Это карта с расширением файла или подстановочным знаком в тип mime. Он добавляет дополнительные типы файлов для встроенных в Wing. Расширения файлов могут быть указаны отдельно без точки или подстановочного знака, например "xcf" или с использованием подстановочных знаков, содержащих "*" и / или "?", Например "Makefile *". Тип mime для файлов Python - "text/x-python".

source: File Extension
de: Dateizusatz
fr: Extension du fichier
ru: Расширение файла

source: This is a map from mime type to displayable name for that mime type; one entry should be added for each new mime type added with the main.extra-mime-types preference.
de: Dies ist eine Konvertierung von Mime-Typen zu anzeigbaren Namen für diese Mime-Typen; ein Zugang sollte für jeden neuen Mime-Typen, der mit der Einstellung main.extra-mime-types hinzugefügt wurde, erstellt werden.
fr: Ceci est une correspondance entre les types mime et les noms affichables de ceux-là. Une entrée devrait être ajoutée pour chaque nouveau type mime ajouté avec la préférence main.extra-mime-types.
ru: Это сопоставление типа mime с именем, которое следует воспроизвести для этого типа mime; необходимо добавить одну запись для каждого нового типа mime, добавляемого в настройках main.extra-mime-types.

source: Name
fr: Nom
ru: Имя

source: This is a map from mime type to tuple of start/end comment characters for each mime type. One entry should be added for each new mime type added with the main.extra-mime-types preference.
de: Dies ist eine Konvertierung von Mime-Typen zu Tuple von Anfang/End-Kommentarzeichen für jeden Mime-Typen. Ein Zugang sollte für jeden neuen Mime-Typen, der mit der Einstellung main.extra-mime-types hinzugefügt wurde, erstellt werden.
fr: Ceci est la correspondance entre un type mime et les caractères de début/fin de commentaires pour chacun des types mime. Une entrée devrait être ajoutée pour chaque nouveau type mime ajouté avec la préférence principale «types-mime-additionnels ».
ru: Это сопоставление от типа mime к кортежу символов начала/конца комментария для каждого типа mime. Необходимо добавить одну запись для каждого нового типа mime, добавляемого в настройках main.extra-mime-types.

source: End
de: Ende
fr: Fin
ru: Конец

source: Start
fr: Début
ru: Начало

source: The default encoding to use for text files opened in the source editor and other tools, when an encoding for that file cannot be determined by reading the file. Other encodings may also be tried. This also sets the encoding to use for newly created files.
de: Die Standard-Kodierung, die für Textdateien, die im Source-Editor oder anderen Werkzeugen geöffnet werden, verwendet wird, wenn beim Lesen der Datei keine Kodierung für die Datei bestimmt werden kann. Andere Kodierungen können auch probiert werden. Dies stellt auch die Kodierung ein, die für neu erstellte Dateien verwendet wird.
fr: L'encodage par défaut à utiliser pour les fichiers texte ouvert dans l'éditeur de code source et dans les autres outils, lorsque l'encodage du fichier ne peut pas être déterminé en lisant le fichier. D'autres encodages seront aussi essayés. Cela fixe aussi l'encodage à utiliser pour les fichiers nouvellement créés.
ru: Кодировка, используемая по умолчанию для текстовых файлов, открываемых в редакторе исходного кода и других инструментах, когда кодировка для этого файла не может быть определена путем считывания файла. Другие кодировки также могут быть опробованы. Задает кодировку, используемую для вновь созданных файлов.

source: The number of bytes at which the IDE log file (%s) is truncated. This file can be sent to technical support to help diagnose problems with the IDE.
fr: Le nombre de bytes à partir duquel le fichier de log (%s) est tronqué. Ce fichier peut être envoyé au support technique pour aider au diagnostic des problèmes avec l'IDE.
ru: Число байт, при котором файл журнала IDE (%s) обрезается. Этот файл может быть отправлен в службу технической поддержки, чтобы помочь диагностировать проблемы с IDE.

source: Auto Reload
de: automatisch aktualisieren
fr: Auto rechargement
ru: Автоматическая перезагрузка

source: Immediately Request Reload
de: sofort melden
fr: Proposer le rechargement immédiatement
ru: Немедленно запросить перезагрузку

source: Request Reload on Edit
de: bei Bearbeitung melden
fr: Proposer le rechargement lors de l’édition
ru: Запросить перезагрузку при редактировании

source: Never Reload
de: niemals aktualisieren
fr: Ne jamais recharger
ru: Не перезагружать

source: Selects action to perform on files found to be externally changed but unaltered within the IDE. Use Auto Reload to automatically reload these files, Immediately Request Reload to ask via a dialog box upon detection, Request Reload on Edit to ask only if the unchanged file is edited within the IDE subsequently, or Never Reload to ignore external changes (although you will still be warned if you try to save over an externally changed file)
fr: Sélectionne l'action a exécuter sur les fichiers qui ont été trouvés modifiés à l'extérieur mais qui n'ont pas été modifiés dans l'IDE. Utiliser Rechargement automatique pour recharger automatiquement ces fichiers, Proposer le rechargement immédiatement pour demander que faire via une boîte de dialogue lors de la détection, Proposer le rechargement lors de l’édition pour demander seulement si le fichier inchangé est édité dans l'IDE par la suite, ou Ne jamais recharger pour ignorer les modifications externes (malgré tout vous serez toujours averti si vous essayez d'enregistrer sur un fichier qui a été modifié à l'extérieur)
ru: Выбирает действие для выполнения в файлах, которые изменяются вне среды IDE. Используйте Auto Reload для автоматической перезагрузки этих файлов. Сразу запросить запрос на перезагрузку через диалоговое окно при обнаружении изменений. Запрашивать Request Reload on Edit, только если неизменный файл будет отредактирован в IDE впоследствии или Never Reload, чтобы игнорировать внешние изменения (хотя вы будете все равно предупреждены, если попытаетесь сохранить файл, измененный извне)

source: Selects action to perform on files found to be externally changed and that also have been altered in the IDE. One of Immediately Request Reload to ask via a dialog box upon detection, Request Reload on Edit to ask if the file is edited further, or Never Reload to ignore external changes (although you will always be warned if you try to save over an externally changed file)
fr: Sélectionne l'action a exécuter sur les fichiers qui ont été trouvés modifiés à l'extérieur et qui ont aussi été modifiés dans l'IDE. Choisissez parmi "Proposer le rechargement immédiatement" pour demander que faire via une boîte de dialogue lors de la détection, "Proposer le rechargement lors de l'édition" pour demander si le fichier a été de nouveau édité, ou "Ne jamais recharger" pour ignorer les modifications externes (malgré tout vous serez toujours averti si vous essayez d'enregistrer sur un fichier qui a été modifié à l'extérieur)
ru: Выбирает действие, которое необходимо выполнить для файлов, которые были изменены извне, и которые также были изменены в среде IDE. Один из немедленных запросов на перезагрузку через диалоговое окно при обнаружении несоответствия, Request Reload on Edit, чтобы определить поведение, редактируется ли файл дальше, или никогда не перезагружается, чтобы игнорировать внешние изменения (хотя вы всегда будете предупреждены, если попытаетесь сохранить поверх внешних изменений файла)

source: Time in seconds indicating the frequency with which the IDE should check the disk for files that have changed externally. Set to 0 to disable entirely.
de: Zeit in Sekunden, die die Frequenz angibt, mit welcher das IDE die Festplatte auf extern geänderte Dateien überprüfen sollte. Auf 0 einstellen, um es vollständig zu deaktivieren.
fr: Temps en secondes indicant la fréquence avec laquelle l'IDE doit vérifier sur le disque les fichiers qui ont été modifiés à l'extérieur. Fixer à 0 pour désactiver l'option.
ru: Время в секундах, указывающее частоту, с которой IDE должна проверять диск на наличие внешних файлов. Установите 0, чтобы полностью отключить.

source: Don't reload files if size has not changed and a hash of the contents matches the hash when it was last read. This check is skipped if file is larger than 5 MB.
fr: Ne pas recharger des fichiers si la taille n’a pas changée et que le hachage des contenus ne correspond pas au hachage de la dernière fois qu’il a été lu. Cette vérification est sautée si le fichier est plus gros que 5 MB.
ru: Не перезагружайте файлы, если размер не изменился, а хэш содержимого совпадает с хешем, когда он был в последний раз прочитан. Эта проверка пропускается, если файл больше 5 МБ.

source: When enabled, Wing will automatically reload scripts that extend the IDE when they are edited and saved from the IDE. This makes developing extension scripts for the IDE very fast, and should work in most cases. Disable this when working on extension scripts that do not reload properly, such as those that reach through the scripting API extensively.
de: Wenn diese Funktion aktiviert ist, wird Wing Skripte, die das IDE erweitern, automatisch neu laden, wenn diese im IDE bearbeitet und gespeichert werden. Dadurch wird das Entwickeln von Erweiterungsskripten für das IDE sehr schnell und es sollte meistens funktionieren. Deaktivieren Sie die Funktion, wenn Sie mit Erweiterungsskripten arbeiten, deren Neuladen nicht richtig funktioniert, zum Beispiel bei Skripten, die beträchtlich durch das Skripting-API reichen.
fr: Lorsqu'activé, Wing rechargera automatiquement les scripts qui étendent l'IDE lorqu'ils sont édités et sauvegardés depuis l'IDE. Cela rend le développement de scripts d'extension très rapide, et devrait fonctionner dans la plupart des cas. Désactiver ceci lorsque vous travaillez sur des scripts d'extension qui ne se rechargent pas proprement, comme ceux qui passent beaucoup par le scripting API.
ru: Когда это разрешено, Wing автоматически перезагрузит скрипты, расширяющие IDE, когда они будут отредактированы и сохранены из среды IDE. Это значительно ускоряет разработку сценариев расширения для IDE, и в большинстве случаев они должны работать. Отключите это при работе над сценариями расширения, которые не перезагружаются должным образом, например, те, которые широко используются в скриптовом API.

source: Show a reminder when Support+Upgrades for the active license is expired or will expire soon.
de: Erinnerung anzeigen, wenn Support+Wartung für die aktive Lizenz ausgelaufen sind oder bald auslaufen.
fr: Afficher un rappel quand Support+mises a niveau pour la licence active est expiré ou expirera bientôt.
ru: Отображение напоминания о том, что срок действия поддержки+обновлений для активной лицензии истек или скоро истечет.

source: Base on the Current File or Selection
de: Basierend auf der aktuellen Datei oder Auswahl
fr: Baser sur le fichier actuel ou la sélection
ru: На основе текущего файла или фрагмента

source: Use Project's Home Directory
de: Heimatverzeichnis des Projekts verwenden
fr: Utiliser le répertoire du projet initial
ru: Использовать Домашний Каталог проекта

source: Use Last Open/Save Directory
de: Verzeichnis, das zuletzt geöffnet/gespeichert wurde, verwenden
fr: Utiliser le dernier répertoire ouvert/Sauvegardé
ru: Использовать Последнее Открытый/Сохранить Каталог

source: Use Startup or Current Directory
de: Start- oder aktuelles Verzeichnis verwenden
fr: Utiliser le répertoire de départ ou actuel
ru: Использовать начальный или текущий каталог

source: Use Fixed Directory Specified Below
de: Festgesetztes Verzeichnis, das unten angegeben ist, verwenden
fr: Utiliser le répertoire fixe spécifié ci-dessous
ru: Использовать фиксированный каталог, указанный ниже

source: Defines how Wing determines the starting directory to use when prompting for a file name: Either based on location of the resource at current focus, location of the current project home directory, the last directory visited for file selection, the current directory at startup (or selected since), or always the specific fixed directory entered here.
de: Legt fest, wie Wing das zu verwendende Startverzeichnis bestimmt, wenn nach einem Dateinamen verlangt wird: Dies ist entweder die Stelle der Ressource, die derzeit aktiv ist, die Stelle des aktuellen Projektverzeichnisses, das letzte Verzeichnis, das für die Dateiauswahl besucht wurde, das aktuelle Verzeichnis beim Start (oder das seitdem ausgewählt wurde) oder es ist immer das speziell festgesetzte Verzeichnis, das hier eingegeben ist.
fr: Défini comment Wing détermine le répertoire de départ à utiliser lors de la demande d'un nom de fichier : Soit basé sur l'emplacement de la ressource sur le focus actuel, l'emplacement du répertoire du projet parent actuel, le dernier répertoire visité pour la sélection de fichier, le répertoire actuel au démarrage (ou sélectionné depuis), ou toujours le répertoire fixe spécifié entré ici.
ru: Определяет, как Wing устанавливает начальный каталог, который будет использоваться при запросе имени файла: либо на основе местоположения ресурса в текущем фокусе, и местоположения текущего домашнего каталога проекта, и последнего каталога, посещаемого для выбора файла, текущего каталога при запуске (или выбранный с) или всегда указан конкретный фиксированный каталог.

source: Python Files
de: Python-Dateien
fr: Fichiers Python
ru: Файлы Python

source: Hidden & Temporary Files
de: Versteckte & temporäre Dateien
fr: Fichiers cachés & temporaires
ru: Скрытые и временные файлы

source: All Source Files
de: Alle Source-Dateien
fr: Tous les fichiers sources
ru: Все исходные файлы

source: C/C++ Files
de: C/C++ Dateien
fr: Fichiers C/C++
ru: C/C++ файлы

source: HTML and XML Files
de: HTML- und XML-Dateien
fr: Fichiers HTML et XML
ru: HTML и XML файлы

source: Spec
de: Spezifikation
ru: Спецификации

source: Type
de: Typ
ru: Тип

source: Exclude
de: Ausschließen
fr: Exclus
ru: Исключить

source: Include
de: Einschließen
fr: Inclus
ru: Включить
