Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_process.po
Languages: de, ru

source: The license code you provided is invalid -- please check it and try again
de: Der von Ihnen bereitgestellte Lizenzcode ist ungültig -- Bitte überprüfen Sie sie ihn und versuchen es noch einmal
ru: Указанный вами код лицензии недействителен. -- проверьте его и повторите попытку.

source: The license code you provided not valid for this operating system
de: Der von Ihnen bereitgestellte Lizenzcode ist für diese Betriebssystem nicht gültig
ru: Код лицензии, который вы предоставили недействительно для этой операционной системы

source: Creating Activation
de: Aktivierung wird erstellt
ru: Создание Активации

source: Validating Activation
de: Aktivierung wird validiert
ru: Проверка Активации

source: Internal error (missing field)
de: Interner Fehler (fehlendes Feld)
ru: Внутренняя ошибка (отсутствует поле)

source: Internal error (invalid license)
de: Interner Fehler (ungültige Lizenz)
ru: Внутренняя ошибка (недействительная лицензия)

source: Internal error (invalid request code)
de: Interner Fehler (ungültiger Abfragecode)
ru: Внутренняя ошибка (недопустимый код запроса)

source: You have exceeded the allowed number of trial licenses on this machine. Please email your license id %s to support@wingware.com if you need more time. Sorry about the inconvenience, and thanks for trying Wing Pro!
de: Sie haben die erlaubte Anzahl Probelizenzen für diese Maschine überschritten. Bitte senden Sie Ihre Lizenz-ID %s an support@wingware.com, wenn Sie mehr Zeit benötigen. Wir entschuldigen uns für die Unannehmlichkeiten und bedanken uns dafür, dass Sie Wing Pro testen!
ru: Вы превысили разрешенное количество пробных лицензий на этом компьютере. Если вам нужно больше времени, напишите свой идентификатор лицензии %s на адрес support@wingware.com. Извините за неудобства, и спасибо за использование Wing Pro!

source: You have exceeded your allowed number of license activations. You can increase activation limits at https://wingware.com/license or by emailing your license id %s to support@wingware.com. Sorry for the inconvenience and thanks for using Wing Pro!
de: Sie haben die erlaubte Anzahl Lizenzaktivierungen überschritten. Sie können zusätzliche Aktivierungen unter https://wingware.com/license erhalten oder uns Ihre Lizenz-ID %s per E-Mail an support@wingware.com senden. Wir entschuldigen uns für die Unannehmlichkeiten und bedanken uns dafür, dass Sie Wing Pro verwenden!
ru: Вы превысили допустимое количество активаций лицензии. Вы можете увеличить лимиты активации на https://wingware.com/license или по электронной почте ваш идентификатор лицензии %s support@wingware.com. Извините за неудобства и спасибо за использование Wing Pro!

source: That license has expired. Please contact sales@wingware.com.
de: Diese Lizenz ist abgelaufen. Bitte kontaktieren Sie sales@wingware.com.
ru: Срок действия лицензии истек. Пожалуйста, свяжитесь с sales@wingware.com.

source: This annual license has expired. Please renew at https://wingware.com/store/upgrade&license-id=%s
de: DiThis annual license has expired. Please renew at https://wingware.com/store/upgrade&license-id=%s
ru: Срок действия этой годовой лицензии истек. Пожалуйста, обновите на https://wingware.com/store/upgrade&license-id=%s

source: That license id %s cannot be activated on additional operating systems. Please contact sales@wingware.com if you wish to upgrade your license.
de: Diese Lizenz-ID %s kann nicht auf anderen Betriebssystemen aktiviert werden. Bitte kontaktieren Sie uns unter sales@wingware.com, wenn Sie Ihre Lizenz aufrüsten möchten.
ru: Этот идентификатор лицензии %s нельзя активировать в дополнительных операционных системах. Пожалуйста контактируйте sales@wingware.com если вы хотите обновить лицензию.

source: We have no record of that license id %s. Please check it and try again.
de: Wir haben keine Aufzeichnungen über diese Lizenz-ID %s. Bitte überprüfen Sie diese und versuchen es noch einmal.
ru: У нас нет записи об этом идентификаторе лицензии %s. Проверьте его и повторите попытку.

source: Internal error (unexpected server return value). This may indicate network problems such as a misconfigured proxy server.
de: Interner Fehler (unerwarteter Server-Rückgabe-Wert). Dies kann auf Netzwerkprobleme, zum Beispiel einen falsch konfigurierten Proxy-Server, hinweisen.
ru: Внутренняя ошибка (непредвиденное возвращаемое значение сервера). Это может указывать на проблемы в сети, такие как неправильно настроенный прокси-сервер.

source: That license id %s can only be activated on specially patched versions of Wing. Please contact your vendor or sales@wingware.com.
de: Diese Lizenz-ID %s kann nur auf speziell gepatchten Versionen von Wing aktiviert werden. Bitte kontaktieren Sie Ihren Verkäufer oder sales@wingware.com.
ru: Этот идентификатор лицензии %s может быть активирован только в специально исправленных версиях Wing. Пожалуйста свяжитесь с Вашим поставщиком или sales@wingware.com.

source: This license is not valid for this version of Wing. Please upgrade at https://wingware.com/store/upgrade&license-id=%s
de: Diese Lizenz ist nicht für diese Version von Wing gültig. Bitte aktualisieren unter https://wingware.com/store/upgrade&license-id=%s
ru: Эта лицензия не действительна для данной версии Wing. Пожалуйста, обновите на https://wingware.com/store/upgrade&license-id=%s

source: Unknown activation error code %s
de: Unbekannter Fehlercode %s bei der Aktivierung
ru: Неизвестный код ошибки активации %s

source: Received an invalid activation key "%s" from the server. This may indicate network problems such as a misconfigured proxy server. Errors found were: %s
de: Ungültigen Aktivierungsschlüssel "%s" vom Server erhalten. Dies kann auf Netzwerkprobleme, zum Beispiel einen falsch konfigurierten Proxy-Server, hinweisen. Die folgenden Fehler wurden gefunden: %s
ru: Получен недопустимый ключ активации '%s' с сервера. Это может указывать на проблемы в сети, такие как неправильно настроенный прокси-сервер. Были обнаружены ошибки: %s

source: License Agreement
de: Lizenzvereinbarung
ru: Лицензионное соглашение

source: Wing is licensed software. Its use is subject to the terms and conditions of the following license agreement:
de: Wing ist eine lizenzierte Software. Ihr Gebrauch darf nur im Rahmen der Bedingungen und Konditionen der folgenden Lizenzvereinbarung erfolgen:
ru: Wing - это лицензионное программное обеспечение. Его использование подпадает под действие условий лицензионного соглашения:

source: If you accept the terms of this license agreement, press 'Accept'. Otherwise, press 'Decline.'
de: Wenn Sie die Bedingungen dieser Lizenzvereinbarung annehmen, klicken Sie auf 'Akzeptieren'. Andernfalls klicken Sie auf 'Ablehnen'.
ru: Если вы принимаете условия настоящего лицензионного соглашения, нажмите 'Принять'. В противном случае, нажмите 'Отклонить.'
