Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_diff_commands.po
Languages: de

source: These commands act on the diff/merge manager or on the current project, regardless of keyboard focus.
de: Diese Befehle wirken auf den Vergleichen/Zusammenführen-Manager oder das aktuelle Projekte unabhängig vom Tastatur-Fokus.

source: File A
de: Datei A

source: File A:
de: Datei A:

source: File B
de: Datei B

source: File B:
de: Datei B:

source: Compare Files
de: Dateien vergleichen

source: Cannot compare remote directories
de: Remote-Verzeichnisse können nicht verglichen werden

source: Comparing remote directories is not yet supported. Please email support@wingware.com if you need this feature.
de: Das Vergleichen von Remote-Verzeichnissen wird noch nicht unterstützt. Bitte schreiben Sie eine E-Mail an support@wingware.com falls Sie diese Funktion benötigen.

source: Directory A
de: Verzeichnis A

source: Directory A:
de: Verzeichnis A:

source: Directory B
de: Verzeichnis B

source: Directory B:
de: Verzeichnis B:

source: Compare Directories
de: Verzeichnisse vergleichen

source: Compare Buffer to Disk
de: Puffer mit gespeicherter Version vergleichen

source: Compare to Repository
de: Mit Projektarchiv vergleichen

source: Move to next difference in current diff/merge session
de: Zum nächsten Unterschied in aktueller Vergleichen/Zusammenführen-Sitzung gehen

source: Move to previous difference in current diff/merge session
de: Zum vorherigen Unterschied in aktueller Vergleichen/Zusammenführen-Sitzung gehen

source: Cancel the current diff/merge session
de: Vergleichen/Zusammenführen-Sitzung abbrechen

source: Merge the current change from file A to file B
de: Die aktuelle Änderung von Datei A nach Datei B zusammenführen

source: Merge the current change from file B to file A
de: Die aktuelle Änderung von Datei B nach Datei A zusammenführen
