Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit.po
Languages: de, fr, ru

source: Add File Type...
de: Dateityp hinzufügen...
fr: Ajouter le type de fichier...
ru: Добавить Тип Файла...

source: Remove File Type '%s'
de: Dateityp '%s' entfernen
fr: Enlever le type de fichier '%s'
ru: Удалить Тип Файла '%s'

source: Rename File Type '%s'
de: Dateityp '%s' umbenennen
fr: Renommer le type de fichier '%s'
ru: Переименовать тип файла '%s'

source: Reload All Snippets
de: Alle Schnipsel neu laden
fr: Recharger tous les bouts de code
ru: Перезагрузить Все Фрагменты

source: Restore Factory Defaults
de: Werkseinstellungen wiederherstellen
fr: Restaurer les paramètres d’usine par défaut
ru: Восстановить Заводские Настройки

source: Snippet File Types
de: Schnipsel Dateitypen
fr: Types de fichier de bout de code
ru: Типы файлов фрагментов

source: Exited data entry mode
fr: Sortie du mode d'entrée de données
ru: Выход из режима ввода данных

source: Source Editor
de: Quelltext-Editor
fr: Éditeur de source
ru: Редактор исходного кода

source: (r/o)
fr: (l/s)

source: Entering Snippet: Tab key moves between fields
fr: Entre un bout de code : la touche de tabulation bouge entre les champs
ru: Ввод фрагмента: клавиша Tab перемещается между полями

source: Editors state for %s
de: Editor-Zustand für %s
fr: État de l'éditeur pour %s
ru: Состояние редактора для %s

source: Editor %s selection range
de: Editor %s Auswahlbereich
fr: Intervalle de sélection de l'éditeur %s
ru: Диапазон выбора редактора %s

source: Editor %s scroll position
fr: Position de défilement de l'éditeur %s
ru: Редактор %s положение прокрутки

source: Editor state for %s
de: Editor-Status für %s
fr: État de l'éditeur pour %s
ru: Состояние редактора для %s

source: Failed to wrap text::Wrapping more than 10 lines of Python source that is not a comment or a doc string is currently not supported
de: Textumbruch gescheitert: Umbrechen von mehr als 10 Zeilen von Python Source-Code userhalb Kommente und Strings ist nicht möglich.
fr: Échec de repliement du texte. Replier plus de 10 lignes de source Python qui n'est pas un commentaire ou une docstring n'est actuellement pas supporté
ru: Не удалось перенести текст:: перенос более 10 строк источника Python, который не является комментарием или doc-строкой, в настоящее время не поддерживается

source: Could not find definition of '%s'
de: Konnte Definition von '%s' nicht finden
fr: Impossible de trouver la définition de « %s »
ru: Не удалось найти определение '%s'

source: Could not open definition of '%s'
de: Konnte Definition von '%s' nicht öffnen
fr: N'a pas pu ouvrir la définition de '%s'
ru: Не удалось открыть определение '%s'

source: appending to register '%s'
de: an Register '%s' anhängen
fr: ajoute au registre '%s'
ru: добавление к регистру '%s'

source: register '%s'
fr: registre '%s'
ru: регистр '%s'

source: Restarted macro record (%s)
de: Makroaufzeichnung neu gestartet (%s)
fr: Redémarrage de l'enregistrement de la macro (%s)
ru: Перезапустить запись макроса (%s)

source: Started macro record (%s)
de: Makroaufzeichnung gestartet (%s)
fr: Démarrage de l'enregistrement de la macro (%s)
ru: Начать запись макроса (%s)

source: Stopped macro record (register '%s')
de: Makroaufzeichnung gestoppt (Register '%s')
fr: Arrêt de l'enregistrement de la macro (registre '%s')
ru: Остановить запись макросов (регистр '%s')

source: Macro aborted::Macro register '%s' is undefined
de: Makro abgebrochen::Makro-Register '%s' ist nicht definiert
fr: Macro abandonnée::Le registre de macro '%s' est indéfini
ru: Макрос прерван::Макро регистр '%s' неопределен

source: Macro aborted::Macro aborted due to error in action
de: Makro abgebrochen::Makro abgebrochen wegen Fehler in der Ausführung
fr: Macro abandonnée::Macro abandonnée à cause d'une erreur pendant l'action
ru: Макрос прерван:: Макрос прерван из-за ошибки в действии

source: Executed keyboard macro (register '%s')
de: Tastatur-Makro ausgeführt (Register '%s')
fr: Macro clavier exécutée (registre '%s')
ru: Выполненный макрос клавиатуры (регистр '%s')

source: Cannot Convert
de: Umwandlung nicht möglich
fr: Impossible de convertir
ru: Невозможно преобразовать

source: Could not convert line endings because this file is read-only.
de: Zeilenenden konnten nicht umgewandelt werden, da die Datei nur lesbar ist.
fr: Impossible de convertir les fins de lignes parce que ce fichier est en lecture seule.
ru: Не удалось преобразовать окончания строк, так как этот файл доступен только для чтения.

source: Auto-converted EOLs
de: Zeilenenden Automatisch Umgewandelt
fr: Auto conversion des fins de lignes
ru: Авто-преобразованние EOLs

source: The line-endings in %s were auto-converted from %s to %s, the project's configured preferred line ending. Use Project Properties to alter this value or change the conversion/warning policy.
fr: Les fins-de-lignes dans %s ont été auto-converties de %s à %s, la préférence configurée de fin-de-ligne du projet. Utiliser les propriétés du projet pour modifier cette valeur ou changer la politique de conversion/avertissements.
ru: Концы строк в %s были автоматически конвертированы из %s в %s, конфигурации предпочтительного типа конца строки проекта. Используйте Свойства проекта, чтобы изменить это значение или изменить политику преобразования/предупреждения.

source: Line-ending Policy Violation
de: Richtline für Zeilenenden verletzt
fr: Violation de la Politique de fin de ligne
ru: Нарушение политики окончания строки

source: The file %s contains %s style line-endings but you have configured this project to prefer %s style line-endings. Do you wish to convert the file now?
de: Die Zeilenenden des Dateis %s sind %s aber das Zeilenendengrundsatz des Projekts ist %s. Wollen Sie die Datei jetzt umwandlen?
fr: Le fichier %s contient un style %s de fins-de-lignes mais vous avez configuré ce projet pour préférer le style %s de fins-de-lignes. Souhaitez-vous convertir ce fichier maintenant ?
ru: The file %s contains %s style line-endings but you have configured this project to prefer %s style line-endings. Do you wish to convert the file now? Файл %s содержит стили конца строк %s, но вы настроили этот проект на предпочтение окончания строки %s. Вы хотите преобразовать файл сейчас?

source: C_ut
de: A_usschneiden
fr: Co_uper
ru: Вырезать

source: _Copy
de: _Kopieren
fr: _Copier
ru: Копировать

source: _Goto Definition in Other Split
de: _Gehe zur Definition in anderer Teilung
fr: _Aller à la définition dans une autre division
ru: Перейти к определению в другом разделе (сплите)

source: Find Points of Use
de: Verwendungspunkte finden
fr: Trouver les points d'utilisation
ru: Найти точки использования

source: Re_factor
de: Ü_berarbeiten
fr: Re_factoriser
ru: Рефакторинг

source: Toggle Bookmark
de: Lesezeichen umschalten
fr: Basculement de signet
ru: Переключение закладок

source: Reanaly_ze File
de: Datei neu anal_ysieren
fr: Réanaly_ser le fichier
ru: Повторный Анализ Файла

source: Run Tests
de: Tests starten
fr: Lancer les tests
ru: Запуск тестов

source: Debug Tests
de: Tests debuggen
fr: Déboguer les tests
ru: Отладочные тесты

source: Debug This File
de: Diese Datei debuggen
fr: Déboguer ce fichier
ru: Отладить этот файл

source: Debug To Here
de: Bis hier debuggen
fr: Déboguer jusqu'Ici
ru: Отладка до этого места

source: Move Program Counter Here
fr: Déplacer le compteur du programme Ici
ru: Переместить Счетчик Программ в это место

source: _Evaluate Selection in Python Shell
de: Auswahl in Python-Shell b_ewerten
fr: _Évaluer la sélection dans le Shell Python
ru: Выполнить выбор в оболочке Python

source: Add _Breakpoint
de: _Haltepunkt hinzufügen
fr: Ajouter un _point d'arrêt
ru: Добавить Точку Останова

source: Remove _Breakpoint
de: Halte_punkt entfernen
fr: _Enlever le point d'arrêt
ru: Удалить Точку Останова

source: Enable Brea_kpoint
de: Haltepun_kt aktivieren
fr: A_ctiver le point d'arrêt
ru: Включить Точку Останова

source: Disable Brea_kpoint
de: Haltepunkt de_aktivieren
fr: Désactiv_er le point d'arrêt
ru: Отключить Точку Останова

source: Watch Selection in Debugger
de: Auswahl im Debugger beobachten
fr: Surveiller la sélection dans le Débogueur
ru: Отслеживать выбор в Отладчике

source: Watch '%s' in Debugger
de: '%s' im Debugger beobachten
fr: Surveiller '%s' dans le Débogueur
ru: Отслеживать '%s' в Отладчике

source: Comment Out R_egion
de: Be_reich auskommentieren
fr: Commenter la r_égion
ru: Закомментировать выбранное

source: Uncomment out Re_gion
de: _Kommentar im Bereich aufheben
fr: Décommenter la ré_gion
ru: Раскомментировать выбранное

source: _Indent
de: Ein_rücken
fr: _Indenter
ru: Отступ

source: Dede_nt
de: Au_srücken
fr: _Désindenter
ru: Убрать Отступ

source: _Match Indent
de: E_inrückung anpassen
fr: _Ajuster l'indentation
ru: Сопоставить Отступ

source: Configure Menu...
de: Menü konfigurieren...
fr: Configurer le menu...
ru: Настроить Меню...

source: P_roperties...
de: Eige_nschaften...
fr: P_ropriétés...
ru: Свойства...

source: Edit _Conditional Breakpoint
de: _Bedingten Haltepunkt bearbeiten
fr: Éditer le point d'arrêt conditionnel
ru: Изменить Условную Точку Останова

source: Set _Conditional Breakpoint
de: _Bedingten Haltepunkt setzen
fr: Établir un point d'arrêt _conditionnel
ru: Установить Условную Точку Останова

source: Set _Temporary Breakpoint
de: _Temporären Halte_punkt setzen
fr: Établir un point d'arrêt _temporaire
ru: Установить Временную Точку Останова

source: _Enable Breakpoint
de: Haltepunkt _aktivieren
fr: _Activer le point d'arrêt
ru: Включить Точку Останова

source: _Disable Breakpoint
de: Haltepunkt _deaktivieren
fr: _Désactiver le point d'arrêt
ru: Отключить Точку Останова

source: Disable _All Breakpoints
de: _Alle Haltepunkte deaktivieren
fr: Désactiver _tous les points d'arrêts
ru: Отключить Все Точки Останова

source: Enable _All Breakpoints
de: _Alle Haltepunkte aktivieren
fr: Activer _tous les points d'arrêts
ru: Включить Все Точки Останова

source: _Ignore Breakpoint
de: Haltepunkt _ignorieren
fr: _Ignorer le point d'arrêt
ru: Игнорировать Точку Останова

source: _Remove All Breakpoints
de: Alle Haltepunkte entfe_rnen
fr: _Enlever tous les points d'arrêts
ru: Удалить Все Точки Останова

source: _Toggle Fold
de: Falte _wechseln
fr: _Basculement du repliement
ru: Переключить Складку

source: _Collapse More
de: Mehr _zusammenklappen
fr: _Réduire plus
ru: Свернуть Еще

source: E_xpand More
de: Mehr _erweitern
fr: D_évelopper plus
ru: Расширить Подробнее

source: Colla_pse Completely
de: Vollständig zusammen_klappen
fr: Réduire complètement
ru: Свернуть Полностью

source: Expand C_ompletely
de: V_ollständig erweitern
fr: Développer complètement
ru: Полностью Расширить

source: Collapse A_ll Folds
de: A_lle Falten zusammenklappen
fr: Réduire tous les repliements
ru: Свернуть Все Свёртки

source: Expand _All
de: _Alle erweitern
fr: Tout développer
ru: Развернуть Все

source: Fold Python _Methods
de: Python-_Methoden falten
fr: Repliement des méthodes Python
ru: Свернуть Методы Python

source: Fold Python _Classes
de: Python-_Klassen falten
fr: Repliement des classes Python
ru: Свернутые классы Python

source: Fold Python Classes and _Defs
de: Python-Klassen und _Defs falten
fr: Repliement des classes Python et des définitions
ru: Свернуть классы Python и Функции

source: Brace match: no match found
de: Klammernsuche: Keine zusammenpassenden gefunden
fr: Correspondance des parenthèses : pas de correspondance trouvée
ru: Поиск по скобкам: не найдено совпадений

source: Match at line %i: %s
de: Übereinstimmung an Zeile %i: %s
fr: Correspondance à la ligne %i : %s
ru: Совпадения в строке %i: %s

source: (r/o on disk)
de: (n-l auf Platte)
fr: (l/s sur le disque)
ru: (r/o на диске)

source: (r/o)
de: (n-l)
fr: (l/s)

source: Field #%i |
de: Feld #%i |
fr: Champ #%i |
ru: Поле #%i |

source: Block Entry |
fr: Entrée du bloc |
ru: Блокировка Ввода |

source: Col
de: Spalte
fr: Colonne
ru: Столбец

source: Cols
de: Spalten
fr: Colonnes
ru: Столбцы

source: Failed to save portions of visual state for %s:
de: Das Speichern von Teilen des visuellen Zustandes für %s ist fehlgeschlagen:
fr: Impossible d'enregistrer des parties de l'état visuel pour %s :
ru: Не удалось сохранить части визуального состояния для %s:

source: Restoring state after abandoning changes failed
de: Zustand wiederherstellen, nachdem Verwerfen der Änderungen gescheitert ist
fr: Échec de la restauration de l'état après l'abandon des modifications
ru: Восстановить состояния после отказа от изменений не удалось

source: Cannot insert binary file
de: Kann nicht Binärdateien einfügen
fr: Impossible d'insérer un fichier binaire
ru: Не удается вставить двоичный файл

source: The selected file contains binary data -- insert file operation failed.
de: Das gewählte Datei enhält Binärdaten -- Einfügen gescheitert.
fr: Le fichier sélectionné contient dans données binaires -- l'opération d'insertion du fichier a échoué.
ru: Выбранный файл содержит двоичные данные -- ошибка вставки файла.

source: Cannot decode command output
de: Die Befehlsausgabe kann nicht dekodiert werden
fr: Impossible de décoder la commande de sortie
ru: Невозможно декодировать вывод команды

source: The command output's encoding could not be determined -- insert command operation failed.
de: Die Kodierung der Befehlsausgabe konnte nicht bestimmt werden -- Die Operation 'Befehl einfügen' ist fehlgeschlagen.
fr: L'encodage de la sortie de la commande ne peut pas être déterminé -- l'opération commande d'insertion a échoué.
ru: Кодировка выходного сигнала команды не может быть определена - операция команды ввода завершилась неудачно.

source: Cannot insert binary data
de: Binärdaten können nicht eingefügt werden
fr: Impossible d'insérer des données binaires
ru: Невозможно вставить двоичные данные

source: The command output binary data -- insert command operation failed.
de: Der Befehl hat Binärdaten ausgegeben -- Die Operation 'Befehl einfügen' ist fehlgeschlagen.
fr: Donnée binaire de sortie de la commande -- l'opération de la commande d'insertion a échoué.
ru: Команда вывода двоичных данных -- вставленной команде не удалось выполнить операцию.

source: Failed to Execute Command
de: Das Ausführen des Befehls ist gescheitert
fr: Échec de l'Exécution de la commande
ru: Не удалось выполнить команду

source: The command %s failed err=%s, status=%s -- insert command operation failed.
de: Der Befehl %s ist fehlgeschlagen err=%s, status=%s -- Die Operation 'Befehl einfügen' ist fehlgeschlagen.
fr: La commande %s a échoué err=%s, statuts=%s -- l'opération de la commande d'insertion a échoué.
ru: The command failed , status=%s -- insert command operation failed. Команду %s не удалось выполнить err=%s, status=%s -- вставка команды завершилась неудачно.

source: Command Timed Out
de: Befehl abgebrochen
fr: Délai de commande expiré
ru: Время Ожидания Команды Истекло

source: The command %s timed out -- insert command operation failed.
de: Der Befehl %s wurde abgebrochen -- Die Operation 'Befehl einfügen' ist fehlgeschlagen.
fr: Le délai de la commande %s a expiré -- l'opération de la commande d'insertion a échoué.
ru: The command %s timed out -- insert command operation failed. Время ожидания команды %s истекло -- вставка команды завершилась неудачно.

source: Invalid line range (start after end)
fr: Intervalle de ligne invalide (début après la fin)

source: Target cannot be within the range
fr: La cible ne peut pas être dans l'intervalle
ru: Показатель за пределами диапазона

source: Start line is outside of the file
fr: La ligne de début est en dehors du fichier
ru: Начальная строка находится вне файла

source: End line is outside of the file
fr: La ligne de fin est en dehors du fichier
ru: Конечная строка находится вне файла

source: Target line is outside of the file
fr: La ligne ciblée est en dehors du fichier
ru: Целевая строка находится вне файла

source: Disk file is newer
de: Datei auf der Festplatte ist neuer
fr: Le fichier du disque est plus récent
ru: Файл на диске новее

source: This file is newer on disk. Do you want to edit anyway, cancel your edit, or abandon your changes and re-read from disk?
de: Diese Datei ist auf der Festplatte neuer. Möchten Sie sie trotzdem bearbeiten, abbrechen oder Ihre Änderungen verwerfen und erneut von der Festplatte lesen?
fr: Ce fichier est plus récent sur le disque. Voulez-vous l'éditer tout de même, annuler votre édition, ou abandonner vos modifications et le relire depuis le disque ?
ru: Этот файл старее чем на диске. Вы хотите все равно продолжить редактирование, отменить редактирование или отказаться от изменений и повторно прочитать с диска?

source: Con_figure Reloading
de: Neu Laden kon_figurieren
fr: Con_figurer le rechargement
ru: Настройка Перезагрузки

source: _Edit Anyway
de: Trotzdem B_earbeiten
fr: _Éditer tout de même
ru: Редактировать В Любом Случае

source: _Cancel Edit
de: Bearbeiten abbre_chen
fr: _Annuler l'édition
ru: Отменить Правку

source: _Reread from Disk
de: E_rneut von der Festplatte lesen
fr: Relire depuis le disque
ru: Переагрузить с диска

source: Auto-indented for context; use undo to restore indentation
de: Automatisch eingerückt ensprechend des Kontextes; benutzen Sie Rückgängig um die Einrück wiederherzustellen
fr: Auto-indenté par rapport au contexte ; utiliser annuler pour rétablir l'indentation
ru: Авто-отступ для связи; используйте отмену, чтобы восстановить отступы

source: Auto-indented to caret; use undo to restore indentation
de: Automatisch eingerückt ensprechend des Textcursors; benutzen Sie Rückgängig um die Einrück wiederherzustellen
fr: Auto-indenté au curseur ; utiliser annuler pour rétablir l'indentation
ru: Авто-отступ для каретки; использовать отмену для восстановления отступа

source: 1 Selection
de: 1 Auswahl
fr: 1 sélection
ru: 1 Выбор

source: Selections
de: Auswahlen
fr: Sélections
ru: Выбор

source: Rectangle Selection
de: Rechteck-Auswahl
fr: Sélection d’un rectangle
ru: Выбор Прямоугольником

source: {} Selections
de: {} Auswahlen
fr: {} Sélections
ru: {} Выбор

source: Default for Personality
de: Voreinstellung für Individualität
fr: Personnalité par défaut
ru: Персональные умолчания

source: Indent to Match
de: Einrücken zum Anpassen
fr: Ajuster l'indentation
ru: Отступ в соответствии

source: Move to Next Tab Stop
de: Zum nächsten Tab-Stop bewegen
fr: Avancer jusqu'au stop de tabulation suivant
ru: Перейти к следующей Позиции Табуляции

source: Indent Region
de: Einrückungsbereich
fr: Indenter la région
ru: Отступ Региона

source: Insert Tab Character
de: Tab-Zeichen einfügen
fr: Insérer le caractère de tabulation
ru: Вставить Символ Табуляции

source: Smart Tab (varies by context)
fr: Tabulation intelligente (varie selon le contexte)
ru: Smart Tab (зависит от контекста)

source: _Non-python files
de: _Nicht-Python-Dateien
fr: Fichiers non-Python
ru: Не python файлы

source: _Python files
de: _Python-Dateien
fr: Fichiers _Python
ru: Python файлы

source: Failed
de: Gescheitert
fr: Échec
ru: Неудачный

source: Wrapped
fr: Replié
ru: Завернутый

source: Search:
de: Suche:
fr: Recherche :
ru: Поиск:

source: Regex Search:
de: Regex-Suche:
fr: Recherche avec expressions régulières :
ru: Поиск Regex :

source: Back Search:
de: Suche Rückwärts:
fr: Recherche arrière :
ru: Поиск назад:

source: Back Regex Search:
de: Regex-Suche Rückwärts:
fr: Recherche arrière avec expressions régulières :
ru: Поиск Regex назад:

source: Replace string:
de: Zeichenkette ersetzen:
fr: Remplacer la chaîne :
ru: Заменить строку:

source: Query replace:
de: Frage ersetzen:
fr: Requête de remplacement :
ru: Запрос заменить:

source: Replace %s with:
de: %s ersetzen durch:
fr: Remplacer %s par :
ru: Заменить %s на:

source: Replaced %i occurrences
de: %i Vorkommen ersetzt
fr: Remplacer %i occurrences
ru: Заменено %i вхождений

source: Replace? (y or n):
de: Ersetzen? (j oder n):
fr: Remplacer ? (y ou n) :
ru: Заменить? (y or n):

source: Default file extension for newly created files
de: Voreingestellter Dateizusatz für neu erstellte Dateien
fr: Extension par défaut des fichiers nouvellement créés
ru: Расширение файла по умолчанию для новых файлов

source: Carriage Return \r (Mac OS <= 9)
de: Wagenrücklauf \r (Mac OS <= 9)
fr: Retour chariot \r (Mac OS <= 9)
ru: Возврат каретки \r (Mac OS <= 9)

source: Carriage Return and Line Feed \r\n (Windows)
de: Wagenrücklauf und Zeilenvorschub \r\n (Windows)
fr: Retour chariot et saut de ligne \r\n (Windows)
ru: Возврата каретки и перевод строки \r\n (Windows)

source: Default end-of-line to use. Wing matches existing line endings in non-blank files and uses this preference only when a file contains no end-of-line characters.
fr: Fin-de-ligne à utiliser par défaut. Wing fait correspondre les fins de lignes dans les fichiers non-vides et utilise cette préférence uniquement lorsqu'un fichier ne contient pas de caractères de fin-de-ligne.
ru: Конец строки по умолчанию для использования. Wing соответствует существующим окончаниям строк в непустых файлах и использует это предпочтение только в том случае, если файл не содержит символов конца строки.

source: Selects the overall editor personality, optionally to emulate another commonly used editor.
fr: Sélectionne la personnalité générale de l'éditeur, optionellement émule un autre éditeur communément utilisé.
ru: Выбирает общий характер редактора, при необходимости для эмуляции другого часто используемого редактора.

source: Always
de: Immer
fr: Toujours
ru: Всегда

source: In Python Only
de: Nur in Python
fr: Dans Python seulement
ru: Только В Python

source: Never
de: Niemals
fr: Jamais
ru: Никогда

source: None/Disabled
de: Keine/Deaktiviert
fr: Sans/désactivé
ru: None/Выключено

source: Spaces Only
de: Nur Leerzeichen
fr: Espaces uniquement
ru: Только Пробелы

source: Tabs Only
de: Nur Tabs
fr: Tabulations uniquement
ru: Только Табуляция

source: Tabs and Spaces
de: Tabs und Leerzeichen
fr: Tabulations et espaces
ru: Табуляция и пробелы

source: Match File
fr: Fichier correspondant
ru: Совпадающие Файлы

source: Select type of indentation that Smart Tab will place at the end of a line.
fr: Sélectionne le type d’indentation que la tabulation intelligente placera en fin d’une ligne.
ru: Выберите Тип отступа, который Smart Tab (Smart Tab) разместит в конце строки.

source: Set size of tabs, in spaces, used in new files. Note that in Python files that contain mixed space and tab indentation, tab size is always forced to 8 spaces. Use the Indentation Manager to alter indentation in existing files.
de: Stellt Größe der Tabs (in Leerzeichen) ein, die in neuen Dateien verwendet werden. Beachten Sie, dass in Python-Dateien, die gemischte Leerzeichen- und Tab-Einrückungen beinhalten, die Tabgröße immer zwingend acht Leerzeichen erfordert. Verwenden Sie den Einrückungsmanager, um Einrückungen in bestehenden Dateien zu ändern.
fr: Définir la taille des tabulations, en espaces, utilisées dans les nouveaux fichiers. Noter que dans les fichiers Python contenant des indentations formées d'espaces mixés avec des tabulations, la taille de tabulations est toujours forcée à 8 espaces. Utiliser le gestionnaire d'indentations pour modifier l'indentation des fichiers existants.
ru: Задайте размер табуляции в пробелах, используемых в новых файлах. Обратите внимание, что в файлах Python, содержащих смешанное пространство и отступ табуляцию, размер табуляции всегда равен 8 пробелам. Используйте Диспетчер отступов для изменения размера отступов в существующих файлах.
