Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit_commands.po
Languages: de, fr

source: Duplicate the current line or lines above the selection.
fr: Dupliquer la, ou les, ligne(s) courante(s) au-dessus de la sélection.

source: Filter the lines covered by the next cursor move command through an external command and replace the lines with the result
de: Zeilen, die mit der nächsten Cursor-Bewegung eingeschlossen werden, durch einen externen Befehl filtern und die Zeilen mit dem Ergebnis ersetzen
fr: Filtrer les lignes couvertes par la prochaine commande de déplacement du curseur à travers une commande externe et remplace les lignes avec le résultat

source: Filter the current selection through an external command and replace the lines with the result
de: Die aktuelle Auswahl durch einen externen Befehl filtern und die Zeilen mit dem Ergebnis ersetzen
fr: Filtre la sélection actuelle par une commande externe et remplace les lignes avec le résultat

source: Filter a range of lines in the editor through an external command and replace the lines with the result. Filters the whole file by default. Filters nothing and opens up a scratch buffer with the output of the command if start_line and end_line are both -1.
fr: Filtre une gamme de lignes dans l'éditeur par une commande externe et remplace les lignes avec le résultat. Filtre le fichier complet par défaut. Ne filtre rien et ouvre une mémoire tampon vide avec la sortie de la commande si start_line et end_line sont tous deux à -1.

source: Change case of the current selection, or character ahead of the cursor if there is no selection, to upper case
de: Die Schreibung der aktuellen Auswahl zu Großbuchstaben ändern. Wenn nichts ausgewählt ist, das Zeichen vor dem Cursor in Großschreibung ändern.
fr: Changer la casse de la sélection actuelle, ou du caractère devant le curseur si il n'y a pas de sélection, en majuscule

source: Change case of the current selection, or character ahead of the cursor if there is no selection, to lower case
de: Die Schreibung der aktuellen Auswahl zu Kleinbuchstaben ändern. Wenn nichts ausgewählt ist, das Zeichen vor dem Cursor in Kleinschreibung ändern.
fr: Changer la casse de la sélection actuelle, ou du caractère devant le curseur si il n'y a pas de sélection, en minuscule

source: Change case of the current selection, or character ahead of the cursor if there is no selection, to title case (first letter of each word capitalized)
de: Den ersten Buchstaben jedes Wortes der aktuellen Auswahl zu Großbuchstaben ändern. Wenn nichts ausgewählt ist, das Zeichen vor dem Cursor in Großschreibung ändern.
fr: Changer la casse de la sélection actuelle, ou du caractère devant le curseur si il n'y a pas de sélection, en titre (première lettre de chaque mot en majuscule)

source: Change case of the current selection, or character ahead of the cursor if there is no selection, so each letter is the opposite of its current case
de: Die Groß- und Kleinschreibung der aktuellen Auswahl ändern, so dass jeder Buchstabe zur entgegengesetzten Schreibung umgewandelt wird (d.h. alle Kleinbuchstaben werden zu Großbuchstaben umgewandelt und umgekehrt). Wenn nichts ausgewählt ist, wird das Zeichen vor dem Cursor umgewandelt.
fr: Changer la casse de la sélection actuelle, ou du caractère devant le curseur si il n'y a pas de sélection, pour que chaque lettre de soit de sa casse opposée

source: Change case of text spanned by next cursor movement to upper case
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, zu Großbuchstaben ändern
fr: Changer la casse du texte couvert par le prochain mouvement du curseur en majuscule

source: Change case of text spanned by next cursor movement to lower case
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, zu Kleinbuchstaben ändern
fr: Changer la casse du texte couvert par le prochain mouvement du curseur en minuscule

source: Change case of text spanned by next cursor movement to title case (first letter of each word capitalized)
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, ändern, so dass der erste Buchstabe jedes Worts groß geschrieben wird
fr: Changer la casse du texte couvert par le prochain mouvement du curseur en une casse de titre (première lettre de chaque mot en majuscule)

source: Change case of text spanned by next cursor movement so each letter is the opposite of its current case
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, ändern, so dass jeder Buchstabe zur entgegengesetzten Schreibung umgewandelt wird (d.h. alle Kleinbuchstaben werden zu Großbuchstaben umgewandelt und umgekehrt)
fr: Changer la casse du texte couvert par le prochain mouvement du curseur de façon à ce que chaque lettre soit l'opposée de sa casse actuelle

source: Select all text in the editor
de: Gesamten Text im Editor auswählen
fr: Sélectionner tout le texte dans l'éditeur

source: Select the current line or lines
fr: Sélectionner la, ou les, ligne(s) courante(s)

source: Open the current line by inserting a newline after the caret
fr: Ouvrir la ligne courante en insérant une nouvelle ligne après le curseur

source: Place a new line before the current line
fr: Placer une nouvelle ligne avant la ligne courante

source: Place a new line after the current line
fr: Placer une nouvelle ligne après la ligne courante

source: Move the current line or lines up one line, optionally indenting to match the new position
fr: Déplacer la ou les lignes actuelle(s) d’une ligne au-dessus, optionellement en indentant pour correspondre à la nouvelle position

source: Scroll to current cursor position, if not already visible
de: Bild zur aktuellen Cursor-Position rollen, wenn nicht bereits sichtbar
fr: Défiler à la position de curseur actuelle, si non déjà visible

source: Scroll so cursor is centered on display
de: Bild so rollen, dass der Cursor in der Anzeige zentriert wird
fr: Défiler pour que le curseur soit centré sur l'affichage

source: Scroll so cursor is centered at top of display
de: Bild so rollen, dass der Cursor oben in der Anzeige zentriert wird
fr: Défiler pour que le curseur soit centré en haut de l'affichage

source: Scroll so cursor is centered at bottom of display
de: Bild so rollen, dass der Cursor unten in der Anzeige zentriert wird
fr: Défiler pour que le curseur soit centré en bas de l'affichage

source: Move cursor to center of display (without scrolling)
de: Cursor zur Mitte der Anzeige bewegen (ohne Rollen)
fr: Déplacer le curseur au centre de l'affichage (sans défiler)

source: Move cursor to top of display (without scrolling), optionally at an offset of given number of lines below top
de: Cursor zum Anfang der Anzeige bewegen (ohne Rollen), optional mit einer Verschiebung einer bestimmten Zeilenanzahl unter dem Anfang
fr: Déplacer le curseur en haut de l'affichage (sans défiler), optionellement avec un décalage d'un nombre de lignes en-dessous du haut

source: Move cursor to bottom of display (without scrolling), optionally at an offset of given number of lines before bottom
de: Cursor zum Ende der Anzeige bewegen (ohne Rollen), optional mit einer Verschiebung um eine bestimmte Zeilenanzahl vor dem Ende
fr: Déplacer le curseur en bas de l'affichage (sans défiler), optionellement avec un décalage d'un nombre de lignes avant le bas

source: Turn on display of the current text selection
de: Anzeige der aktuellen Textauswahl anschalten
fr: Activer l'affichage de la sélection de texte courante

source: Turn off display of the current text selection
de: Anzeige der aktuellen Textauswahl ausschalten
fr: Désactiver l'affichage de la sélection de texte courante

source: Cancel current editor command
de: Aktuellen Editorbefehl abbrechen
fr: Annuler la commande courante de l'éditeur

source: Complete the current active autocompletion.
de: Die gegenwärtig aktive Auto-Vervollständigung vervollständigen.
fr: Compléter l'autocomplétion active courante.

source: Cancel any active autocompletion.
de: Jede aktive Auto-Vervollständigung abbrechen.
fr: Annuler toute autocomplétion active.

source: Activate the 1st symbol menu for the editor.
de: Das 1. Symbol-Menü für den Editor aktivieren.
fr: Activer le 1er menu de symboles pour l'éditeur.

source: Activate the 2nd symbol menu for the editor.
de: Das 2. Symbol-Menü für den Editor aktivieren.
fr: Activer le 2nd menu de symboles pour l'éditeur.

source: Activate the 3rd symbol menu for the editor.
de: Das 3. Symbol-Menü für den Editor aktivieren.
fr: Activer le 3ème menu de symboles pour l'éditeur.

source: Activate the 4th symbol menu for the editor.
de: Das 4. Symbol-Menü für den Editor aktivieren.
fr: Activer le 4ème menu de symboles pour l'éditeur.

source: Activate the 5th symbol menu for the editor.
fr: Activer le 5ème menu de symboles pour l'éditeur.

source: Copy the current lines(s) to clipboard
fr: Copier les lignes courantes dans le presse-papier

source: Cut the current line(s) to clipboard.
de: Die aktuelle Zeile(n) in die Zwischenablage ausschneiden.
fr: Couper les lignes courantes dans le presse-papier.

source: Cut the current selection or current line if there is no selection. The text is placed on the clipboard.
fr: Couper la sélection ou la ligne actuelle si il n'y a pas de sélection. Le texte est placé dans le presse-papier.

source: Copy the current selection or current line if there is no selection. The text is placed on the clipboard.
fr: Copier la sélection ou la ligne actuelle si il n'y a pas de sélection. Le texte est placé dans le presse-papier.

source: Rescan file for code analysis.
de: Datei für die Code-Analyse erneut durchsuchen.
fr: Rescanner le fichier pour une analyse du code.

source: Strip trailing whitespace from each line.
de: Nachfolgende Leerräume von jeder Zeile entfernen.
fr: Enlever les espaces blancs de fin de chaîne de chaque ligne.

source: Select more code on either the current line or larger multi-line blocks.
fr: Sélectionner plus de code sur la ligne actuelle ou des blocs multi-lignes plus larges.

source: Select the block the cursor is in.
fr: Sélectionner le bloc où se trouve le curseur.

source: Select the scope the cursor is in.
fr: Sélectionner la portée où se trouve le curseur.

source: Add an extra selection for all occurrences of the main selection text in the file
fr: Ajouter une extra sélection pour toutes les occurrences de la principale sélection de texte dans le fichier

source: Editor commands that act on the current (most recently active) source editor, whether or not it currently has the keyboard focus.
de: Editor-Befehle, die für den aktuellen (zuletzt aktiven) Source-Editor gelten, egal ob für diesen die Tastatur aktiviert ist.
fr: Commandes d'éditeur qui agissent sur l'éditeur de source actuel (le plus récemment actif), qu'il ait ou non le focus actuellement sur le focus du clavier.

source: Raise editor window if necessary in this windowing mode
de: Editor-Fenster, wenn notwendig, in diesem Fenster-Modus aufschlagen
fr: Faire resortir la fenêtre d'éditeur si nécessaire dans ce mode de fenêtrage

source: Initiate incremental mini-search query/replace from the cursor position.
de: Eine inkrementale Mini-Suche Anfrage/Ersetzen von der Cursor- Position beginnen.
fr: Initier une mini-recherche incrémentale de requête/remplacement depuis la position du curseur.

source: The search string
de: Die Suchzeichenkette
fr: La chaîne recherchée

source: Search:
de: Suche:
fr: Chercher :

source: The replacement string
de: Die Ersetzen-Zeichenkette
fr: La chaîne de remplacement

source: Replace:
de: Ersetzen:
fr: Remplacer :

source: Initiate incremental mini-search query/replace from the cursor position. The search string is treated as a regular expression.
de: Eine inkrementale Mini-Suche Anfrage/Ersetzen von der Cursor- Position beginnen. Der Suchstring wird als regulärer Ausdruck behandelt.
fr: Initier une mini-recherche incrémentale de requête/remplacement depuis la position du curseur. La chaîne recherchée est traitée comme une expression régulière.

source: The search regular expression
de: Der reguläre Ausdruck der Suche
fr: La recherche d'expression régulière

source: Regex:
fr: Expression régulière :

source: Replace all occurrences of a string from the cursor position to end of file.
de: Alle Vorkommen einer Zeichenkette von der Cursor-Position bis zum Ende der Datei ersetzen.
fr: Remplacer toutes les occurences d'une chaîne de caractères depuis la position du curseur jusqu'à la fin du fichier.

source: Replace all occurrences of a string from the cursor position to end of file. The search string is treated as a regular expression.
de: Alle Vorkommen einer Zeichenkette von der Cursor-Position bis zum Ende der Datei ersetzen. Der Suchstring wird als regulärer Ausdruck behandelt.
fr: Remplacer toutes les occurences d'une chaîne de caractères depuis la position du curseur jusqu'à la fin du fichier. La chaîne de caractères est traitée comme une expression régulière.

source: Replace num characters with given character. Set line_mode to multiline to allow replacing across lines, extend to replace on current line and then extend the line length, and restrict to replace only if enough characters exist on current line after cursor position.
de: Numerische Zeichen mit gegebenen Zeichen ersetzen. 'line_mode' (Zeilenmodus) auf 'multiline' (mehrere Zeilen) setzen, um das Ersetzen über mehrere Zeilen zu ermöglichen, auf 'extend' (erweitern) setzen, um auf der aktuellen Zeile zu ersetzen und dann die Zeilenlänge zu erweitern und auf 'restrict' (begrenzen) setzen, um nur dann zu ersetzen, wenn nach der Cursor-Position auf der aktuellen Zeile genügend Zeichen vorhanden sind.
fr: Remplacer les caractères numériques avec le caractère doné. Affecter line_mode à multiline pour autoriser le remplacer à travers les lignes, étendre le remplacement à la ligne actuelle et étendre aussi la longueur de la ligne, et restreindre le remplacement seulement si suffisament de caractères existent sur la ligne actuelle après la position du curseur.

source: Zoom in, increasing the text display size temporarily by one font size
de: Vergrößern, vergrößert die Größe der Textanzeige vorübergehend um einen Schriftgrad
fr: Zoom avant, augmente la taille de l'affichage du texte temporairement d'une taille de police

source: Zoom out, increasing the text display size temporarily by one font size
de: Verkleinern, verkleinert die Größe der Textanzeige vorübergehend um einen Schriftgrad
fr: Zoom arrière, diminue la taille de l'affichage du texte temporairement d'une taille de police

source: Reset font zoom factor back to zero
fr: Réinitialiser le facteur de zoom de la police à zéro

source: Turn on all special marks for displaying white space and end-of-line
de: Alle speziellen Markierungen anschalten, um Leerräume und das Zeilenende anzuzeigen
fr: Activer toutes les marques spéciales pour afficher les espaces et les fins-de-lignes

source: Turn off all special marks for displaying white space and end-of-line
de: Alle speziellen Markierungen ausschalten, um Leerräume und das Zeilenende anzuzeigen
fr: Désactiver toutes les marques spéciales pour afficher les espaces et les fins-de-lignes

source: Turn on special marks for displaying white space
de: Spezielle Markierungen anschalten, um Leerräume anzuzeigen
fr: Activer toutes les marques spéciales pour afficher les espaces

source: Turn off special marks for displaying white space
de: Spezielle Markierungen ausschalten, um Leeräume anzuzeigen
fr: Désactiver toutes les marques spéciales pour afficher les espaces

source: Turn on special marks for displaying end-of-line chars
de: Spezielle Markierungen anschalten, um die Zeichen am Zeilenende anzuzeigen
fr: Activer toutes les marques spéciales pour afficher les caractères de fin-de-ligne

source: Turn off special marks for displaying end-of-line chars
de: Spezielle Markierungen ausschalten, um die Zeichen am Zeilenende anzuzeigen
fr: Désactiver toutes les marques spéciales pour afficher les caractères de fin-de-ligne

source: Turn on special marks for displaying indent level
de: Spezielle Markierungen anschalten, um das Einrückungslevel anzuzeigen
fr: Activer toutes les marques spéciales pour afficher les niveaux d'indentation

source: Turn off special marks for displaying indent level
de: Spezielle Markierungen ausschalten, um das Einrückungslevel anzuzeigen
fr: Désactiver toutes les marques spéciales pour afficher les niveaux d'indentation

source: Set editor to be readonly. This cannot be done if the editor contains any unsaved edits.
de: Editor auf nur-lesbar setzen. Diese kann nicht gemacht werden wann der Editor ungespeicherte Änderungen enthält.
fr: Fixer l'éditeur en lecture-seule. Cela ne peut être réalisé si l'éditeur contient des modifications non sauvegardées.

source: Set editor to be writable. This can be used to override the read-only state used initially for editors displaying files that are read-only on disk.
de: Editor auf schreibbar setzen. Dies kann verwendet werden, um den nur-lesbaren Zustand des Editors zu überschreiben, wenn eine nur-lesbare Datei geöffnet wird.
fr: Fixer l'éditeur en lécriture. Cela peut être utilisé pour écrasé l'état de lecture seule utilisé initialement pour les fichiers d'affichage d'éditeurs qui sont en lecture seules sur le disque.

source: Save the current text file to disk
de: Aktuelle Textdatei auf der Festplatte speichern
fr: Enregistrer le fichier de texte courant sur un disque

source: Close the current text file
de: Aktuelle Textdatei schließen
fr: Fermer le fichier de texte courant

source: The file to insert
de: Die einzufügende Datei
fr: Le fichier à insérer

source: Insert file
de: Datei einfügen
fr: Insérer un fichier

source: Insert a file at current cursor position, prompting user for file selection
de: Eine Datei an der aktuellen Cursor-Position einfügen, fordert Nutzer zur Dateiauswahl auf
fr: Insérer un fichier à la position actuelle du curseur, demande à l'utilisateur pour la sélection du fichier

source: The line number
de: Die Zeilennummer
fr: Le numéro de ligne

source: Go To Line
de: Gehe zu Zeile
fr: Aller à la ligne

source: Position cursor at start of given line number
de: Cursor am Anfang der gegebenen Zeilennummer positionieren
fr: Positionner le curseur au début d'une ligne donnée

source: Scroll to and select the given line number
fr: Défiler et sélectionner le numéro de ligne donné

source: The percent in file
de: Prozent in der Datei
fr: Le pourcentage dans le fichier

source: The column to move to
de: Die Spalte zu der gegangen werden soll
fr: La colonne où se déplacer

source: Goto column
de: Gehe zur Spalte
fr: Aller à la colonne

source: Move cursor to given column
de: Cursor zur angegebenen Spalte bewegen
fr: Déplace le curseur vers la colonne donnée

source: Start definition of a keyboard macro. If register=None then the user is prompted to enter a letter a-z under which to file the macro. Otherwise, register 'a' is used by default.
de: Definition eines Tastatur-Makros beginnen. Wenn register=None, dann wird der Benutzer aufgefordert, einen Buchstaben (a-z) einzugeben, unter dem das Makro gespeichert werden soll. Ansonsten wird standardmäßig Register 'a' verwendet.
fr: Commence la définition d'une macro clavier. Si register=None alors l'utilisateur est interrogé pour entrer une lettre de a à z sous laquelle faire un fichier pour la macro. Autrement, register 'a' est utilisée par défaut.

source: Stop definition of a keyboard macro
de: Definition eines Tastatur-Makros stoppen
fr: Arrête la définition d'une macro clavier

source: Indent the selected region one level of indentation. Set sel to None to use preference to determine selection behavior, or "never-select" to unselect after indent, "always-select" to always select after indent, or "retain-select" to retain current selection after indent.
de: Den ausgewählten Bereich um ein Einrückungslevel einrücken. "sel" (Auswahl) auf Keine setzen, um beim Bestimmen des Auswahlverhaltens seine Präferenzen zu verwenden. Auf "never-select" (niemals auswählen) setzen, um nach dem Einrücken die Auswahl aufzuheben, auf "always-select" (immer auswählen) setzen, um nach dem Einrücken immer auszuwählen oder auf "retain-select" (Auswahl beibehalten) setzen, um die aktuelle Auswahl nach dem Einrücken beizubehalten.
fr: Indente la région sélectionnée d'un niveau d'indentation. Affecter sel à None pour utiliser la préférence qui détermine le comportement de la sélection, ou "never-select" pour désélectionner après une indentation, "always-select" pour toujours sélectionner après l'indentation, où "retain-select" pour retenir la sélection actuelle après l'indentation.

source: Outdent the selected region one level of indentation. Set sel to None to use preference to determine selection behavior, or "never-select" to unselect after indent, "always-select" to always select after indent, or "retain-select" to retain current selection after indent.
de: Den ausgewählten Bereich um ein Einrückungslevel ausrücken. "sel" (Auswahl) auf Keine setzen, um beim Bestimmen des Auswahlverhaltens seine Präferenzen zu verwenden. Auf "never-select" (niemals auswählen) setzen, um nach dem Ausrücken die Auswahl aufzuheben, auf "always-select" (immer auswählen) setzen, um nach dem Ausrücken immer auszuwählen oder auf "retain-select" (Auswahl beibehalten) setzen, um die aktuelle Auswahl nach dem Ausrücken beizubehalten.
fr: Désindente la région sélectionnée d'un niveau d'indentation. Affecter sel à None pour utiliser la préférence qui détermine le comportement de la sélection, ou "never-select" pour désélectionner après une indentation, "always-select" pour toujours sélectionner après l'indentation, où "retain-select" pour retenir la sélection actuelle après l'indentation.

source: Indent lines spanned by next cursor move
de: Zeilen, die von der nächsten Cursor-Bewegung eingeschlossen werden, einrücken
fr: Indenter les lignes qui s'étendent jusq'au prochain mouvement de curseur

source: Outdent lines spanned by next cursor move
de: Zeilen, die von der nächsten Cursor-Bewegung eingeschlossen werden, ausrücken
fr: Désindenter les lignes qui s'étendent jusq'au prochain mouvement de curseur

source: Indent lines spanned by next cursor move to match, based on the preceding line
de: Zeilen, die von der nächsten Cursor-Bewegung eingeschlossen werden, einrücken, so dass sie an die bestehende Einrückung, basierend auf der vorhergehenden Zeile, angepasst werden
fr: Indenter les lignes qui s'étendent jusq'au prochain mouvement de curseur qui correspondent, basé sur la ligne précédente

source: Remove commenting from the selected lines, if any. This command is not available if the lines are not commented out.
fr: Enlever les commentaires des lignes sélectionnées, si existants. Cette commande n'est pas disponible si les lignes ne sont pas commentées.

source: Run or debug the contents of the editor within the Python Shell
de: Die Inhalte des Editors in der Python-Shell ausführen oder debuggen
fr: Exécute ou débogue les contenus de l'éditeur dans le Shell Python

source: Run the contents of the editor within the IPython Shell
fr: Exécuter les contenus de l'éditeur dans le Shell IPython
