Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_diff.po
Languages: de, ru

source: Diff/Merge
de: Vergleichen/Zusammenführen
ru: Сравнение/Слияние

source: Difference and Merge
de: Vergleichen und Zusammenführen
ru: Разница и слияние

source: Displaying diff number %i
de: Zeige Differenz %i
ru: Отображение номера различия %i

source: Diff/merge panel state
de: Vergleichen/Zusammenführen Panel Status
ru: Состояние панели Различие/Сранение

source: %s Lines
de: %s Zeilen
ru: %s Строки

source: Changed
de: Geändert
ru: Изменено

source: Compare Failed
de: Vergleichen fehlgeschlagen
ru: Ошибка сравнения

source: Compare to repository failed: You must save changes or revert to disk before comparing to the repository.
de: Vergleich mit dem Projektarchiv fehlgeschlagen: Sie müssen vor dem Vergleich mit dem Projektarchiv Ihre Änderungen speichern oder zur gespeicherten Version zurückkehren.
ru: Ошибка сравнения с репозиторием:Перед сравнением с репозиторием необходимо сохранить изменения или загрузить с диска.

source: No Differences Found
de: Keine Unterschiede gefunden
ru: Различий Не Найдено

source: One or more diff/merge sessions are now empty because white space differences are being ignored.
de: Eine oder mehrere Vergleichen/Zusammenführen-Sitzungen sind jetzt leer, da Unterschiede in Leerzeichen ignoriert werden.
ru: Один или несколько сеансов Срванение/Слияние теперь пусты, так как различия пробелов игнорируются.

source: Failed to set up the diff session
de: Einrichten der Vergleichen-Sitzung ist fehlgeschlagen
ru: Не удалось настроить сеанс поиска различий

source: Diff Failed::Diff failed: %s
de: Diff
ru: Ошибка сравнения::Сравнить не удалось: %s

source: Compare to Repositor_y
de: Mit _Projektarchiv vergleichen
ru: Сравнить с Репозиторием

source: Compare to Directory...
de: Mit Verzeichnis vergleichen...
ru: Сравнение каталогов...

source: Compare to File...
de: Mit Datei vergleichen...
ru: Сравнение файлов...

source: There are no differences
de: Keine Unterschiede gefunden
ru: Нет никаких различий

source: Session Contains Only White Space Changes
de: Sitzung enthält nur Änderungen bei Leerzeichen
ru: Сессия содержит только изменения в пробелах

source: This diff/merge session contains only white space changes but white space is being ignored.
de: Diese Vergleichen/Zusammenführen-Sitzung enthält nur Änderungen bei Leerzeichen, da aber ignoriert werden.
ru: Этот сеанс Различия/Слияние содержит только изменения пробелов, но пробелы игнорируются.

source: Don't show this message again
de: Diese Nachricht nicht wieder anzeigen
ru: Не показывать это сообщение снова

source: Create Directories?
de: Verzeichnisse erstellen?
ru: Создать каталоги?

source: The enclosing directories for this file do not exist but must be created before performing this merge. Should Wing create the following directories or cancel the merge operation?
de: Die übergeordneten Verzeichnisse dieser Datei sind nicht vorhanden und müssen vor dem Zusammenführen erstellt werden. Soll Wing die folgenden Verzeichnisse erstellen oder soll die Zusammenführen-Operation abgebrochen werden?
ru: Вложенные каталоги для этого файла не существуют, но должны быть созданы перед выполнением этого слияния. Следует ли Wing создать следующие каталоги или отменить операцию слияния?

source: Line %s: Changed %s Lines%s
de: Zeile %s: Geändert %s Zeilen%s
ru: Строка %s: Изменения %s Строки%s

source: Terminate Diff/Merge Session
de: Vergleichen/Zusammenführen-Sitzung abbrechen
ru: Завершить Сеанс Сравнения / Слияния

source: Lock Scrolling
de: Scrollen sperren
ru: Блокировка прокрутки

source: Ignore Whitespace
de: Leerzeichen ignorieren
ru: Игнорировать пробелы

source: Could not open one or both editors
de: Einer oder beide Editoren konnten nicht geöffnet werden
ru: Не удалось открыть один или оба редактора

source: Revision
ru: Ревизия

source: %s does not exist
de: %s ist nicht vorhanden
ru: %s не существует

source: %s is not a directory
de: %s ist kein Verzeichnis
ru: %s не является каталогом

source: %s is not a file
de: %s ist keine Datei
ru: %s не является файлом

source: Changes
de: Änderungen
ru: Изменения

source: Filename
de: Dateiname
ru: Имя файла

source: Could not find version control system for %s
de: Versionsverwaltungssystem für %s konnte nicht gefunden werden
ru: Не удалось найти систему управления версиями для %s

source: Version control system determination still pending for %s
de: Ermittlung des Versionsverwaltungssystems für %s steht noch aus
ru: Определение системы управления версиями еще не выполнено для %s

source: Could not obtain revision information from %s
de: Revisions-Informationen für %s konnten nicht bezogen werden
ru: Не удалось получить сведения о ревизии из %s

source: No Differences::There are no differences in directory %s
de: Keine Unterschiede::Es gibt keine Unterschiede in Verzeichnis %
ru: Нет различий::Нет различий в каталоге %s

source: Remote Inspect Failed::Could not inspect remote files to compute differences
ru: Удаленная проверка не удалось:: Не удалось проверить удаленные файлы для определения различий

source: Disk File: %s
de: Festplatten-Datei: %s
ru: Файл на диске: %s

source: Version control system determination still in progress for %s
de: Ermittlung des Versionsverwaltungssystems für %s ist noch in Arbeit
ru: Определение системы управления версиями для %s продолжается

source: Fetching revision...
de: Hole Revision...
ru: Извлечение изменений ...

source: Failed to inspect %s
de: Untersuchen von %s fehlgeschlagen
ru: Не удалось проверить % s

source: Encoding Error::The encoding of the differences received from the version control system does not seem to match the file's encoding (%s). Unidentifiable characters have been replaced with '?'
ru: Ошибка кодировки::Кодировка различий, полученных от системы управления версиями, не соответствует кодировке файла (%s). Неидентифицируемые символы были заменены на '?'

source: No differences::There are no differences in %s
de: Keine Unterschiede::Es gibt keine Unterschiede in %
ru: Нет различий::Нет никаких различий в %s

source: %s rev %s -- %s
ru: %s изм %s -- %s

source: Side by Side
de: Seite an Seite
ru: Бок о Бок

source: Top and Bottom
de: Oben und unten
ru: Сверху и Снизу

source: Orientation of difference/merge views: Side-by-side or top/bottom
de: Ausrichtung der Vergleichen/Zusammenführen-Ansichten: Seite-an-Seite oder Oben/Unten
ru: Ориентация видов Различие/Слияние: Бок-о-Бок или верх/низ

source: Controls whether scrolling of the diff/merge editors is locked to synchronize the editor scroll positions.
de: Steuert ob das Scrollen der Vergleichen/Zusammenführen-Editoren untereinander synchronisiert wird.
ru: Управляет блокировкой скроллинга редакторов Различие/Слияние для синхронизации позиций скроллов редактора.

source: Controls whether differences will ignore changes that alter white space only.
de: Steuert ob Vergleiche Änderungen ignorieren, die nur Leerzeichen betreffen.
ru: Управляет тем, будут ли различия игнорировать изменения, которые изменяют только пробелы.

source: Controls whether to warn when changing white space filtering causes sessions to become empty of changes.
ru: Управляет предупреждением о том, что при изменении фильтрации пробелов сеансы освобождаются от изменений.

source: Wrapped to diff number %i
de: Umgebrochen zur Differenz %i

source: Line %s: Deleted %s Lines%s
de: Zeile %s: Gelöscht %s Zeilen%s

source: Line %s: Inserted %s Lines%s
de: Zeile %s: Eingefügt %s Zeilen%s
