Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_debug_client.po
Languages: ru

source: Enable multi-process debugging. When disabled, Wing will only accept one debug connection at a time.
ru: Включить многопроцессорную отладку. При отключении Wing будет принимать только одно отладочное соединение одновременно.

source: Maximum number of debug processes that can connect to Wing at once. After the limit is reached, Wing accepts no additional connections until some processes detach or exit.
ru: Максимальное количество отладочных процессов, которые могут сразу подключаться к Wing. После достижения предела Wing не принимает никаких дополнительных соединений, пока некоторые процессы не отсоединятся или не выходят.

source: Enable debugging sub-processes. When disabled, Wing will only debug the initially launched parent process.
ru: Включить подпроцессы отладки. Когда отключено, Wing только отлаживает начальный родительский процесс.

source: Enable replacement of sys.executable so that processes launched using that value will be debugged. This must be enabled on Windows in order to debug child processes created with the multiprocessing module.
ru: Включите замену sys.executable, чтобы процессы, запущенные с использованием этого значения, были отлажены. Это необходимо включить в Windows, чтобы отлаживать дочерние процессы, созданные с помощью модуля многопроцессорности.

source: Switch Only if No Active Debug Process
ru: Переключение только в случае отсутствия активного процесса отладки

source: Switch to Most Recently Launched Process Group
ru: Переключиться на самую недавно запущенную группу процессов

source: Always Switch
ru: Всегда переключаться

source: Enable debugging more than one unit test at once. When enabled, the Debug/Abort button in the Testing tool alters according to which test is selected.
ru: Включить отладку сразу нескольких тестов. При включении кнопки Отладка/Прерывание в средстве тестирования изменяется в соответствии с выбранным тестом.

source: Enable debugging more than one instance of a named entry point. When disabled, any existing debug process for a named entry point will be terminated when it is debugged.
ru: Включить отладку более одного экземпляра именованной точки входа. При отключении любой существующий отладочный процесс для именованной точки входа будет прекращен, когда он будет отлажен.

source: Whether to prompt when restarting the Python Shell as a result of restarting debugging.
ru: Выводить приглашение при перезапуске оболочки Python в результате перезапуска отладки.

source: Whether to show a dialog when a breakpoint is set on a different line than the selected on.
ru: Показывать диалоговое окно при установке точки останова на линии, отличной от выбранной.

source: Controls whether the debugger will close the connection after any data handling timeout. This reduces the potential for hanging on data handling issues, but increases the chances the debug connection will be unnecessarily closed if any inspection of data takes more than the configured timeout to complete.
ru: Определяет, будет ли отладчик закрывать соединение после любого тайм-аута обработки данных. Это уменьшает вероятность зависания при обработке данных, но увеличивает вероятность того, что отладочное соединение будет необоснованно закрыто, если проверка данных займет больше заданного времени ожидания.

source: Server not responding
ru: Сервер не отвечает

source: The debug server has stopped responding: Network connection has been closed
ru: Сервер отладки перестал отвечать: Сетевое подключение закрыто

source: Could not find a file to debug
ru: Не удалось найти файл для отладки

source: Nothing to debug
ru: Нечего отлаживать

source: Could not debug unsaved file
ru: Не удалось отладить несохраненный файл

source: File does not exist: %s
ru: Файл не существует: %s

source: Debugger launch cancelled
ru: Запуск отладчика отменен

source: Failed to open remote file
ru: Не удалось открыть удаленный файл

source: Build Command Not Found
ru: Команда Сборки Не Найдена

source: The build command set in file or project properties could not be found because it was removed from the OS Commands tool. Please edit your file or project properties to correct this error. Starting debug without build.
ru: Не удалось найти команду Build, заданную в свойствах файла или проекта, поскольку она была удалена из инструмента команды ОС. Измените свойства файла или проекта, чтобы исправить эту ошибку. Запуск отладки без сборки.

source: Build Command Failed
ru: Ошибка Команды Сборки

source: The build command failed. Start debugging anyway?
ru: Не удалось выполнить команду сборки. Начать отладку в любом случае?

source: _Don't ask me again
ru: Не спрашивать снова

source: _Yes
ru: Да

source: _No
ru: Нет

source: Could not start debug process
ru: Не удалось запустить процесс отладки

source: Could not debug %s because it does not exist.
ru: Не удалось выполнить отладку %s потому что его не существует.

source: Could not start TCP/IP listen
ru: Не удается запустить протокол TCP/IP для прослушивания

source: Could not debug "%s" -- the file does not exist
ru: Не удалось отладить "%s" -- файл не существует

source: Could not debug directory "%s"
ru: Не удалось отладить каталог "%s"

source: Cannot debug main file located within a zip or egg "%s"
ru: Не удается выполнить отладку основного файла, расположенного в ZIP или Egg "%s"

source: Unexpected local launch of remote file: %s
ru: Неожиданный локальный запуск удаленного файла: %s

source: Configured run directory does not exist: %s
ru: Заданный каталог выполнения не существует: %s

source: Could not launch debugger for "%s". The python interpreter "%s" may not exist.
ru: Не удалось запустить отладчик для "%s". Интерпретатор python "%s " может не существовать.

source: Could not launch debugger for "%s".
ru: Не удалось запустить отладчик для "%s".

source: Debug Failed - Could not establish SSH tunnel
ru: Ошибка отладки - не удалось установить туннель SSH

source: Output seen:
ru: Обнаруженный результат:

source: No output was seen
ru: Вывод не был обнаружен

source: Remote hosts mismatch: Cannot use Python on host %s to run file %s - The file must be on the same host as Python.
ru: Несоответствие удаленных хостов: Невозможно использовать Python для хоста %s для запуска файла %s. Файл должен находиться на том же хосте, что и Python.

source: Remote launch failed::Failed to start Python '%s' on host %s
ru: Сбой удаленного запуска::Не удалось запустить Python '%s' на хосте %s

source: Remote launch failed::Failed to start Python on host %s
ru: Сбой удаленного запуска:: не удалось запустить Python на узле %s

source: Received output:
ru: Полученный результат:

source: Remote launch failed::Failed to start remote agent on host %s
ru: Сбой удаленного запуска:: не удалось запустить удаленный агент на узле %s

source: You have specified that Wing should display a separate console for this debug process but Wing cannot find any of the configured consoles: %s Try altering the setting the Debug External Consoles preference from Preferences in the Edit menu or use integrated I/O by unchecking the Use External Console preference.
ru: Вы указали, что Wing должен отображать отдельную консоль для этого процесса отладки, но Wing не может найти какие-либо из сконфигурированных консолей: %s Попробуйте изменить настройку параметра «Отладка внешних консолей» в разделе «Настройки» в меню «Правка» или использовать встроенный ввод-вывод, сняв флажок «Использовать внешнюю консоль».

source: Step Over
ru: Шаг Через

source: Step Over Line
ru: Шаг Через Строку

source: Step Into
ru: Шаг В

source: Step Out
ru: Шаг Из

source: Step Out To Frame
ru: Шаг Через Фрейм

source: Continue
ru: Прдолжить

source: Debug to Cursor
ru: Отладка до Курсора

source: Cannot Run To Location
ru: Не удается выполнить поиск

source: Wing cannot run to this location because the file is not available on the remote host.
ru: Wing не может работать в этом месте, так как файл недоступен на удаленном узле.

source: Process %i raised an exception
ru: Процесс %i вызвал исключение

source: Process %i reached a breakpoint or paused
ru: Процесс %i достиг точки останова или приостановлен

source: [%ld of %ld files changed since module load]
ru: [%ld из %ld после загрузки модуля ]

source: [%ld modules loaded]
ru: [%ld загруженные модули]

source: You may need to configure anti-virus or security software to allow Wing to listen on TCP/IP ports.
ru: Возможно, потребуется настроить антивирус или программное обеспечение безопасности, чтобы позволить Wing прослушивать порты TCP/IP.

source: Debug Listen Failed
ru: Отладка отсутствует

source: Debugger could not listen for connections: Another copy of the IDE or other software may be running on the same network port (TCP/IP port %s). This can be configured with the Debugger > Listening > Server Port preference or in Project Properties > Debug/Execute > Server Port.
ru: Отладчик не может прослушивать подключения: Другая копия IDE или другого программного обеспечения может выполняться на том же сетевом порту (порт TCP/IP %s). Это может быть настроено с помощью Оладчик > Прослушивание> Порт Сервера предпочтения или в свойства проекта > Отладка/Выполнить > Порт Сервера.

source: Listening on a random port also failed so debugging sub-processes will not work.
ru: Не удалось прослушивать случайный порт, поэтому отладка подпроцессов не будет работать.

source: Debugger could not listen for TCP/IP connections for debugging sub-processes.
ru: Отладчик не может прослушивать соединения TCP / IP для отладки подпроцессов.

source: Debug process exited
ru: Процесс отладки завершен

source: Debug process running
ru: Запуск процесса отладки

source: Debug process paused
ru: Процесс отладки приостановлен

source: Program exception
ru: Исключение программы

source: Connected to debug process
ru: Подключенние к процессу отладки

source: Unknown or invalid debug mode
ru: Неизвестный или недопустимый режим отладки

source: terminated
ru: завершенный

source: no process
ru: нет процесса

source: running
ru: работа

source: paused
ru: остановка

source: listening
ru: прослушивание

source: exception
ru: исключение

source: connected
ru: соединение

source: unknown mode
ru: неизвестный режим

source: (changed on disk only)
ru: (изменено только на диске)

source: (unsaved changes)
ru: (несохраненные изменения)

source: (open and changed on disk)
ru: (открыть и изменить на диске)

source: The following files are unsaved or do not match the code running in the debug process because they have changed in the IDE and/or on disk since they were last loaded. This may lead to incorrect source display for those files or failure to stop on breakpoints. If your debug program is not designed to reload altered modules, you may wish to restart your debug process now.
ru: Следующие файлы не сохранены или не соответствуют коду, выполняемому в процессе отладки, поскольку они изменились в среде IDE и/или на диске с момента последней загрузки. Это может привести к неправильному отображению исходных файлов или сбою остановки на точках останова. Если программа отладки не предназначена для перезагрузки измененных модулей, может потребоваться перезапустить процесс отладки.

source: Files Modified
ru: Модифицированные файлы

source: _Step Over
ru: Шаг Через

source: _Step Over Line
ru: Шаг через строку

source: _Step Out To Frame
ru: Шаг из фрейма

source: _Step Into
ru: Шаг в

source: _Step Out
ru: Шаг из

source: _Debug to Cursor
ru: Отладка до курсора

source: Debug to Clicked
ru: Отладка до Клика

source: _Debug to Clicked
ru: Отладка до Клика

source: Save & _Restart
ru: Сохранить & Перезапустить

source: Save & Sto_p Debugging
ru: Сохранить & остановить отладку

source: Sa_ve &
ru: Сохранить &

source: Without Saving
ru: Без сохранения

source: Sto_p Debugging
ru: Остановить отладку

source: Always _ignore module changes
ru: Всегда игнорировать изменения модуля

source: _Auto-save before debugging
ru: Автоматическое сохранение перед отладкой

source: Failed to Start
ru: Не удалось запустить

source: Failed to start the debug the program: Could not listen on TCP/IP port %s.
ru: Не удалось запустить отладку программы: Не удалось прослушивать порт TCP/IP %s.

source: Failed to start the debug the program: Could not listen on TCP/IP host %s, port %s.
ru: Не удалось запустить отладку программы: не удалось прослушать TCP / IP хост %s, порт %s.

source: The debug process never connected back to Wing: Aborting debug session. See Trouble-shooting Failure to Debug in the product manual.
ru: Процесс отладки никогда не подключался обратно к Wing: прерывание сеанса отладки. См. Раздел устранение неполадок для отладки в руководстве по продукту.

source: Connection Failed
ru: Ошибка подключения

source: Protocol Mismatch
ru: Несоответствие протокола

source: The debug server protocol version (%i) does not match IDE protocol version (%i). Please make sure your wingdbstub.py file and debug server installation match the version of Wing that you are running. If you are running multiple instances of Wing, you may need to set kWingHostPort in wingdbstub.py and set the Debugger > Listening > Server Port preference.
ru: Версия протокола отладочного сервера (%i) не соответствует версии протокола IDE (%i). Пожалуйста, убедитесь, что файл wingdbstub.py и установка сервера отладки соответствуют версии Wing, которую вы используете. Если вы используете несколько экземпляров Wing, вам может потребоваться установить kWingHostPort в wingdbstub.py и установите параметр Отладчик > Прослушивание > Порт Сервера.

source: Couldn't initialize debug process
ru: Не удалось инициализировать процесс отладки

source: Couldn't get information from the debug process or initialize it
ru: Не удалось получить информацию из процесса отладки или инициализировать его

source: Open failed: %s is probably a binary file
ru: Ошибка открытия: %s вероятно, это двоичный файл

source: Debug Process Exception
ru: Исключение процесса отладки

source: Your debug process has raised an exception. Use the <literal>Stack Data</literal> and other debugger tools to inspect the program state. <strong>IMPORTANT:</strong> Wing tries to report only unhandled exceptions, but for clarity will also report any exception you step over in the debugger. If you reach an exception that you do not see running outside of the debugger, it may mean that Wing was unable to find the handler. These exceptions can be ignored in the <literal>Exceptions</literal> tool. Other exception handling modes are also available. To get the most out of Wing, it is a good idea to read <literal>Managing Exceptions</literal> in the manual.
ru: Исключение составляет процесс отладки. Используйте <literal>Данные стека</literal> и другие средства отладчика для проверки состояния программы. <strong>ВАЖНО:</strong> Wing пытается сообщать только необработанные исключения, но для наглядности также сообщит о любом исключении, которое вы перешагнули в отладчике. Если вы достигли исключения, которое вы не видите за пределами отладчика, это может означать, что Wing не смог найти обработчик. Эти исключения могут быть проигнорированы в <literal>Исключения</literal> инструмент. Также доступны другие режимы обработки исключений. Чтобы получить максимальную отдачу от Wing, рекомендуется прочитать <literal>Управление исключениями</literal> в руководстве.

source: Don't show this notice again
ru: Больше не показывать это уведомление

source: [omitting some output]
ru: [опуская некоторые Выходные данные]

source: truncated
ru: усеченный

source: Save Session
ru: Сохраненная сессия

source: Choose file to which to save the session:
ru: Выберите файл для сохранения сеанса:

source: Select _All
ru: Выбрать все

source: C_opy
ru: Копия

source: _Paste
ru: Вставить

source: Print...
ru: Печать...

source: Send _NUL (0x00)
ru: Послать NUL (0x00)

source: Shell state for %s
ru: Состояние оболочки для %s

source: Save Selection?
ru: Сохранить Выбор?

source: Would you like to save only the current selection?
ru: Вы хотите сохранить только текущий выбор?

source: Save _Selection
ru: Сохранить выбор

source: Save _All
ru: Сохранить все

source: Stack Data
ru: Стек Данных

source: Debug Process Stack Data
ru: Отладка данных стека процессов

source: _Continue Debugging
ru: Продолжить отладку

source: _Stop Debugging
ru: Остановить отладку

source: _Pause Debug Process
ru: Приостановить процесс отладки

source: _Start Debugging
ru: Начать отладку

source: Attach to Process...
ru: Присоединить к процессу...

source: _Accept Debug Connections
ru: Принимать отладочные подключения

source: No Active Process
ru: Нет активного процесса

source: No debug process is running
ru: Процесс отладки не запущен

source: (terminated)
ru: (завершено)

source: Thread #0
ru: Поток #0

source: Debug process is running
ru: Процесс отладки запущен

source: (first to stop)
ru: (сначала остановиться)

source: (running)
ru: (запуск)

source: Debug process threads
ru: Потоки процесса отладки

source: <no debug process stack>
ru: <нет стека процессов отладки>

source: Thread is running
ru: Поток работает

source: pos %s-%s
ru: поз %s-%s

source: , line
ru: , строка

source: Note: Debug connection closed while polling for server messages
ru: Примечание: Отлаживаемое соединение закрыто во время опроса сообщений сервера

source: Error: The debug connection closed unexpectedly while polling for server messages:
ru: Ошибка: Отлаживаемое соединение неожиданно закрылось при опросе сообщений сервера:

source: <no valid stack frame>
ru: <недопустимый кадр стека>

source: <network timeout during evaluate>
ru: <таймаут сети во время оценки>

source: Error: The debug connection closed unexpectedly while sending message with type %s to server:
ru: Ошибка: подключение к отладке неожиданно закрылось при отправке сообщения с типом %s на сервер:

source: Error: The debug connection closed unexpectedly while waiting for reply type %s after message type %s:
ru: Ошибка: Отлаживаемое соединение было неожиданно закрыто пока ожидался ответ типа %s после сообщения типа %s:

source: Error: The debug connection was closed after failing to unpack reply type %s after message type %s:
ru: Ошибка: Отлаживаемое подключение было закрыто после неудачной попытки распаковать ответ типа %s после сообщения типа %s:

source: Error: The debug connection timed out after %s seconds while waiting for reply type %s after message type %s. You may need to increase the value of debug.network-timeout preference.
ru: Ошибка: время ожидания отладочного соединения истекло через %s секунд при ожидании ответа типа %s после типа сообщения %s. Возможно, вам нужно увеличить значение параметра debug.network-timeout.

source: Stored debug data value errors have been cleared. Values will be refetched as needed for display after stepping or restarting your debug session.
ru: Сохраненные ошибки значений данных отладки были очищены. Значения будут заменены по мере необходимости для отображения после выполнения или перезапуска сеанса отладки.

source: Value Errors Cleared
ru: Значения ошибок очищены

source: Warning: Timeout During Evaluation
ru: Предупреждение: Блокировка по времени в ходе вычисления

source: Warning: Huge Value Encountered
ru: Предупреждение: Слишком большое значение

source: Cannot access data
ru: Нет доступа к данным

source: _Expand More
ru: Развернуть подробности

source: _Collapse More
ru: Свернуть подробности

source: Watch by _Symbolic Path
ru: Отслеживать по символическому пути

source: Watch by Direct _Reference
ru: Отслеживать по прямой ссылке

source: Watch by _Parent Slot
ru: Отслеживать родительский слот

source: Watch by _Module Slot
ru: Отслеживать слот модуля

source: _Force Reload
ru: Принудительная Перезагрузка

source: %s(): %s, line %i
ru: %s(): %s, строка %i

source: %s(): %s, line %s
ru: %s(): %s, строка %s

source: %s, line %s
ru: %s, строка %s

source: No symbolic path available
ru: Символический путь недоступен

source: <no debug process>
ru: <нет процесса отладки>

source: <error evaluating>
ru: <ошибка вычисления>

source: <error handling value>
ru: <значение обработки ошибок>

source: <timeout>
ru: <таймаут>

source: <undefined>
ru: <неопределенный>

source: Could not obtain symbolic path, err=%s
ru: Не удалось получить символический путь, err=%s
