Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit.po
Languages: de, fr, ru

source: (top)
de: (oben)
fr: (haut)
ru: (верхний)

source: Not all symbols displayed
de: Nicht alle Symbole angezeigt
fr: Tous les symboles ne sont pas affichés
ru: Не все отображаемые символы

source: (bottom)
de: (unten)
fr: (bas)
ru: (нижний)

source: Use Preference Setting
de: Einstellungen verwenden
fr: Utiliser les préférences
ru: Использовать Настройки Предпочтений

source: Always Show White Space
de: Leerraum immer anzeigen
fr: Toujours afficher les espaces blancs
ru: Всегда Показывать Пробел

source: Whether to show white space on this file: Either refer to the preference, or override the preference to force showing white white space for this file
de: Kontrolliert ob Leerraum für diese Datei angezeigt wird: Zentrale Einstellung benutzen, oder Leerraum immer anzeigen.
fr: Affiche, ou non, les espaces dans ce fichier : se référe aux préférences ou écrase les préférences pour forcer l'affichage des espaces de ce fichier
ru: Следует ли показывать пробел в этом файле: Обратиться к предпочтению, либо переопределить предпочтение, чтобы принудительно показать пробелы для этого файла

source: Always Show EOL Characters
de: Zeilenende immer anzeigen
fr: Toujours afficher les caractères de fin de ligne
ru: Всегда показывать символы EOL

source: Whether to show EOL characters on this file: Either refer to the preference, or override the preference to force showing end of line characters for this file
de: Kontrolliert ob Zeilenenden für diese Datei angezeigt werden. Zentrale Einstellung benutzen, oder Zeilenenden immer anzeigen.
fr: Affichage des caractères de fin-de-ligne dans ce fichier : soit se référer aux préférences, ou écraser les préférences pour forcer l'affichage des caractères de fin de ligne pour ce fichier
ru: Показывать ли символы EOL в этом файле: Обратиться к предпочтению, либо переопределить предпочтение, чтобы принудительно показать символы конца строк для этого файла

source: Always Show Indent Guides
de: Einrückungslinien immer anzeigen
fr: Toujours afficher les guides d'indentation
ru: Всегда Показывать Линии Отступов

source: Whether to show indent guides on this file: Either refer to the preference, or override the preference to force showing indent guides for this file
de: Kontrolliert ob Einrückungslinien für diese Datei angezeigt werden. Zentrale Einstellung benutzen, oder Einrückungslinien immer anzeigen.
fr: Affiche, ou non, les guides d'indentation dans ce fichier : se référe aux préférences ou écrase les préférences pour forcer l'affichage des guides d'indentation de ce fichier
ru: Показывать Линии отступа в этом файле: Обратиться к предпочтению, либо переопределить предпочтение, чтобы принудительно отобразить линии отступа для этого файла

source: Match Existing Indents
de: Einrückung anpassen
fr: Affiche les indentations correspondantes
ru: Сопоставить Существующие Отступы

source: Use Spaces Only
de: Nur Leerzeichen
fr: Utilise seulement les espaces
ru: Используйте Только Пробелы

source: Use Tabs Only
de: Nur Tabs
fr: Utilise seulement les tabulations
ru: Использовать Только Табуляцию

source: Use Mixed Tabs and Spaces
de: Gemischte Tabs und Leerzeichen
fr: Utiliser les tabulations et les espaces mixés
ru: Использовать смесь табуляции и пробелов

source: Defines the indent style to use on new indents in this file. When set, this ignores the type of any existing indentation. This property is disabled for Python files. Use the indentation tool to convert or repair inconsistent indents.
de: Einrückungsstil für neue Einrückung in dieses Datei. Wenn gesetzt, existierende Einrückung werden ignoriert. Diese Eigenschaft darf nicht bei Python Dateis geändert werden. Benutzen Sie statt dessen den Einrückungsmanager um Einrückung zu ändern oder reparieren.
fr: Définit le style d'indentation à utiliser dans ce fichier. Une fois fixé, ignore le type de toute indentation existante. Cette propriété est désactivée pour les fichiers Python. Utiliser l'outil Indentation pour convertir ou réparer les indentations incohérentes.
ru: Определение стиля отступа для использования с новыми отступами в этом файле. При определении эта установка игнорирует Тип любого существующего отступа. Это свойство отключено для файлов Python. Используйте инструмент отступ для преобразования или исправления несогласованных отступов.

source: Defines named bookmarks set within the current project.
de: Definiert benannte Lesezeichen, die innerhalb des aktuellen Projekts gesetzt werden.
fr: Définit un jeu de signets nommés dans le projet courant.
ru: Определяет именованные закладки, заданные в текущем проекте.

source: Needs Documentation
de: Benötigt Dokumentation
fr: Besoin de la documentation

source: Needs Implementation
de: Benötigt Implementierung
fr: Besoin d’une implémentation

source: Needs Unit Test
de: Benötigt Unit Test
fr: Besoin d’un test unitaire

source: Other
de: Andere
fr: Autre

source: Always Ensure File Ends With an EOL
de: Immer Sicherstellen das alle Dateien mit einem EOL enden
fr: Toujours s'assurer que le fichier finit avec une fin-de-ligne
ru: Всегда удостовериться, что файл заканчивается EOL

source: Never Ensure File Ends With an EOL
de: Niemals Sicherstellen das alle Dateien mit einem EOL enden
fr: Ne jamais s'assurer que le fichier finit avec une fin-de-ligne
ru: Никогда не проверять, что файл заканчивается EOL

source: Records last size used for the multi-selections popup.
fr: Enregistre la dernière taille utilisée pour le popup multi-sélections.
ru: Записывает последний размер, используемый для всплывающего окна с несколькими выборами.

source: The defined commands in the OS Commands toolbox
fr: Les commandes définies dans la boîte à outils des commandes de l’OS
ru: Определение команд в панели инструментов Команды ОС

source: Options to use when adding selections
de: Optionen die beim Hinzufügen von Auswahl benutzt werden
fr: Options à utiliser lors de l'ajout de sélections
ru: Параметры, используемые при добавлении выборок

source: (symbol)
fr: (symbole)
ru: (символ)

source: (snippet)
de: (Schnipsel)
fr: (bout de code)
ru: (фрагмент)

source: _Sort Alphabetically
de: Alphabetisch _sortieren
fr: _Trier alphabétiquement
ru: Сортировать по алфавиту

source: Sort items alphabetically rather than in the order found in the file
de: Einträge alphabetisch sortieren statt des Reihenfolge in der Datei
fr: Trier les éléments alphabétiquement plutôt que dans l'ordre trouvé dans le fichier
ru: Сортировка элементов в алфавитном порядке, а не в порядке, указанном в файле

source: Include _Args in Search
de: _Argumente in Suche einschließen
fr: Inclure les _arguments dans la recherche
ru: Включать аргументы в поиск

source: Include the text of function arguments in the text on which to search
fr: Inclure le texte des arguments de la fonction dans le texte dans lequel chercher
ru: Включить текст аргументов функции в текст для поиска

source: Entering Invocation: Tab key moves between arguments
fr: Entré une Invocation : la touche de tabulations bouge entre les arguments
ru: Ввод вызова: клавиша Tab перемещается между аргументами

source: Remove %i Bookmarks?
de: %i Lesezeichen entfernen?
fr: Enlever %i signet(s) ?

source: Are you sure you want to remove these %i bookmarks? This operation cannot be undone.
de: Wollen Sie wirklich %i Lesezeichen entfernen? Dies kann nicht rückgängig gemacht werden.
fr: Êtes-vous sûr de vouloir enlever ces %i signets ? Cette opération ne peut pas être annulée.

source: Remove %i Bookmarks
de: %i Lesezeichen entfernen
fr: Enlever %i signets

source: Remove Bookmark?
de: Lesezeichen entfernen?
fr: Enlever ce signet ?

source: Are you sure you want to remove this bookmark? This operation cannot be undone.
de: Wollen Sie wirklich dieses Lesezeichen entfernen? Dies kann nicht rückgängig gemacht werden.
fr: Êtes-vous sûr de vouloir enlever ce signet ? Cette opération ne peut pas être annulée.

source: _Cancel
de: _Abbrechen
fr: _Annuler
ru: Отмена

source: Filter:
fr: Filtre :

source: All Categories
de: Alle Kategorien
fr: Toutes les catégories

source: Edit Categories...
de: Kategorien bearbeiten...
fr: Éditer les catégories…

source: Remove 1 Visible Bookmark in this File
de: 1 sichtbares Lesezeichen in dieser Datei entfernen
fr: Enlever 1 signet visible dans ce fichier

source: Remove %i Visible Bookmarks in this File
de: %i sichtbare Lesezeichen in dieser Datei entfernen
fr: Enlever %i signets visibles dans ce fichier

source: Remove All Bookmarks in this File
de: Alle Lesezeichen in dieser Datei entfernen
fr: Enlever tous les signets visibles dans ce fichier

source: Bookmarks
de: Lesezeichen
fr: Signets
ru: Закладки

source: Bookmark Manager
de: Lesezeichen-Manager
fr: Gestionnaire de signets
ru: Менеджер закладок

source: New
de: Neu
fr: Nouveau

source: Edit
de: Bearbeiten
fr: Éditer
ru: Редактировать

source: Delete
de: Löschen
fr: Supprimer
ru: Удалить

source: Export
fr: Exporter

source: Import
fr: Importer

source: _Show Docs...
de: _Dokumentation anzeigen...
fr: Afficher la documentation…

source: _Close
de: _Schließen
fr: Fermer

source: Title
de: Titel
fr: Titre
ru: Название

source: Shared
de: Geteilt
fr: Partagé

source: Untitled
de: Unbenannt
fr: Sans-titre

source: _New...
de: _Neu...
fr: _Nouveau...
ru: Новый...

source: _Edit...
de: _Bearbeiten...
fr: Éditer…

source: _Delete...
de: _Löschen...
fr: Supprimer…

source: _Export Categories...
fr: Exporter les catégories…

source: _Import Categories...
fr: Importer les catégories…

source: Bookmark: %s
de: Lesezeichen: %s
fr: Signet : %s

source: Bookmark
de: Lesezeichen
fr: Signet

source: Name
fr: Nom
ru: Имя

source: The bookmark's name
de: Name des Lesezeichen
fr: Le nom du signet

source: Category
de: Kategorie
fr: Catégorie

source: Notes for this bookmark
de: Anmerkungen für diese Lesezeichen
fr: Notes pour ce signet

source: Bookmark must have a non-empty name
de: Lesezeichen dürfen keine leeren Namen haben
fr: Un signer doit avoir un nom non-vide

source: Export File:
de: Export-Datei:
fr: Exporter fichier :

source: Import File:
de: Import-Datei:
fr: Importer fichier :

source: Goto Bookmark
de: Gehe zum Lesezeichen
fr: Aller au signet

source: Delete Bookmark
de: Lesezeichen löschen
fr: Supprimer le signet

source: Export Visible Bookmarks
de: Sichtbare Lesezeichen exportieren
fr: Exporter les signets visibles

source: Import Bookmarks
de: Lesezeichen importieren
fr: Importer des signets

source: Scope
de: Bereich
fr: Portée

source: File
de: Datei
fr: Fichier
ru: Файл

source: Line
de: Zeile
fr: Ligne
ru: Строка

source: undefined
de: nicht definiert
fr: indéfini
ru: неопределенный

source: Indent Style Mismatch
de: Ungleichheit der Einrückung
fr: Style d'indentation Incohérent
ru: Несоответствие Стиля Отступов

source: You may convert indentation with the Indentation tool, use indentation that matches the file, or ignore this and continue with your selected indent style.
fr: Vous pouvez convertir les indentions avec l'outil Indentation, utilisez les indentations correspondantes au fichier, ou ignorer ceci et continuez avec votre style d'indentation sélectioné.
ru: Вы можете конвертировать отступы с помощью инструмента «Отступы», использовать отступ, соответствующий файлу, или игнорировать это и продолжить свой выбранный стиль отступа.

source: Warning: The indent style you have chosen does not match the existing content of the file. This will introduce inconsistent indentation into the file. %s
de: Warnung: Der gewählte Einrückungsstil passt nicht zum bestehenden Inhalt der Datei. Dadurch werden inkonsistente Einrückungen in die Datei eingefügt. %s
fr: Attention : le style d'indentation choisi ne correspond pas au contenu du fichier. Cela va introduire une indentation incohérente dans le fichier. %s
ru: Внимание: выбранный стиль отступа не соответствует существующему содержимому файла. Это приведет к несогласованному отступу в файл. %s

source: _Ignore and Use Spaces Only
de: _Ignorieren und Nur-Leerzeichen verwenden
fr: _Ignorer et utiliser seulement des espaces
ru: Игнорировать и использовать только пробелы

source: _Ignore and Use Tabs Only
de: _Ignorieren und Nur-Tab verwenden
fr: _Ignorer et utiliser seulement des tabulations
ru: Игнорировать и использовать только табуляцию

source: Con_vert Indentation
de: Einrückung um_wandeln
fr: Con_vertir l'indentation
ru: Конвертировать отступы

source: _Match File (%s)
de: _Übereinstimmen in Datei (%s)
fr: _Fichier correspondant (%s)
ru: Совпадающие файлы (%s)

source: _Don't show this notice again
de: _Diese Nachricht nicht wieder anzeigen
fr: _Ne plus afficher cet avis à nouveau
ru: Больше не показывать это уведомление

source: Cannot convert because a macro is being recorded
de: Kann nicht umwandeln, da ein Makro aufgezeichnet wird
fr: Impossible de convertir car une macro est en train d'être enregistrée
ru: Не удается преобразовать, поскольку записывается макрос

source: Cannot convert because the editor text is read-only
de: Kann nicht umwandeln, da der Editortext nur lesbar ist
fr: Impossible de convertir car l'éditeur de texte est en lecture seule
ru: Невозможно преобразовать, потому что текст редактора доступен только для чтения

source: This file can be converted. Select the desired indent size above.
de: Diese Datei kann nicht konvertiert werden. Bitte wählen Sie oben die gewünschte Einrückung aus.
fr: Ce fichier peut être converti. Sélectionnez la taille de l'indentation désirée ci-dessus.
ru: Этот файл можно преобразовать. Выберите желаемый размер отступа.

source: Wing will indent using spaces according to the selected indent size and will replace any %s space(s) found in an indent with one tab.
fr: Wing va indenter en utilisant des espaces selon la taille d'indentation sélectionnée et va remplacer tous les %s espaces trouvés dans les indentations par une tabulation.
ru: Wing будет формировать отступы, используя пробелы в соответствии с выбранным размером отступа и заменит любые пробелы %s, найденные в отступе, с одной табуляцией.

source: Tab size of 8 is required in this case because the Python interpreter expects tabs in mixed indentation to be equivalent to eight spaces.
de: Tabgröße von 8 ist in diesem Fall erforderlich, da der Python-Interpreter bei gemischter Einrückung von Leerzeichen und Tabs acht Leerzeichen breite Tabs erwartet.
fr: La taille des tabulations est forcée à 8 caractères dans ce cas, car l'interpréteur Python s'attend à ce qu'une tabulation, dans l'indentation mixte, soit équivalente à huit espaces.
ru: В этом случае требуется Размер табуляции 8, поскольку интерпретатор Python ожидает, что табуляции в смешанном отступе будут эквивалентны восьми пробелам.

source: Cannot convert indents because a macro is being recorded
de: Kann Einrückungen nicht umwandeln, da ein Makro aufgezeichnet wird
fr: Impossible de convertir l'indentation parce qu'une macro est en train d'être enregistrée
ru: Не удается преобразовать отступы, поскольку записывается макрос

source: Wing will convert all indentation in the file to use only spaces.
de: Wing wird alle Einrückung in der Datei in Leerzeichen umwandeln.
fr: Wing va convertir toutes les indentations du fichier en n'utilisant que des espaces.
ru: Wing преобразует все отступы в файле для использования только пробелов.

source: Wing can convert this file.
de: Wing kann diese Datei konvertieren.
fr: Wing peut convertir ce fichier.
ru: Wing может преобразовать этот файл.

source: Wing will place one tab per indentation level found in the file.
de: Wing wird in dieser Datei einen Tab pro Einrückungsebene setzen.
fr: Wing placera une tabulation par niveau d'indention trouvé dans le fichier.
ru: Wing будет размещать одну вкладку на уровень отступа, найденный в файле.

source: _Convert...
de: _Umwandeln...
fr: _Convertir...
ru: Конвертировать...

source: Do_n't Convert
de: _Nicht umwandeln
fr: Ne pas co_nvertir
ru: Не конвертировать

source: _Don't ask about this file again
de: Nach dieser _Datei nicht mehr fragen
fr: Ne pas reposer la qu_estion pour ce fichier
ru: Не спрашивайте об этом файле еще раз.

source: Suspicious Indentation in File
de: Verdächtige Einrückung in der Datei
fr: Indentation douteuse dans ce fichier
ru: Подозрительный отступ в файле

source: The file %s contains indentation with %s. It may appear incorrectly in some editors and may contain unexpected errors in block structure. Total indents = %s. The Indentation tool can be used to convert the file to another style of indent.
de: Die Datei %s enthält Einrückungen mit %s. Die Datei wird möglicherweise in anderen Editoren mit falsche Einrückung gezeigt und kann unerwartete Fehler in der Block-Struktur enthalten. Gesamteinrückungen = %s. Mit dem Einrückungswerkzeug kann die Datei in einen anderen Einrückungsstil konvertiert werden.
fr: Le fichier %s contient des indentations avec %s. Cela peut apparaître incorrectement dans certains éditeurs et pourrait contenir des erreurs innatendues dans des structures en blocs. Total des indents = %s. L'outil d'Indentation peut être utilisé pour convertir le fichier à un autre style d'indents.
ru: Файл %s содержит отступ %s. В некоторых редакторах он может отображаться неправильно и может содержать непредвиденные ошибки в структуре блока. Всего отступов = %s. Инструмент Отступа может использоваться для преобразования файла в другой стиль отступа.

source: Ne_ver ask for any file
de: _Niemals für eine Datei fragen
fr: Ne jamais demander pour aucun fichier
ru: Никогда не спрашивать файл

source: Indentation Policy Violation
de: Richtlinie für Einrückungen verletzt
fr: Violation de la politique d'indentation
ru: Нарушение Политики Отступов

source: The file %s contains indentation with %s and you have configured your project to require %s indents. Total indents = %s. If you wish, you can convert this file with the indentation manager.
de: Die Datei %s enthält Einrückungen mit %s und das Einrückungsgrundsatz des Projektes ist. %s. Gesamteinrückungen = %s. Sie können diese Datei reparieren, indem Sie sie mit dem Einrückungsmanager umwandeln.
fr: Le fichier %s contient des indentations avec %s et vous avez configuré votre projet pour avoir des indents %s. Total des indents = %s. Si vous souhaitez, vous pouvez convertir ce fichier avec le gestionnaire d'indentation.
ru: The file %s contains indentation with %s and you have configured your project to require %s indents. Total indents = %s. If you wish, you can convert this file with the indentation manager. Файл %s содержит отступы с %s, и вы настроили свой проект на требуемые отступы %s. Всего отступов = %s. При желании вы можете преобразовать этот файл с помощью менеджера отступов.

source: tabs and spaces
de: Tabs und Leerzeichen
fr: tabulations et espaces
ru: табуляция и пробелы

source: spaces only
de: Nur Leerzeichen
fr: espaces uniquement
ru: только пробелы

source: tabs only
de: Nur Tabs
fr: tabulations uniquement
ru: только табуляция

source: no indents
de: Keine Einrückungen
fr: pas d'indentation
ru: без отступов

source: (with indent errors)
de: (mit Fehlern bei der Einrückung)
fr: (avec des erreurs d'indentation)
ru: (с ошибками отступов)

source: (with indent warnings)
de: (mit Warnungen bei der Einrückung)
fr: (avec des avertissements d'indentation)
ru: (с предупреждениями отступа)

source: Source Code Indent Analysis and Conversion
de: Einrückungsanalyse und -umwandlung des Source-Codes
fr: Analyse et conversion de l'indentation du code source
ru: Анализ и преобразование Отступов исходного кода

source: _Convert
de: _Umwandeln
fr: _Convertir
ru: Конвертировать

source: None.
de: Keine.
fr: Aucun.

source: Availability:
de: Verfügbarkeit:
fr: Disponibilité :
ru: Доступно:

source: Convert
de: Umwandeln
fr: Convertir
ru: Конвертировать

source: File:
de: Datei:
fr: Fichier :
ru: Файл:

source: Status:
fr: Statuts :
ru: Статус:

source: Counts:
de: Anzahl:
fr: Compteurs :
ru: Рассчет:

source: (from existing contents)
de: (aus bestehenden Inhalten)
fr: (depuis les contenus existants)
ru: (из существующего содержимого)

source: T_ab size:
de: T_abgröße:
fr: Taille d'une _tabulation :
ru: Размер вкладки:

source: _Indent size:
de: _Einrückungsgröße:
fr: Taille de l'_indentation :
ru: Размер отступа:

source: _Spaces Only
de: Nur _Leerzeichen
fr: _Espaces uniquement
ru: Только Пробелы

source: _Tabs Only
de: Nur _Tabs
fr: _Tabulations uniquement
ru: Только Табуляция

source: _Mixed Tabs & Spaces
de: _Gemischte Tabs & Leerzeichen
fr: Tabulations & espaces _mixés
ru: Смешанные Табуляция И Пробелы

source: (user-entered value)
de: (vom Nutzer eingegebener Wert)
fr: (valeur entrée par l'utilisateur)
ru: (введенное пользователем значение)

source: (from file contents)
de: (aus Dateiinhalten)
fr: (depuis le contenu du fichier)
ru: (из содержимого файла)

source: (from preferences)
de: (aus den Einstellungen)
fr: (depuis les préférences)
ru: (из предпочтений)

source: <i>No active source editor</i>
de: <i>Kein aktiver Source-Editor</i>
fr: <i>Pas d'éditeur de source actif</i>
ru: <i>Нет активного редактора исходного кода</i>

source: Open Files
de: Offene Dateien
fr: Fichiers ouverts
ru: Открыть файлы

source: Open files state
fr: État des fichiers ouvert
ru: Состояние открытых файлов

source: Goto File
de: Gehe zu Datei
fr: Aller au fichier
ru: Перейти к файлу

source: Save
de: Speichern
fr: Enregistrer
ru: Сохранить

source: Close Selected
de: Ausgewählte schließen
fr: Fermer la sélection
ru: Закрыть выбранное

source: Close Others
de: Andere schließen
fr: Fermer les autres onglets
ru: Закрыть Другие

source: Select All
de: Alles auswählen
fr: Tout sélectionner
ru: Выбрать все

source: Select None
de: Nichts auswählen
fr: Sélectionner None
ru: Выбрать None

source: Name Open File Set...
de: Gruppe geöffneter Dateien benennen...
fr: Nommer l’ensemble de fichiers sélectionné...
ru: Имя Открытого Файла...

source: Name Selected File Set...
de: Gruppe ausgewählter Dateien benennen...
fr: Nommer l'Ensemble de fichiers sélectionné...
ru: Имя Выбранного Набора Файлов...

source: Open File Set
de: Dateigruppe öffnen
fr: Ouvrir un Ensemble de fichiers
ru: Открыть Набор Файлов

source: Manage File Sets...
de: Dateigruppen verwalten...
fr: Gestion des Ensemble de fichiers...
ru: Управление Наборами Файлов...

source: File Properties...
de: Datei-Eige_nschaften...
fr: Propriétés du fichier...
ru: Свойства Файла...

source: Build Command: %s
de: Build-Befehl: %s
fr: Construire la commande : %s
ru: Команда Сборки: %s

source: Use Default
de: Standard verwenden
fr: Utiliser par défaut

source: Enter a title for the command if a non-default title is desired.
fr: Entrer un titre pour la commande si vous ne choisissez pas le titre par défaut.
ru: Введите заголовок для команды, если требуется нестандартный заголовок.

source: Enable this if the executed command or file expects to be run within a tty; it executes the process within a pseudo TTY environment.
fr: Activer ceci si la commande exécutée ou le fichier s'attend à être lancé dans un tty ; cela exécute le processus dans un pseudo environnement TTY.
ru: Включите этот параметр, если выполняется команда или файл рассчитывает быть запущен в среде tty; он позволит выполнить этот процесс в среде псевдо TTY.

source: Line Mode
de: Zeilenmodus
fr: Mode ligne
