Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_pref.po
Languages: fr, ru

source: Display Language
fr: Langue d'affichage
ru: Язык интерфейса

source: Enable Tooltips
fr: Activer les bulles d’aide
ru: Включить подсказки

source: Windowing Policy
fr: Politique de fenêtrage
ru: Правила окон

source: Show Menubar
fr: Afficher la barre de menu

source: Show Editor Tabs
fr: Afficher les onglets de l’éditeur
ru: Показать Вкладки Редактора

source: Presentation Mode
fr: Mode de présentation

source: Show Toolbar
fr: Afficher la barre d'outils
ru: Показать Панель Инструментов

source: Toolbar Size
fr: Taille de la barre d'outils
ru: Размер Панели Инструментов

source: Toolbar Style
fr: Style de la barre d'outils
ru: Стиль Панели Инструментов

source: Groups Shown
fr: Groupes affichés
ru: Отображаемые группы

source: Custom Items
fr: Éléments personnalisés
ru: Пользовательские элементы

source: Primary Icon Color
fr: Couleur d'icône primaire
ru: Основной Цвет Иконки

source: Secondary Icon Color
fr: Couleur d'icône secondaire
ru: Вторичный Цвет Иконки

source: Tertiary Icon Color
fr: Couleur d'icône tertiaire
ru: 3-й Цвет Иконки

source: Quaternary Icon Color
fr: Couleur d'icône quaternaire
ru: 4-й Цвет Иконки

source: Quinary Icon Color
fr: Couleur d'icône quinaire
ru: 5-й Цвет Иконки

source: Senary Icon Color
fr: Couleur d'icône sénaire
ru: 6-й Цвет Иконки

source: Auto-save Perspectives
fr: Auto-enregistrement des perspectives
ru: Автоматическое сохранение перспектив

source: Shared Perspective File
fr: Fichier de perspective partagé
ru: Общий Файл Перспективы

source: Display Font/Size
fr: Police/taille d'affichage
ru: Шрифт/Размер Интерфейса

source: Editor Font/Size
fr: Police/taille de l'éditeur
ru: Шрифт/Размер Редактора

source: Personality
fr: Personnalité
ru: Особенности

source: Tab Key Action
fr: Action de la touche tabulation
ru: Tab Действие Клавиши

source: Alt Key
fr: Touche Alt
ru: Клавиша Alt

source: Use Alt for Accelerators
fr: Utiliser Alt pour les accélérateurs
ru: Использовать Alt для Акселераторов

source: Custom Key Bindings
fr: Raccourcis clavier personnalisés
ru: Настраиваемые привязки клавиш

source: Typing Group Timeout
fr: Délai d'expiration de groupe de frappes
ru: Тайм-Аут Ввода Группы

source: VI Mode Ctrl-C/X/V
fr: Mode VI Ctrl-C/X/V

source: Show Splash Screen
fr: Afficher l'écran de démarrage
ru: Показать экран-заставку

source: When Launching Wing
fr: Lors du lancement de Wing
ru: При старте Wing

source: Quit Application When Last Window Closes
fr: Quitter l’application quand la dernière fenêtre est fermée
ru: Выход из приложения при закрытии последнего окна

source: Auto-Focus Tools
fr: Outils d'auto-focus
ru: Инструменты автофокусировки

source: Case Sensitive Sorting
fr: Tri sensible à la casse
ru: Сортировка с учетом регистра

source: Always Use Full Path in Tooltips
fr: Toujours utiliser le chemin complet dans les bulles d'aide
ru: Всегда использовать полный путь в подсказках

source: Max Error Log Size
fr: Taille maximum des logs d'erreurs
ru: Максимальный размер журнала ошибок

source: Shared File Sets Repository
fr: Dépôt partagé d’Ensemble de fichiers
ru: Репозиторий общих файлов

source: Key Map File
fr: Fichier de raccourcis clavier
ru: Key Map Файл

source: Auto-check for Product Updates
fr: Auto-vérification des mises a jour du produit
ru: Автоматическая проверка обновлений продукта

source: Submit Usage Stats
fr: Envoi de statistiques d’utilisation

source: Show Support+Upgrades Reminders
fr: Afficher des rappels de Support+mises a niveau
ru: Показать напоминания о поддержке + обновлениях

source: Show Discount Offers
fr: Afficher les offres de réductions

source: Auto-Show Bug Report Dialog
fr: Auto-affichage de la boite de dialogue de rapport de bug
ru: Автопоказ диалогового окна отчета об ошибках

source: Auto-Save Files Before Debug or Execute
fr: Enregistrement automatique des fichiers avant débogage ou Exécution
ru: Автоматическое сохранение файлов перед Отладкой или выполнением

source: Default Directory Policy
fr: Politique de répertoire par défaut
ru: Политика каталогов по умолчанию

source: Title Style
fr: Style du titre
ru: Стиль заголовка

source: Show Hostname in Titles
fr: Afficher le nom d’hôte dans les titres
ru: Показывать имя хоста в заголовках

source: Default Encoding
fr: Encodage par défaut
ru: Кодировка по умолчанию

source: New File EOL
fr: Fin de ligne de nouveau fichier
ru: Символ конца строки

source: New File Extension
fr: Extension de nouveau fichier
ru: Расширение файла

source: Max Recent Items
fr: Maximum d'éléments récents
ru: Макс последних элементов

source: Maximum File Size (MB)
fr: Taille maximum de fichier (MB)
ru: Максимальный размер файла (МБ)

source: Extra File Types
fr: Types de fichier supplémentaires
ru: Дополнительные типы файлов

source: File Filters
fr: Filtres de fichier
ru: Фильтры файлов

source: Reload when Unchanged
fr: Recharger lorsque non modifié
ru: Перезагрузить если неизменено

source: Reload when Changed
fr: Recharger lorsque modifié
ru: Перезагрузить при изменении

source: External Check Freq
fr: Fréquence de Rafraîchissement externe
ru: Частота Внешней проверки

source: File Display Commands
fr: Commandes d'affichage du fichier
ru: Файл отображаемые команды

source: Url Display Commands
fr: Commandes d'affichage de l'url
ru: Url отображаемые команды

source: Auto-reopen Last Project
fr: Auto-Réouverture du dernier projet
ru: Автоматически открывать последний проект

source: Close Files with Project
fr: Fermer les fichiers avec le projet
ru: Закрыть файлы из Project

source: Open Projects as Text
fr: Ouvrir les projets comme du texte
ru: Открыть проекты в виде текста

source: Confirm Drag Copy/Move
fr: Confirmer le glisser copier/déplacer
ru: Подтверждать копирование/перемещение

source: Show Line Numbers
fr: Afficher les numéros de lignes
ru: Показать Номера Строк

source: Show Whitespace
fr: Afficher les espaces
ru: Показать Пробелы

source: Show EOL
fr: Afficher les fins de ligne
ru: Показать EOL

source: Split Reuse Policy
fr: Politique de réutilisation des divisions
ru: Политика повторного использования разделения

source: Other Split Type
fr: Autre type de division
ru: Другой Тип Разделения

source: Show All Files in All Splits
fr: Afficher tous les fichiers dans toutes les divisions
ru: Показать все файлы во всех Разделениях

source: Strip Trailing White Space
fr: Enlever les espaces blancs de fin de chaîne
ru: Убрать пробелы в конце строки

source: Block Comment Style
fr: Style des blocs de commentaires
ru: Стиль Блока Комментария

source: Scroll Past End
fr: Défilement au-delà de la fin
ru: Прокрутка в конец

source: Ensure File Ends With EOL When Saving
fr: S'assurer que le fichier finisse avec des fins-de-lignes lors de l'enregistrement
ru: Убедитесь, что файл заканчивается с помощью EOL при сохранении

source: Enable Font Size Zooming
fr: Activer le zoom sur la taille de police
ru: Включить Масштабирование Размера Шрифта

source: On Empty Selection
fr: Sur sélection vide
ru: При Пустом Выборе

source: Middle Mouse Paste
fr: Coller avec le bouton du milieu de la souris
ru: Средняя Вставка Мыши

source: Convert Indent Style On Paste
fr: Convertir le style d’indentation lors d’un collage
ru: Преобразование стиля отступов во вствке

source: Adjust Indent After Paste
fr: Ajuster l'indentation après collage
ru: Настройка Отступа После Вставки

source: Syntax Formatting
fr: Formattage de la syntaxe
ru: Форматирование Синтаксиса

source: Highlight Builtins
fr: Surlignage des prédéfinitions
ru: Подсветка Встроенных команд

source: Enable Code Warnings
fr: Activer les avertissements de code

source: Indicators
fr: Indicateurs

source: Indicator Style
fr: Style d'Indicateur
ru: Стиль индикатора

source: Error Color
fr: Couleur d’erreur

source: Warning Color
fr: Couleur d’avertissement

source: Auto-Editing Enabled
fr: Auto-édition activé
ru: Автоматическое редактирование включено

source: Auto-Close Characters
fr: Caractères auto-fermants
ru: Автоматическое Закрытие Символов

source: Auto-Enter Invocation Args
fr: Auto-entrer les arguments d'invocation
ru: Автоматический ввод аргументов вызова

source: Apply Quotes to Selection
fr: Appliquer des guillemets à la sélection
ru: Применить кавычки к выбору

source: Apply Comment Key to Selection
fr: Appliquer la touche de commentaire à la sélection
ru: Закомментарить выбор

source: Apply (), [], and {} to Selection
fr: Appliquer (), [], et {} à la sélection
ru: Применять (), [], и {} для выбранного

source: Apply Colon to Selection
fr: Appliquer les deux-points à la sélection
ru: Применить двоеточие к выделению

source: Auto-Enter Spaces
fr: Espaces auto-entrés
ru: Автоматический Ввод Пробелов

source: Auto-Space After Keywords
fr: Auto-espace après les mots-clés
ru: Автопробел После Ключевых Слов

source: Enforce PEP 8 Style Spacing
fr: Forcer le style d'espacement PEP 8

source: Manage Blocks on Repeated Colon Key Presses
fr: Gérer les blocs sur pressions répétés de la touche deux-points
ru: Управление блоками при повторном нажатии клавиш двоеточия

source: Continue Comment or String on New Line
fr: Continuer les commentaires ou les chaînes sur une nouvelle ligne
ru: Продолжить комментарий или строку в Новой строке

source: Correct Out-of-Order Typing
fr: Corriger les saisies dans le désordre
ru: Исправление неупорядоченной типизации

source: Selection Color
fr: Couleur de la sélection
ru: Цвет выделения

source: Caret Color
fr: Couleur de curseur
ru: Цвет курсора

source: Caret Width
fr: Largeur de curseur
ru: Ширина курсора

source: Caret Flash Rate (ms)
fr: Fréquence de scintillement du curseur (ms)
ru: Частота мгания курсора (мс)

source: Caret Line Highlight
fr: Surlignage de la ligne du curseur
ru: Подсветка Строки Курсора

source: Display Selections Popup
fr: Affichage des popup de sélections
ru: Отображать всплывающие окна выбора

source: Use Indent Analysis
fr: Utiliser l'analysse d'indentation
ru: Использовать анализ отступов

source: Default Tab Size
fr: Taille d'une tabulation par défaut
ru: Размер вкладки по умолчанию

source: Default Indent Size
fr: Taille de l'indentation par défaut
ru: Размер отступа по умолчанию

source: Default Indent Style
fr: Style d'indentation par défaut
ru: Стиль отступа по умолчанию

source: Auto Indent
fr: Auto-indentation
ru: Автоматический отступ

source: Show Indent Guides
fr: Afficher les guides d'indentation
ru: Показать линии отступа

source: Show Python Indent Warning Dialog
fr: Afficher les avertissements d'indentation Python
ru: Показать диалоговое окно предупреждения отступа Python

source: Show Override Warning Dialog
fr: Afficher les avertissements d'écrasement
ru: Показать диалоговое окно предупреждения переопределения

source: Wrap Long Lines
fr: Retour à la ligne des longues lignes
ru: Перенос длинных строк

source: Edge Markers
fr: Marqueur de limite
ru: Маркеры Края

source: Reformatting Wrap Column
fr: Reformattage de la colonne de passage à la ligne
ru: Переформатирование столбца при переносе

source: Highlight Occurrences
fr: Surlignage des occurrences
ru: Подсветка повторных экземпляров

source: Match Case
fr: Correspondance de la casse
ru: Учитывать регистр

source: Occurrences Indicator Style
fr: Style d'Indicateur d'occurrences
ru: Стиль индикаторов событий

source: Occurrences Color
fr: Couleur des occurrences
ru: Цвет заливки

source: Persistence Time (ms)
fr: Temps de persistence (ms)

source: Bookmark Color
fr: Couleur de signet
ru: Цвет закладки

source: Bookmark Style
fr: Style de signet
ru: Стиль закладки

source: Confirm Deletion
fr: Confirmer la suppression

source: Enable Folding
fr: Activer le repliement
ru: Включить сворачивание

source: Line Mode
fr: Mode de la ligne
ru: Режим линии

source: Fold Trailing White Space
fr: Replier les espaces blancs de fin de chaîne
ru: Сложить пробелы из конца строки

source: Foreground Color
fr: Couleur de premier plan
ru: Цвет переднего плана

source: Background Color
fr: Couleur d'arrière-plan
ru: Цвет фона

source: Auto-show Completer
fr: Auto-affichage du compléteur
ru: Показывать вырианты автозаполнения

source: Python Turbo Mode
fr: Mode turbo Python

source: Completion Keys
fr: Touches de complétion
ru: Ключи Завершения

source: Auto-completer Height
fr: Taille de l'auto-compléteur
ru: Автоподстройка высоты

source: Auto-complete Delay (sec)
fr: Délai d'auto-complétion (sec)
ru: Задержка автозаполнения (сек)

source: Auto-complete Timeout
fr: Délai d'expiration de l'auto-complétion
ru: Тайм-аут автозаполнения

source: Completion Mode
fr: Mode de complétion
ru: Режим заполнения

source: Case Insensitive Matching
fr: Correspondance Insensible à la casse
ru: Без учета регистра

source: Non-Python Completion
fr: Complétion Non-Python
ru: Завершение не-Python

source: Non-Python Word Size
fr: Taille des mots Non-Python
ru: Размер слова Не-Python

source: Include Snippets in Auto-Completer
fr: Inclure les bouts de code dans l’auto-compléteur

source: Lock Scrolling
fr: Verrouiller le défilement
ru: Блокировка прокрутки

source: Ignore White Space
fr: Ignorer les espaces blanc
ru: Игнорировать пробелы

source: Empty Session Warning
fr: Avertissement de session vide
ru: Предупреждение о пустой сессии

source: Diff Color
fr: Couleur des différences
ru: Цвет различий

source: Merged Diff Color
fr: Couleur des différences fusionnées
ru: Цвет слитых различий

source: Enforce Line Length
fr: Forcer la longueur de ligne

source: Document Font
fr: Police des documents
ru: Шрифт документа

source: Use Default Foreground Colors
fr: Utiliser les couleurs de premier plan par défaut
ru: Использовать цвета переднего плана по умолчанию

source: Print Header Format
fr: Format d'impression de l'entête
ru: Формат заголовка печати

source: Print Header Font
fr: Police d'impression de l'entête
ru: Шрифт заголовка печати

source: Print Footer Format
fr: Format d'impression du pied de page
ru: Формат нижнего колонтитула печати

source: Print Footer Font
fr: Police d'impression du pied de page
ru: Шрифт нижнего колонтитула печати

source: Typing Suspend Timeout
fr: Délai d'expiration de suspension de la frappe
ru: Ввод тайм-аута приостановки

source: Max Cache Size (MB)
fr: Taille maximum du cache (MB)
ru: Максимальный размер кеша (МБ)

source: Max Memory Buffers
fr: Maximum de tampons mémoire
ru: Макс. Буфер памяти

source: Interface File Path
fr: Chemin du fichier d'interface
ru: Путь к файлу интерфейса

source: Scrape Extension Modules
fr: Lecture des infos internes des modules d'extension

source: Scraping Helper Snippets
fr: Lecture des infos internes des bouts de codes d'aide

source: Python Docs URL Prefix
fr: Préfixes URL des documentations Python
ru: Префиксы URL для Python Docs

source: Advanced
fr: Avancé
ru: Дополнительно

source: Brace Highlighting
fr: Surlignage des accoldes
ru: Подсветка Скобок

source: Maximum Non-Sticky Editors
fr: Maximum d'éditeurs temporaires

source: Use Custom Mouse Cursor
fr: Utilisez un curseur de souris personnalisé
ru: Использовать пользовательский курсор мыши

source: Mini-search Case Sensitivity
fr: Sensibilité à la casse de la mini-recherche
ru: Мини-Поиск чувствительности к регистру

source: Symbol Menu Max Length
fr: Longueur max du menu de symboles
ru: Максимальная длина меню символов

source: Selection Policy
fr: Politique de sélection
ru: Политика выбора

source: Integer Display Mode
fr: Mode d'affichage des entiers
ru: Целочисленный режим отображения

source: Hover Over Symbols
fr: Passage au dessus des symboles
ru: Наведите Курсор На Символы

source: Hover Over Selection
fr: Passage au dessus de la sélection
ru: Проход над выбором

source: Run Marker Color
fr: Couleur du marqueur
ru: Цвет маркера запуска

source: Run Marker Alpha
fr: Alpha du marqueur
ru: Запустить маркер альфа

source: Active Range Color
fr: Couleur de la sélection active
ru: Цвет активного диапазона

source: Line Threshold
fr: Césure des lignes
ru: Пороговое значение строки (Перенос строк)

source: Indicate Project Files in Stack
fr: Indiquer les fichiers projet dans la pile
ru: Указание файлов проекта в стеке

source: Set Current Directory from Active Editor
fr: Établir le répertoire courant depuis l’éditeur actif
ru: Установка текущего каталога из активного редактора

source: Enable Multi-Process Debugging
fr: Activer le débogage multi-process
ru: Включить отладку нескольких процессов

source: Switch to Stopped Processes
fr: Basculer sur les process stoppés
ru: Переключиться на остановленные процессы

source: Debug Child Processes
fr: Déboguer les process enfants
ru: Отладка дочерних процессов

source: Replace sys.executable
fr: Remplacer sys.executable
ru: Заменить sys.executable

source: Debug Multiple Tests at Once
fr: Déboguer de multiples tests en une fois
ru: Отладка нескольких тестов одновременно

source: Debug Multiple Instances of a Named Entry Point
fr: Déboguer de multiples instances d’u pointt d’entrée nommé
ru: Отладка нескольких экземпляров именованной точки входа

source: Report Exceptions
fr: Rapporter les exceptions
ru: Отчеты об исключениях

source: Report Logged Exceptions In When Printed Mode
fr: Rapporter les exceptions loguées en mode lors de l'impression
ru: Отчет об исключениях, зарегистрированных в режиме печати

source: Never Report
fr: Jamais rapporter
ru: Никогда не сообщать

source: Always Report
fr: Toujours rapporter
ru: Всегда сообщать

source: Debug I/O Encoding
fr: Encodage des E/S du Débogueur
ru: Кодировка I/O отладки

source: Shell Encoding
fr: Encodage du Shell
ru: Кодировка оболочки

source: Pretty Print in Shells
fr: Pretty Print dans les Shells
ru: Привлекательная печать в оболочках

source: OS Commands Encoding
fr: Encodage des commandes de l’OS
ru: Кодировка команд ОС

source: Use External Console
fr: Utiliser une console externe
ru: Использовать внешнюю консоль

source: External Console Waits on Exit
fr: La console externe attend la fermeture
ru: Внешняя консоль ждет выхода

source: External Consoles
fr: Consoles externes
ru: Внешние консоли

source: Show Memory Addresses
fr: Afficher les adresses mémoire

source: Huge List Threshold
fr: Césure des grandes listes
ru: Порог для очень больших списков

source: Huge String Threshold
fr: Césure des grandes chaînes
ru: Порог для очень больших строк

source: Show Data Warnings
fr: Afficher les avertissements de données
ru: Показать предупреждения данных

source: Omit Types
fr: Oubli des types
ru: Опустить типы

source: Omit Names
fr: Oubli des noms
ru: Опустить имена

source: Do Not Expand
fr: Ne pas développer
ru: Не разворачивать

source: Accept Debug Connections
fr: Accepter les connexions de débogage
ru: Принять отладочные подключения

source: Server Host
fr: Hôte serveur
ru: Хост сервера

source: Server Port
fr: Port du serveur
ru: Порт сервера

source: Debug Internals Log File
fr: Déboguer le fichier de log interne
ru: Файл журнала внутренних отладок

source: Python Shell Debug Log
fr: Log de débogage du Shell Python
ru: Журнал отладки оболочки Python

source: Extremely Verbose Internal Log
fr: Log interne extrêmement verbeux
ru: Чрезвычайно подробный внутренний журнал

source: Extremely Verbose Python Shell Debug Log
fr: Log de débogage du Shell Python extrêmement verbeux
ru: Чрезвычайно подробный журнал отладки оболочки Python

source: Allow Calls in Data Inspection
fr: Autoriser les appels dans l’inspection des données
ru: Разрешить вызовы при проверке данных

source: Inspect Base Classes
fr: Inspecter les classes de base
ru: Проверка базовых классов

source: Execute Pasted Lines in Shells Immediately
fr: Exécuter les lignes collées dans les Shells immédiatement
ru: Выполнить строки, вставленные в оболочки немедленно

source: Show Editor on Exceptions in Shells
fr: Afficher l'éditeur sur les exceptions dans les Shells
ru: Показать редактор исключений в Shells

source: Shells Ignore Editor Modes
fr: Les Shells ignorent les modes d'éditeurs
ru: Оболочки игнорируют режимы редактора

source: Termination Model
fr: Modèle de terminaison
ru: Модель завершения

source: Ignore Unsynchronized Files
fr: Ignorer les fichiers non synchronisés
ru: Игнорировать несинхронизированные файлы

source: Use sys.stdin Wrapper
fr: Utiliser le Wrapper sys.stdin
ru: Использование sys.stdin Wrapper

source: Force Win32 Window Raising
fr: Forcer la mise en avant de fenêtre Win32
ru: Принудительное развертывание окна Win32

source: Default Watch Style
fr: Style par défaut de la surveillance
ru: Стиль окна наблюдения по умолчанию

source: Location Map
fr: Carte de localisation
ru: Схема расположения файла

source: Network Timeout
fr: Délai d'expiration réseau
ru: Тайм-аут сети

source: Allowed Hosts
fr: Hôtes autorisés
ru: Разрешенные узлы

source: Common Attach Hosts
fr: Hôtes attachés en commun
ru: Общие прикрепленные хосты

source: SSH Timeout
fr: Délai d'expiration SSH
ru: Тайм-аут SSH

source: Use HTTPS to wingware.com
fr: Utiliser HTTPS sur wingware.com

source: HTTP Proxy Server
fr: Serveur Proxy HTTP

source: Auto-Reload Scripts on Save
fr: Auto-rechargement des scripts lors de l'enregistrement
ru: Автоматическая перезагрузка скриптов при сохранении

source: Search Path
fr: Chemin de recherche
ru: Путь поиска

source: Selection/Caret
fr: Sélection/curseur
ru: Выбор/курсор

source: Line Wrapping
fr: Passage à la ligne
ru: Перенос строк

source: Clipboard
fr: Presse-papier
ru: Буфер обмена

source: Syntax Coloring
fr: Coloration de la syntaxe
ru: Раскраска синтаксиса

source: Code Warnings
fr: Avertissements de code

source: Bookmarks
fr: Signets
ru: Закладки

source: Folding
fr: Repliement
ru: Свёртки

source: Auto-completion
fr: Auto-complétion
ru: Авто-завершение

source: Auto-editing
fr: Auto-édition
ru: Авто-редактирование

source: Diff/Merge
fr: Diff/fusion
ru: Сравнения/Слияния

source: Printing
fr: Impression
ru: Печать

source: Context Menu
fr: Menu contextuel
ru: Контекстное меню

source: Layout
fr: Présentation
ru: Макет

source: Toolbar
fr: Barre d'outils
ru: Панель инструментов

source: Fonts
fr: Polices
ru: Шрифты

source: Keyboard
fr: Clavier
ru: Клавиатуры

source: Other
fr: Autre
ru: Другие

source: File Types
fr: Types de fichier
ru: Типы файлов

source: Reloading
fr: Rechargement
ru: Перезагрузка

source: External Display
fr: Affichage externe
ru: Внешний дисплей

source: Processes
fr: Process
ru: Процессы

source: I/O
fr: E/S

source: Data Display
fr: Affichage des données

source: Data Filters
fr: Filtres de données
ru: Фильтры данных

source: Introspection
fr: Introspectiion

source: Listening
fr: A l’écoute
ru: Tрансляция (Listening)

source: Network
fr: Réseau
ru: Сеть

source: User Interface
fr: Interface utilisateur
ru: Пользовательский интерфейс

source: Projects
fr: Projets
ru: Проекты

source: Files
fr: Fichiers
ru: Файлы

source: Editor
fr: Éditeur
ru: Редактор

source: Debugger
fr: Débogueur
ru: Отладчик

source: Source Analysis
fr: Analyses des sources
ru: Анализ источников

source: Enable built-in version control
fr: Activer le contrôle de version prédéfini
ru: Включить встроенное управление версиями

source: Save files without prompting
fr: Enregistrer les fichiers sans invite
ru: Сохранение файлов без запроса

source: Track changes made in project tool
fr: Changements des traces faites dans l'outil projet
ru: Отслеживание изменений, внесенных в project tool

source: Automatically refresh status
fr: Rafraichissement automatique des statuts
ru: Автоматическое обновление состояния проекта

source: Enable diagnostic logging
fr: Activer le logging de diagnostic
ru: Включить ведение журнала диагностики

source: Version Control
fr: Contrôle de version
ru: Контроль версий

source: IDE Extension Scripting
fr: Scripts d'extension de l'IDE
ru: Сценарии расширения IDE

source: Read preferences from %s
fr: Lire les préférences depuis %s
ru: Чтение настроек из %s

source: Could not read preferences file %s
fr: Impossible de lire le fichier de préférences %s
ru: Не удалось прочитать файл настроек %s
