Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit_commands.po
Languages: de, fr

source: Evaluate the current selection from the editor within the Python Shell tool, optionally restarting the shell first. When whole_lines is set, the selection is rounded to whole lines before evaluation. When unspecified (set to None), the setting from the Shell's Option menu is used instead.
de: Die aktuelle Auswahl vom Editor im Python-Shell-Tool bewerten, wahlweise kann die Shell zuerst neu gestartet werden. Wenn whole_lines (ganze Zeilen) ausgewählt wird, wird die Auswahl vor der Bewertung auf ganze Zeilen gerundet. Wenn nichts bestimmt ist (auf None (Keine) gesetzt), wird stattdessen die Einstellung vom Optionsmenü der Shell verwendet.
fr: Évaluer la sélection actuelle de l'éditeur dans l'outil de Shell Python, optionellement redémarre le shell en premier. Quand whole_lines est affecté, la sélection est arrondie aux lignes entières avant l'évaluation. Lorsque non spécifié (affecté à None), la configuration du menu d'options du Shell est utilisée à la place.

source: Allow user to visit point of definition of a source symbol in the current editor context by typing a fragment of the name
fr: Autorise l'utilisateur à visiter la définition d'un symbole de la source dans le contexte de l'éditeur actuel en tapant un fragment du nom

source: _Goto Definition
de: _Zur Definition springen
fr: Aller à la _définition

source: _Cancel
de: A_bbrechen
fr: Annuler

source: Find Symbol
fr: Trouver un symbole

source: Allow user to visit point of definition of a source symbol in the any file in the project by typing a fragment of the name
fr: Autorise l'utilisateur à visiter le point de définition d'un symbole de la source dans tout fichier dans le projet en tapant un fragment du nom

source: Display the indentation manager for this editor file
de: Den Einrückungsmanager für diese Editordatei anzeigen
fr: Afficher le gestionnaire d'indentation pour ce fichier d'éditeur

source: Convert all lines with leading spaces to mixed tabs and spaces.
de: Alle Zeilen mit führenden Leerzeichen in gemischte Tabs und Leerzeichen umwandeln.
fr: Convertir toutes les lignes contenant des espaces en tête par un mélange de tabulations et d'espaces.

source: Convert all lines containing leading tabs to spaces only.
de: Alle Zeilen, die führende Tabs enthalten, in Nur-Leerzeichen umwandeln.
fr: Convertir toutes les lignes contenant des tabulations en tête par des espaces uniquement.

source: Convert all indentation to use tab characters only and no spaces
de: Alle Einrückungen in die Verwendung von nur Tab-Zeichen und keine Leerzeichen umwandeln.
fr: Convertir toutes les indentations à utiliser uniquement des caractères de tabulations et aucun espace

source: Force the indent style of the editor to mixed use of tabs and spaces, regardless of the file contents
de: Den Einrückungsstil des Editors zum gemischten Gebrauch von Tabs und Leerzeichen zwingen, ohne Beachtung der Inhalte der Datei
fr: Forcer le style d'indent de l'éditeur à mixer l'usage des tabulations et des espaces, indépendamment du contenu du fichier

source: Force the indent style of the editor to use spaces only, regardless of file contents
de: Den Einrückungsstil des Editors zur Verwendung von Nur-Leerzeichen zwingen, ohne Beachtung der Inhalte der Datei
fr: Forcer le style d'indent de l'éditeur à utiliser uniquement des espaces, indépendamment du contenu du fichier

source: Force the indent style of the editor to use tabs only, regardless of file contents
de: Den Einrückungsstil des Editors zur Verwendung von Nur-Tabs zwingen, ohne Beachtung der Inhalte der Datei
fr: Forcer le style d'indent de l'éditeur à utiliser uniquement des tabulations, indépendamment du contenu du fichier

source: Force the indent style of the editor to match the indent style found in the majority of the file
de: Den Einrückungsstil des Editors zwingen, den Einrückungsstil an denjenigen anzupassen, der in der Mehrheit der Datei gefunden wurde
fr: Forcer le style d'indent de l'éditeur à correspondre avec le style d'indent trouvé dans la majorité du fichier

source: Check whether indents consistently use spaces or tabs throughout the file.
de: Überprüfen, ob Einrückungen konsequent Leerzeichen oder Tabs durch die gesamte Datei verwenden.
fr: Vérifie si les indents utilisent, ou non, de façon consistente des espaces ou des tabulations à travers le fichier.

source: Toggle the current fold point
de: Den aktuellen Faltepunkt wechseln
fr: Basculer le point de repliement courant

source: Collapse the current fold point
de: Den aktuellen Faltepunkt zusammenklappen
fr: Réduire le point de repliement courant

source: Expand the current fold point
de: Den aktuellen Faltepunkt erweitern
fr: Développer le point de repliement courant

source: Toggle the clicked fold point
de: Den angeklickten Faltepunkt wechseln
fr: Basculer le point de repliement cliqué

source: Collapse the current fold point one more level
de: Den aktuellen Faltepunkt ein weiteres Level zusammenklappen
fr: Réduire un niveau de plus du point de repliement courant

source: Collapse the clicked fold point one more level
de: Den angeklickten Faltepunkt ein weiteres Level zusammenklappen
fr: Réduire un niveau de plus du point de repliement cliqué

source: Expand the current fold point one more level
de: Den aktuellen Faltepunkt ein weiteres Level erweitern
fr: Développer un niveau de plus du point de repliement courant

source: Expand the clicked fold point one more level
de: Den angeklickten Faltepunkt ein weiteres Level erweitern
fr: Développer un niveau de plus du point de repliement cliqué

source: Collapse the current fold point completely
de: Den aktuellen Faltepunkt vollständig zusammenklappen
fr: Réduire complètement le point de repliement courant

source: Collapse the clicked fold point completely
de: Den angeklickten Faltepunkt vollständig zusammenklappen
fr: Réduire complètement le point de repliement cliqué

source: Expand the current fold point completely
de: Den aktuellen Faltepunkt vollständig erweitern
fr: Développer complètement le point de repliement courant

source: Expand the clicked fold point completely
de: Den angeklickten Faltepunkt vollständig erweitern
fr: Développer complètement le point de repliement cliqué

source: Collapse all fold points in the current file
de: Alle Faltepunkte in der aktuellen Datei zusammenklappen
fr: Réduire tous les points de repliement dans le fichier actuel

source: Expand all fold points in the current file
de: Alle Faltepunkte in der aktuellen Datei erweitern
fr: Développer tous les points de repliement dans le fichier actuel

source: Print active editor document
de: Aktives Editor-Dokument drucken
fr: Imprimer le document de l'éditeur actif

source: Show printing page setup dialog
de: Einstellungsdialog der Druckseite anzeigen
fr: Afficher la boîte de dialogue d’impression de la mise en page

source: Force syntax highlighting for Python source
de: Syntax-Hervorhebung für Python-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Python

source: Force syntax highlighting for Cython source
de: Syntax-Hervorhebung für Cython-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Cython

source: Force syntax highlighting for C/C++ source
de: Syntax-Hervorhebung für C/C++-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources C/C++

source: Force syntax highlighting for Java source
de: Syntax-Hervorhebung für Java-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Java

source: Force syntax highlighting for make files
de: Syntax-Hervorhebung für Makefiles erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers 'make'

source: Force syntax highlighting for DOS batch files
de: Syntax-Hervorhebung für DOS Batch-Dateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers DOS batch

source: Force syntax highlighting for Visual Basic
de: Syntax-Hervorhebung für Visual Basic-Source erzwingen
fr: Forcer le surlignage de syntaxe pour Visual Basic

source: Force syntax highlighting for HTML
de: Syntax-Hervorhebung für HTML erzwingen
fr: Forcer le surlignage de syntaxe pour HTML

source: Force syntax highlighting for properties files
de: Syntax-Hervorhebung für Eigenschaftsdateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers de propriétés

source: Force syntax highlighting for error list format
de: Syntax-Hervorhebung für Fehlerlisten-Format erzwingen
fr: Forcer le surlignage de syntaxe pour le format de liste d'erreurs

source: Force syntax highlighting for MS IDL
de: Syntax-Hervorhebung für MS IDL erzwingen
fr: Forcer le surlignage de syntaxe pour MS IDL

source: Force syntax highlighting for SQL
de: Syntax-Hervorhebung für SQL erzwingen
fr: Forcer le surlignage de syntaxe pour SQL

source: Force syntax highlighting for XML files
de: Syntax-Hervorhebung für XML-Dateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers XML

source: Force syntax highlighting for XCode files
de: Syntax-Hervorhebung für XCode-Dateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers XCode

source: Force syntax highlighting for LaTeX
de: Syntax-Hervorhebung für LaTeX erzwingen
fr: Forcer le surlignage de syntaxe pour LaTeX

source: Force syntax highlighting for Lua
de: Syntax-Hervorhebung für Lua erzwingen
fr: Forcer le surlignage de syntaxe pour Lua

source: Force syntax highlighting for XP IDL
de: Syntax-Hervorhebung für XP IDL erzwingen
fr: Forcer le surlignage de syntaxe pour XP IDL

source: Force syntax highlighting for Javascript
de: Syntax-Hervorhebung für Javascript erzwingen
fr: Forcer le surlignage de syntaxe pour Javascript

source: Force syntax highlighting for RC file format
de: Syntax-Hervorhebung für RC-Dateiformat erzwingen
fr: Forcer le surlignage de syntaxe pour le format de fichier RC

source: Force syntax highlighting for PL/SQL files
de: Syntax-Hervorhebung für PL/SQL-Dateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers PL/SQL

source: Force syntax highlighting for PHP source
de: Syntax-Hervorhebung für PHP-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources PHP

source: Force syntax highlighting for Perl source
de: Syntax-Hervorhebung für Perl-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Perl

source: Force syntax highlighting for diff/cdiff files
de: Syntax-Hervorhebung für diff/cdiff-Dateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers diff/cdiff

source: Force syntax highlighting for Pascal source
de: Syntax-Hervorhebung für Pascal-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Pascal

source: Force syntax highlighting for Apache configuration file format
de: Syntax-Hervorhebung für Apache-Konfigurationsdateiformat erzwingen
fr: Forcer le surlignage de syntaxe pour le format de fichier de configuration Apache

source: Force syntax highlighting for Avenue GIS language
de: Syntax-Hervorhebung für Avenue GIS-Sprache erzwingen
fr: Forcer le surlignage de syntaxe pour le language Avenue GIS

source: Force syntax highlighting Ada source
de: Syntax-Hervorhebung für Ada-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Ada

source: Force syntax highlighting for Eiffel source
de: Syntax-Hervorhebung für Eiffel-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Eiffel

source: Force syntax highlighting for Lisp source
de: Syntax-Hervorhebung für Lisp-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Lisp

source: Force syntax highlighting for Ruby source
de: Syntax-Hervorhebung für Ruby-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les sources Ruby

source: Force syntax highlighting for bash scripts
de: Syntax-Hervorhebung für Bash-Skripte erzwingen
fr: Forcer le surlignage de syntaxe pour les scripts bash

source: Force syntax highlighting for Bullant
de: Syntax-Hervorhebung für Bullant erzwingen
fr: Forcer le surlignage de syntaxe pour Bullant

source: Force syntax highlighting for TCL
de: Syntax-Hervorhebung für TCL erzwingen
fr: Forcer le surlignage de syntaxe pour TCL

source: Force syntax highlighting for CSS2
de: Syntax-Hervorhebung für CSS2 erzwingen
fr: Forcer le surlignage de syntaxe pour CSS2

source: Force syntax highlighting for QSS (Qt Style sheets)
de: Syntax-Hervorhebung für QSS (Qt Style sheets) erzwingen
fr: Forcer le surlignage de syntaxe pour QSS (Feuilles de style Qt)

source: Force syntax highlighting for SCSS formatted SASS
fr: Forcer le surlignage de syntaxe pour le SASS formaté SCSS

source: Force syntax highlighting for Less CSS extension language
fr: Forcer le surlignage de syntaxe pour le langage d’extension Less CSS

source: Force syntax highlighting for HSS CSS extension language
fr: Forcer le surlignage de syntaxe pour le langage d’extension HSS CSS

source: Force syntax highlighting for Fortran
de: Syntax-Hervorhebung für Fortran erzwingen
fr: Forcer le surlignage de syntaxe pour Fortran

source: Force syntax highlighting for Matlab
de: Syntax-Hervorhebung für Matlab erzwingen
fr: Forcer le surlignage de syntaxe pour Matlab

source: Force syntax highlighting for Scriptol
de: Syntax-Hervorhebung für Scriptol erzwingen
fr: Forcer le surlignage de syntaxe pour Scriptol

source: Force syntax highlighting for POV ray tracer scene description language
de: Syntax-Hervorhebung für die POV Ray Tracer Scene Beschreibungssprache erzwingen
fr: Forcer le surlignage de syntaxe pour le language de description de scène ray tracer POV

source: Force syntax highlighting for EScript
de: Syntax-Hervorhebung für EScript erzwingen
fr: Forcer le surlignage de syntaxe pour EScript

source: Force syntax highlighting for LOUT typesetting language
de: Syntax-Hervorhebung für die LOUT Typesetting-Sprache erzwingen
fr: Forcer le surlignage de syntaxe pour le language de typesetting LOUT

source: Force syntax highlighting for MMIX assembly language
de: Syntax-Hervorhebung für die MMIX Assemblersprache erzwingen
fr: Forcer le surlignage de syntaxe pour le language assembleur MMIX

source: Force syntax highlighting for NSIS
de: Syntax-Hervorhebung für NSIS erzwingen
fr: Forcer le surlignage de syntaxe pour NSIS

source: Force syntax highlighting for Postscript
de: Syntax-Hervorhebung für Postscript erzwingen
fr: Forcer le surlignage de syntaxe pour Postscript

source: Force syntax highlighting for YAML
de: Syntax-Hervorhebung für YAML erzwingen
fr: Forcer le surlignage de syntaxe pour YAML

source: Force syntax highlighting for VXML
de: Syntax-Hervorhebung für VXML erzwingen
fr: Forcer le surlignage de syntaxe pour VXML

source: Force syntax highlighting for Masm assembly language
de: Syntax-Hervorhebung für die Masm Assemblersprache erzwingen
fr: Forcer le surlignage de syntaxe pour le language assembleur Masm

source: Force syntax highlighting for Baan
de: Syntax-Hervorhebung für Baan erzwingen
fr: Forcer le surlignage de syntaxe pour Baan

source: Force syntax highlighting for NNCrontab files
de: Syntax-Hervorhebung für NNCrontab-Dateien erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers NNCrontab

source: Force syntax highlighting for Mako template file
de: Syntax-Hervorhebung für Mako-Templates erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers de modèle Mako

source: Force syntax highlighting for Django template file
de: Syntax-Hervorhebung für Django-Templates erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers de modèle Django

source: Force syntax highlighting for R source file
de: Syntax-Hervorhebung für R-Quelltext erzwingen
fr: Forcer le surlignage de syntaxe pour les fichiers sources R

source: Force syntax highlighting for Coffee Script source file
fr: Forcer le surlignage de syntaxe pour les fichiers sources Coffee Script

source: Force syntax highlighting for CMake file
fr: Forcer le surlignage de syntaxe pour les fichiers CMake

source: Use no syntax highlighting
de: Keine Syntax-Hervorhebung verwenden
fr: Ne pas utiliser de surlignage de syntaxe

source: Use syntax highlighting appropriate to the file type
de: Syntax-Hervorhebung entsprechend dem Dateityp verwenden
fr: Utiliser le surlignage approprié au type de fichier

source: Toggles line wrapping preference for all editors
de: Schaltet die Zeilenumbruch-Einstellung für alle Editoren um
fr: Bascule les préférences de passage à la ligne automatique pour tous les éditeurs

source: Set anchor in the visit history to go back to
fr: Fixer une ancre dans l'historique de visites pour retourner à

source: Commands available when working either in the shell or editor
fr: Commandes disponibles en travaillant soit dans le shell ou l'éditeur

source: Constructor
de: Konstruktor
fr: Constructeur

source: Commands for source assistant
fr: Commandes pour l’assistant source

source: Cut or copy a specified number of characters or lines, or the current selection. Set cut=1 to remove the range of text from the editor after moving to register (otherwise it is just copied). Unit should be one of 'char' or 'line' or 'sel' for current selection.
de: Eine festgelegte Anzahl von Zeichen oder Zeilen oder die aktuelle Auswahl auschneiden oder kopieren. cut=1 setzen, um den Textbereich nach dem Verschieben in das Register aus dem Editor zu entfernen (ansonsten wird der Text nur kopiert). Einheit sollte entweder 'char', 'line' oder 'sel' für die aktuelle Auswahl sein.

source: Paste text from register as before or after the current position. If the register contains only lines, then the lines are pasted before or after current line (rather than at cursor). If the register contains fragments of lines, the text is pasted over the current selection or either before or after the cursor. Set pos = 1 to paste after, or -1 to paste before. Set indent=1 to indent the pasted text to match current line. Set cursor=-1 to place cursor before lines or cursor=1 to place it after lines after paste completes.
de: Text aus dem Register vor oder nach der aktuellen Position einfügen. Wenn das Register nur Zeilen enthält, dann werden die Zeilen vor oder nach der aktuellen Zeile eingefügt (anstatt an der Cursor-Position). Wenn das Register Zeilenfragmente enthält, wird der Text über der aktuellen Auswahl oder vor bzw. nach dem Cursor eingefügt. pos=1 setzen oder, um danach einzufügen oder auf -1 setzen, um davor einzufügen. indent=1 setzen, um den eingefügten Text an die bestehende Einrückung anzupassen. cursor=-1 setzen, um den Cursor vor Zeilen zu platzieren oder cursor=1 setzen, um den Cursor nach Zeilen zu platzieren, nachdem das Einfügen abgeschlossen ist.

source: Yank contents of kill buffer created with kill-line into the edit buffer
de: Inhalte des Kill-Buffers, die mit kill-line (Zeile löschen) im Bearbeiten-Puffer erstellt wurden, ziehen

source: Direction:
de: Richtung:

source: Move to screen next line, optionally repositioning character within line: 'same' to leave in same horizontal position, 'start' at start, 'end' at end, or 'fnb' for first non-blank char.
de: Zur nächsten Bildschirmzeile gehen; optional kann ein Zeichen innerhalb der Zeile neu positioniert werden: 'same', um die gleiche waagerechte Position zu belassen, 'start' beim Starten, 'end' beim Beenden oder 'fnb' für erstes nicht-leeres Zeichen.

source: Move to next screen line, adjusting the rectangular selection range to new position, optionally repositioning character within line: same' to leave in same horizontal position, 'start' at start, 'end' at end, or 'fnb' for first non-blank char.
de: Zur nächsten Bildschirmzeile gehen und den rechteckigen Auswahlbereich an die neue Position anpassen; optional kann ein Zeichen innerhalb der Zeile neu positioniert werden werden: 'same', um die gleiche waagerechte Position zu belassen, 'start' beim Starten, 'end' beim Beenden oder 'fnb' für erstes nicht-leeres Zeichen.

source: Move to previous screen line, optionally repositioning character within line: same' to leave in same horizontal position, 'start' at start, 'end' at end, or 'fnb' for first non-blank char.
de: Zur vorherigen Bildschirmzeile gehen; optional kann ein Zeichen innerhalb der Zeile neu positioniert werden: 'same', um die gleiche waagerechte Position zu belassen, 'start' beim Starten, 'end' beim Beenden oder 'fnb' für erstes nicht-leeres Zeichen.

source: Move to previous screen line, adjusting the rectangular selection range to new position, optionally repositioning character within line: same' to leave in same horizontal position, 'start' at start, 'end' at end, or 'fnb' for first non-blank char.
de: Zur vorherigen Bildschirmzeile gehen und den rechteckigen Auswahlbereich an die neue Position anpassen; optional kann ein Zeichen innerhalb der Zeile neu positioniert werden: 'same', um die gleiche waagerechte Position zu belassen, 'start' beim Starten, 'end' beim Beenden oder 'fnb' für erstes nicht-leeres Zeichen.

source: Move to next line in file, repositioning character within line: 'start' at start, 'end' at end, or 'fnb' for first non-blank char.
de: Zur nächsten Zeile in der Datei gehen und Zeichen in der Zeile neu positionieren: 'start' beim Starten, 'end' beim Beenden oder 'fnb' für erstes nicht-leeres Zeichen.

source: Move to previous line in file, repositioning character within line: 'start' at start, 'end' at end, or 'fnb' for first non-blank char.
de: Zur vorherigen Zeile in der Datei gehen und Zeichen in der Zeile neu positionieren: 'start' beim Starten, 'end' beim Beenden oder 'fnb' für erstes nicht-leeres Zeichen.

source: Set start of text marking for selection at current cursor position. Subsequently, all cursor move operations will automatically extend the text selection until stop-mark-command is issued. Unit defines what is selected: can be one of char, line, or block (rectangle).
de: Beginn der Textmarkierung für die Auswahl an der aktuellen Cursor-Position setzen. Danach werden alle Cursor-Bewegungen automatisch die Textauswahl erweitern bis der stop-mark-Befehl erteilt wird. Die Einheit definiert, welcher Text ausgewählt wird: Es kann entweder Zeichen (char), Zeile (line) oder Block (Rechteck) sein.

source: Stop text marking for selection at current cursor position, leaving the selection set as is. Subsequent cursor move operations will deselect the range and set selection to cursor position. Deselect immediately when deselect is True.
de: Textmarkierung für die Auswahl an der aktuellen Cursor-Postion stoppen und die Auwahl so lassen, wie sie ist. Nachfolgende Cursor-Bewegungen werden die Auswahl des Bereiches aufheben und die Auswahl an der Cursor-Position setzen. Auswahl sofort aufheben, wenn Auswahl aufheben auf Wahr gesetzt ist.

source: When currently marking text, this exchanges the current position and mark ends of the current selection
de: Wenn Text markiert wird, verwechselt dieses die Startposition und Anker von der Auswahl.

source: Delete given range of lines, copying them into given register (or currently selected default register if register is None
de: Angegebenen Zeilenbereich löschen und in das angegebene Register kopieren (oder in das aktuell ausgewählte Standardregister, wenn Register auf 'Kein' eingestellt ist)

source: Place a form feed character at the current cursor position
de: Ein Seitenvorschub-Zeichen an der aktuellen Cursor-Position setzen

source: Scroll text left a column w/o moving cursor's relative position on screen. Repeat is number of columns or if >0 and <1.0 then percent of screen.
de: Text eine Spalte nach links rollen, ohne die relative Position des Cursors auf dem Bildschirm zu verschieben. Wiederholung ist die Anzahl der Spalten oder Prozent des Bildschirms, wenn >0 und <1.0.
