Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_wingutils.po
Languages: de, ru

source: Value should be None
de: Wert sollte None sein
ru: Значение должно быть не None

source: Boolean value must be 0 or 1
de: Boolean-Wert muss 0 oder 1 sein
ru: Логическое значение должно быть 0 или 1

source: Value has type %s, should be one of:
de: Wert hat den Typ %s, sollte einer sein von:
ru: Значение имеет тип %s, должно быть одним из:

source: Value is type %s, should be
de: Wert ist vom Typ %s, sollte sein
ru: Значение типа %s, должно быть

source: [one of:
de: [einer von:
ru: [один из:

source: Value out of range, should be one of:
de: Wert ist außerhalb des Bereiches, sollte einer sein von:
ru: Значение вне диапазона, должно быть одним из:

source: Value is type %s, should be %s
de: Wert ist vom Typ %s, sollte %s sein
ru: Значение типа %s, должно быть %s

source: Value out of valid range %s -> %s
de: Wert außerhalb des gültigen Bereiches %s -> %s
ru: Значение из допустимого диапазона %s - > %s

source: [from %s to %s]
de: [von %s bis %s]
ru: [от %s до %s]

source: Value is type %s, should be tuple
de: Wert ist vom Typ %s, sollte Tuple sein
ru: Значение типа %s, должно быть кортежем

source: Bad tuple item %i: %s
de: Fehlerhafter Tuple-Teilwert %i: %s
ru: Плохой элемент кортежа %i: %s

source: [tuple of:
de: [tuple von:
ru: [кортеж из:

source: Value is type %s, should be set
de: Wert ist vom Typ %s, sollte set sein
ru: Значение типа %s, должно быть множеством

source: Bad set item %s (should be %s)
de: Fehlerhaftes set-Element %s (sollte %s sein)
ru: Неверный элемент набора %s (должен быть %s)

source: [set of:
de: [set von:
ru: [множество из:

source: Value has length %i, should be %i
de: Wert hat Länge %i, sollte %i sein
ru: Значение имеет длину %i, должно быть %i

source: Bad tuple slot %i: %s
de: Fehlerhafter Tuple-Slot %i: %s
ru: Плохой слот кортежа %i: %s

source: [tuple length %i of: %s]
de: [tuple Länge %i von: %s]
ru: [длина кортежа %i из: %s]

source: Value is type %s, should be list
de: Wert ist vom Typ %s, sollte list sein
ru: Значение типа %s, должно быть list

source: Bad list item %s: %s
de: Fehlerhafter List-Teilwert %s: %s
ru: Плохой элемент списка %s: %s

source: [list of:
de: [list von:
ru: [список из:

source: Value is %s, should be dict
de: Wert ist %s, sollte dict sein
ru: Значение %s, должно быть dict

source: Bad dictionary key %s: %s
de: Fehlerhafter Dictionary-Schlüssel %s: %s
ru: Плохой ключ словаря %s: %s

source: Bad dictionary value %s: %s
de: Fehlerhafter Dictionary-Wert %s: %s
ru: Плохое значение словаря %s: %s

source: , values:
de: , Werte:
ru: , значения:

source: [None or
de: [None oder
ru: [None или

source: [any value]
de: [beliebiger Wert]
ru: [любое значение]

source: Value is a %s, should be a CResourceLocation
de: Wert ist ein %s, sollte ein CResourceLocation sein
ru: Значение %s, должно быть CResourceLocation

source: [Any resource location]
de: [Beliebige Ressource-Position]
ru: [Любое расположение ресурса]

source: Value is a %s, should be a list of strings
de: Wert ist ein %s, sollte list von Strings sein
ru: Значение %s, должен быть список строк

source: Value contains non-string item in position %i
de: Wert enthält ein Nicht-String Element an Position %i
ru: Значение содержит нестрочный элемент в позиции %i

source: [list of str]
de: [list von str]
ru: [список из строк]

source: [file filters]
de: [Dateifilter]
ru: [фильтр файлов]

source: Value has type %s, should be string containing a #.#.#.# IP4 address
de: Wert hat den Typ %s, sollte aber eine #.#.#.# IPv4 Adresse sein
ru: Значение типа %s, должно быть строкой, содержащей #.#.#.# IP4 address

source: Value should be a #.#.#.# IP4 address
de: Wert sollte eine #.#.#.# IPv4 Adresse sein
ru: Значение должно быть #.#.#.# IP4 address

source: Value should be a #.#.#.# IP4 address but contains non-numeric parts
de: Wert sollte eine #.#.#.# IPv4 Adresse sein, enthält aber nicht-numerische Teile
ru: Значение должно быть #.#.#.# IP4 address, но содержит нечисловые части

source: Icon should be IconReference but has type %s
de: Icon sollte eine IconReference sein, ist aber vom Typ %s
ru: Значок должен быть IconReference но типа %s

source: Icon file does not exist
de: Piktogramm-Datei existiert nicht
ru: Файл значка не существует

source: Icon file is a directory
de: Piktogramm-Datei ist ein Verzeichnis
ru: Файл значка является каталогом

source: Icon spec has type %s, should be string, unicode, or location
de: Piktogramm spec ist vom Typ%s, sollte string, unicode oder location sein
ru: Спецификация значка имеет Тип %s, должна быть строкой, юникодом или расположением

source: Icon spec string must start with wingide- for Wing icon or SP_ for Qt stock icon
de: Piktogramm spec String muss starten mit: wingide- für Wing Icon oder SP_ für Qt stock Icon
ru: Icon spec string должен начинаться с wingide - для значка Wing или SP_ для значка акции Qt

source: Value is not a CResourceLocation: %s
de: Wert ist keine CResourceLocation: %s
ru: Значение не является CResourceLocation: %s

source: Cannot convert text into a CResourceLocation: %s
de: Kann Text nicht in eine CResourceLocation umwandeln: %s
ru: Не удается преобразовать текст в CResourceLocation: %s

source: English
de: Englisch
ru: Английский

source: US, Canada, and Others
de: USA, Kanada und andere
ru: США, Канада и другие

source: Hebrew
de: Hebräisch
ru: Иврит

source: US, Australia, New Zealand, S. Africa
de: USA, Australien, Neu Zealand, Sud Afrika
ru: США, Австралия, Новая Зеландия, ЮАР

source: Western European
de: Westeuropäisch
ru: Западно-Европейский

source: Greek
de: Griechisch
ru: Греческий

source: Baltic Languages
de: Baltische Sprachen
ru: Балтийский язык

source: Central and Eastern European
de: Zentral- und Osteuropa
ru: Центральная и Восточная Европа

source: Cyrillic Languages
de: Kyrillische Sprachen
ru: Кириллические Языки

source: Turkish
de: Türkisch
ru: Турецкий

source: Portuguese
de: Portugiesisch
ru: Португальский

source: Icelandic
de: Isländisch
ru: Исландский

source: Canadian English/French
de: Kanadisches Englisch/Französisch
ru: Канадский Английский/Французский

source: Arabic
de: Arabisch
ru: Арабский

source: Danish, Norwegian
de: Dänisch, Norwegisch
ru: Датский, Норвежский

source: Thai
de: Thailändisch
ru: Тайский

source: Urdu
ru: Урду

source: Vietnamese
de: Vietnamesisch
ru: Вьетнамский

source: Esperanto and Maltese
de: Esperanto und Maltesisch
ru: Эсперанто и мальтийский

source: Nordic Languages
de: Nordische Sprachen
ru: Северные языки

source: Celtic Languages
de: Keltische Sprachen
ru: Кельтские языки

source: Russian
de: Russisch
ru: Русский

source: Ukrainian
de: Ukrainisch
ru: Украинский

source: Unicode (UTF-16)
ru: Юникод (UTF-16)

source: Unicode (UTF-16, big endian)
ru: Юникод (UTF-16, big endian)

source: Unicode (UTF-16, little endian)
ru: Юникод (UTF-16, little endian)

source: Unicode (UTF-7)
ru: Юникод (UTF-7)

source: Unicode (UTF-8)
ru: Юникод (UTF-8)

source: Chinese (PRC)
de: Chinesisch (PRC)
ru: Китайский (PRC)

source: Chinese (ROC)
de: Chinesisch (ROC)
ru: Китайский (ROC)

source: Japanese
de: Japanisch
ru: Японский

source: Korean
de: Koreanisch
ru: Корейский

source: Current code page (ansi/mbcs)
de: Aktuelles Code-Seite (ansi/mbcs)
ru: Текущая кодовая страница (ansi/mbcs)

source: Also known as:
de: Auch bekannt als:
ru: Также известный как:

source: The mime type set for a file, when the user has overridden the default value for the file type.
de: Der Mime-Typ für eine Datei, wenn der Nutzer den Standard Mime-Typ für die Datei außer Kraft setzt.
ru: mime-тип, установленный для файла, когда пользователь переопределил значение по умолчанию для типа файла.

source: The encoding to use for this file, overriding the file system and default encoding. The encoding cannot be changed if there is an encoding comment present in the file; in that case this attribute is ignored and the encoding comment should be changed instead.
de: Die Kodierung für diese Datei, welche die Standard-Kodierung und die Kodierung des Dateisystems außer Kraft setzt. Die Kodierung kann nicht geändert werden, wenn in der Datei ein Kodierungskommentar vorhanden ist. In diesem Fall wird dieses Attribut ignoriert und der Kodierungskommentar sollte stattdessen geändert werden.
ru: Кодировка, используемая для этого файла, переопределяет файловую систему и кодировку по умолчанию. Кодировка не может быть изменена, если в файле присутствует комментарий кодировки; в этом случае этот атрибут игнорируется, и вместо него следует изменить комментарий кодировки.

source: Unknown
de: Unbekannt
ru: Неизвестный

source: Invalid line %d
de: Ungültige Zeile %d
ru: Недопустимая строка %d

source: Invalid name on line %d
de: Ungültiger Name auf der Zeile %d
ru: Недопустимое имя в строке %d

source: Invalid value on line %d
de: Ungültiger Wert auf der Zeile %d
ru: Недопустимое значение в строке %d

source: Unknown value name %s
de: Unbekannter Wertname %s
ru: Неизвестное значение %s

source: Error in %s, line %d
de: Fehler in %s, Zeile %d
ru: Ошибка в % s, строка %d

source: Internal data error:
de: Interner Datenfehler:
ru: Внутренняя ошибка данных:

source: Bad value is:
de: Fehlerhafter Wert ist:
ru: Плохое значение:

source: Error::
de: Fehler::
ru: Ошибка::

source: Fatal Error::
de: Schwerer Fehler::
ru: Фатальная ошибка::

source: NOTE
de: HINWEIS
ru: ЗАМЕТКА

source: WARNING
de: WARNUNG
ru: ПРЕДУПРЕЖДЕНИЕ

source: ERROR
de: FEHLER
ru: ОШИБКА

source: FATAL
de: SCHWER
ru: ФАТАЛЬНО

source: <boolean: 0 or 1>
de: <boolean: 0 oder 1>
