Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit.po
Languages: de, fr, ru

source: When auto-entering spaces is enabled, enforce PEP 8 style spacing by preventing redundant spaces.
fr: Quand l'auto-entrée des espaces est activée, cela force le style d'espaces PEP 8 en prévenant les espaces redondants.

source: When auto-entering spaces is enabled, also auto-enter spaces around ":" in type annotations.
fr: Quand l'auto-entrée des espaces est activée, cela auto-entre aussi des espaces autour de ":" dans les annotations de type.
ru: При включении автоматического ввода пробелов также автоматически вводятся пробелы вокруг аннотаций типа':'.

source: Automatically continue comments or strings in the form ("") or () after a newline is typed within the comment or string text
fr: Continue automatiquement les commentaires ou les chaînes de la forme ("") ou () après qu'une nouvelle ligne soit tapée avec le commentaire ou une chaîne de texte
ru: Автоматически продолжать комментарии или строки в форме ("") или () после ввода новой строки в текст комментария или строки

source: Automatically correct code when typing keys out of order. This handles cases such as x(.) -> x(). and x(:) -> x(): as well as auto-inserting . when missing
fr: Corrige automatiquement le code quand les touches tapées sont dans le désordre. Cela gère les cas comme x(.) -> x(). et x(:) -> x(): comme l'auto-insertion de . lorsque manquant
ru: Автоматически корректировать код при вводе ключей не по порядку. Это обрабатывает случаи, такие как x(.) -> x(). и x(:) -> х(): а также авто-вставка. когда отсутствует

source: Column
de: Spalte
fr: Colonne
ru: Столбец

source: Color
de: Farbe
fr: Couleur
ru: Цвет

source: Border
de: Linie
fr: Bordure
ru: Граница

source: Background
de: Hintergrund
fr: Arrière-plan
ru: Фон

source: Enable to wrap long source lines on the editor display.
fr: Activer pour replier les longues lignes de code source dans l’affichage de l’éditeur.
ru: Включить перенос длинных строк источника на экране редактора.

source: Match Display Font/Size
de: Schriftart/-größe der Anzeige anpassen
fr: Correspondance avec la police/taille d'affichage
ru: Отображение Совпадений Шрифт/Размер

source: No marker
de: Keine Markierung
fr: Pas de marqueur
ru: Нет маркера

source: Underline
de: Unterstreichen
fr: Souligner
ru: Подчеркивание

source: Visual display style to use for bookmarks: Either an underline, a background color change, or no visible marker.
fr: Style d'affichage visuel à utiliser pour les signets : un soulignage, une modification de la couleur d'arrière-plan, ou pas de marqueurs visibles.
ru: Стиль визуального отображения закладок: подчеркивание, изменение цвета фона или отсутствие видимого маркера.

source: Color to use on the source editor for differences during a diff/merge session. The current mark is drawn in a lighter version of the same color. The within-difference change indicators are drawn transparently with the color set in the Text Selection Color preference.
fr: Couleur à utiliser dans l'éditeur source pour les différences durant une session de diff/fusion. La marque actuelle est dessinée dans une version plus légère de la même couleur. Les indicateurs de changements dans la différence sont dessinés en transparence avec la couleur choisie dans la préférence de Couleur de la sélection du texte.
ru: Цвет для использования в редакторе исходного кода для различий в ходе Сравнения/Слияния сессии. Текущая метка рисуется в более легкой версии того же цвета. Индикаторы изменений в пределах разницы отображаются прозрачно с цветом, заданным в параметре Цвет выделения текста.

source: Color to use on the source editor for already merged differences during a diff/merge session. The current mark is drawn in a lighter version of the same color. The within-difference change indicators are drawn transparently with the color set in the Text Selection Color preference.
fr: Couleur à utiliser dans l'éditeur source pour les différences déjà fusionnées durant une session de diff/fusion. La marque actuelle est dessinée dans une version plus légère de la même couleur. Les indicateurs de changements dans la différence sont dessinés en transparence avec la couleur choisie dans la préférence de couleur de la sélection du texte.
ru: Цвет для использования в редакторе исходного кода для уже слили различий в ходе Сравнения/Слияния сессии. Текущая метка рисуется в более легкой версии того же цвета. Индикаторы изменений в пределах разницы отображаются прозрачно с цветом, заданным в параметре Цвет выделения текста.

source: Color to use on the source editor to indicate the location of user-defined bookmarks.
fr: Couleur à utiliser dans l'éditeur de source pour indiquer l'emplacement de signets définis par l'utilisateur.
ru: Цвет, который будет использоваться в редакторе исходного кода, чтобы указать местоположение пользовательских закладок.

source: Width of the blinking insertion caret on the editor, in pixels. Currently limited to a value between 1 and 3.
de: Breite des blinkenden Einfügungscarets im Editor in Pixeln. Zur Zeit auf einen Wert zwischen 1 und 3 begrenzt.
fr: Largeur du curseur clignotant d'insertion dans l'éditeur, en pixels. Actuellement limité à une valeur entre 1 et 3.
ru: Ширина мигающей вставки в редакторе в пикселях. В настоящее время ограничено значением от 1 до 3.

source: Enabled
de: Aktiviert
fr: Activé
ru: Включенный

source: Alpha (Opacity)
fr: Alpha (Opacité)

source: Selects the color to use for the editor caret.
fr: Sélectionne la couleur à utiliser pour le curseur de l'éditeur.
ru: Выбор цвета для курсора редактора.

source: Sets the time in milliseconds between showing and hiding the caret when it is flashing; use 0 to disable flashing entirely
fr: Fixe le temps en millisecondes entre l'affichage et la disparition du curseur lorsqu'il flash ; utilisez 0 pour désactiver le flash entièrement
ru: Устанавливает время в миллисекундах между отображением и скрытием курсора при его мигании; используйте 0, чтобы полностью отключить мигание

source: Always Use Current Split
de: Immer aktuelle Teilung verwenden
fr: Toujours utiliser la division actuelle
ru: Всегда Использовать Текущее Разделение

source: Reuse Visible or Use Current Split
de: Sichtbare oder aktuelle Teilung wieder verwenden
fr: Réutiliser la division visible ou utiliser l'actuelle
ru: Повторное использование видимого или текущего разделения

source: Reuse Visible or Use Adjacent Split
de: Sichtbare wieder oder benachbarte Teilung verwenden
fr: Réutiliser la division visible ou utiliser l'adjacente
ru: Повторное использование видимого или соседнего разделения

source: Always Use Adjacent Split
de: Immer benachbarte Teilung verwenden
fr: Toujours utiliser la division adjacente
ru: Всегда Использовать Смежное Разделение

source: Policy for reusing splits in editors when new files are opened: Either always open in current split, reuse already visible editor falling back on current split, reuse already visible editor falling back on adjacent split, or always open in an adjacent split. This only has an effect when more than one editor split is visible.
de: Richtlinie für die Wiederverwendung von Teilungen in Editoren wenn neue Dateien geöffnet werden: Entweder immer in aktueller Teilung öffnen, Wiederverwenden des bereits sichtbarem Editors mit Rückfall auf aktuelle Teilung, Wiederverwenden des bereits sichtbarem Editors mit Rückfall auf benachbarte Teilung oder immer in benachbarter Teilung öffnen. Dies hat nur Auswirkungen wenn mehr als eine Editor-Teilung sichtbar ist.
fr: Politique pour réutiliser les divisions dans les éditeurs quand de nouveaux fichiers sont ouverts : Soit il est toujours ouvert dans la division actuelle, soit il réutilise l'éditeur visible dans la division actuelle, soit il réutilise l'éditeur visible dans la division adjacente, ou il est toujours ouvert dans une division adjacente. Cela a seulement un effet quand plus d'une division d'éditeur est visible.
ru: Политика повторного использования разбиений в редакторах при открытии новых файлов: всегда открывать в текущем разбиении, повторно использовать уже видимый редактор, возвращаясь к текущему разбиению, повторно использовать уже видимый редактор, возвращаясь к смежному разбиению, или всегда открывать в смежном разбиении. Это действует только в том случае, если видно несколько разбиений редактора.

source: Paste text into the editor from the clipboard when the middle mouse button is pressed. Disabling this is mainly useful for wheel mice with a soft wheel that causes pasting of text before wheel scrolling starts.
de: Text von der Zwischenablage zum Editor einfügen wenn die Mittelmaustaste gedrückt wird. Diese Einstellung deaktivieren um probleme zu vermeiden mit Mausräder die auch als Mittelmaustaste dienen.
fr: Coller le texte dans l'éditeur depuis le presse-papier quand le bouton du milieu de la souris est pressé. Désactiver ceci est principalement utile pour les souris avec une roue sensible qui cause le collage du texte avant que le défilement de la roue commence.
ru: Вставьте текст в редактор из буфера обмена, когда нажата средняя кнопка мыши. Отключение этого в основном полезно для колесных мышей с мягким колесом, которое вызывает вставку текста перед запуском прокрутки колес.

source: Show indent mismatch warning dialog when user selects an indent style that is incompatible with existing file content. This only applies to non-Python files since Wing disallows overriding the indent style in all Python files.
de: Einrückungwarnung anzeigen nach wählen von ein Einrückungsstil das nicht zu existierende Einrückung im Datei passt. Diese Einstellung wird nur für nicht-Python Dateien benutzt.
fr: Afficher une boite de dialogue d'avertissement des discordances d'indent quand l'utilisateur sélectionne un style d'indent qui est incompatible avec un contenu de fichier existant. Cela s'applique seulement aux fichiers non-Python depuis que Wing rejète l'écrasement du style d'indent dans tous les fichiers Python.
ru: Показывать диалоговое окно предупреждения о несоответствии отступов, когда пользователь выбирает стиль отступа, несовместимый с существующим содержимым файла. Это относится только к файлам, отличным от Python, так как Wing запрещает переопределение стиля отступа во всех файлах Python.

source: ## Block Comment in Column 0
de: ## Block-Kommentar in Spalte 0
fr: ## Bloc de commentaire en colonne 0
ru: ## Блокировать комментарий в колонке 0

source: # PEP 8 Style Comment in Column 0
de: # PEP 8 Stil Kommentar in Spalte 0
fr: # Style de commentaire PEP 8 en colonne 0

source: # Indented Comment
de: # Eingerückter Kommentar
fr: # commentaire indenté
ru: # Отступ Комментария

source: # Indented PEP 8 Style Comment
de: # Eingerückter PEP 8 Stil Kommentar
fr: # Style de commentaire PEP 8 indenté

source: Style of commenting to use when commenting out blocks of Python code.
fr: Style de commentaires à utiliser lors de la mise en commentaires de blocs de code Python.
ru: Стиль комментирования для использования во время комментирования блоков кода на языке Python.

source: Formatting options for syntax coloring in editors. Colors are relative to a white background and will be transformed if the background color is set to a color other than white.
de: Formatierungsoptionen für die Syntax-Farbmarkierung in Editoren. Farben beziehen sich auf einen weißen Hintergrund und werden umgewandelt, wenn die Hintergrundfarbe nicht weiß ist.
fr: Option de formattage pour la mise en couleur de la syntaxe dans les éditeur. Les couleurs sont relatives par rapport à un arrière-plan blanc et seront transformées si la couleur d'arrière-plan est une autre que blanc.
ru: Параметры форматирования для раскраски синтаксиса в редакторах. Цвета относятся к белому фону и будут преобразованы, если Цвет фона установлен в цвет, отличный от белого.

source: Controls whether to sort Find Symbol dialog alphabetically or in natural file order
fr: Contrôle le tri de boîte de dialogue trouver un symbole alphabetiquement ou dans l'ordre naturel du fichier
ru: Управляет ли сортировка диалогового окна «Найти символ» в алфавитном порядке или в натуральном порядке файлов

source: Controls whether to include argument specs in the searchable text used in the Find Symbol dialog
fr: Contrôle l'inclusion des specs d'arguments dans le texte recherchable utilisé dans la boîte de dialogue trouver un symbole
ru: Определяет, следует ли включать спецификации аргументов в текст, используемый в диалоговом окне "Найти Символ"

source: Whether or not to include code snippets in the auto-completer.
fr: Inclure ou non les bouts de code dans l'auto-compléteur.
ru: Включать или не включать фрагменты кода в автозаполнитель.

source: Automatically clear the OS Commands consoles each time the command is re-executed
fr: Effacer automatiquement les consoles de commandes de l’OS à chaque fois que la commande est ré-exécutée
ru: Автоматически очистить Команды ОС консоли каждый раз, когда команда выполняется повторно

source: Wrap long output lines in OS Commands tool to fit within available display area.
fr: Replier les longues lignes de sorties dans l'outil de commandes de l’OS pour les ajuster à la zone d'affichage disponible.
ru: Оберните длинные выходные строки в инструменте Команды ОС, чтобы уместиться в пределах доступной области отображения.

source: Console default (%s)
fr: Console par défaut (%s)
ru: Консоль по умолчанию (%s)

source: Default encoding of sub-process input/output when run in the OS Commands panel. This can be overridden on a per-command basis, in each command's properties.
fr: Encodage par défaut des sous-proessus d'entrées/sorties lorsque lancées dans le panneau de commandes de l’OS. Ce peut être écrasé sur une base par-commande, dans les propriétés de chaque commande.
ru: Кодировка по умолчанию ввода/вывода подпроцесса при запуске в панели Команды ОС. Это может быть переопределено для каждой команды в свойствах каждой команды.

source: Highlight Python builtins
de: Python-Builtins hervorheben
fr: Surligner les Prédéfinitions Python
ru: Подсветка встроенных команд Python

source: Match Keyboard Personality
fr: Correspondance avec la personnalité du clavier
ru: Сопоставление Персональной Клавиатуры

source: If Upper Case Char is Typed
de: Wenn ein Großbuchstabe getippt wird
fr: Si un caractère majuscule est tapé
ru: Если символ напечатан в верхнем регистре

source: Always Case Sensitive
de: Immer Groß-/Kleinschreibung beachten
fr: Toujours sensible à la casse
ru: Всегда чувствительный к регистру

source: Always Case Insensitive
de: Immer Groß-/Kleinschreibung ignorieren
fr: Toujours Insensible à la casse
ru: Всегда Без Учета Регистра

source: Whole Words Only
de: Nur ganze Wörter
fr: Uniquement les mots entiers
ru: Только Целые Слова

source: Selects when to automatically highlight other occurrences of the current selection on the editor
fr: Sélectionne quand surligner automatiquement les autres occurrences de la sélection actuelle dans l'éditeur
ru: Выбор, когда следует автоматически выделять другие вхождения текущего выделения в редакторе

source: Disable to allow occurrences highlighting also where case does not match.
fr: Désactiver l'autorisation de surlignage des occurences quand la casse ne correspond pas.
ru: Отключить, чтобы вхождения отображались также там, где регистр не совпал.

source: Filled Block
de: Gefüllter Block
fr: Blocs remplis
ru: Заполненный Блок

source: The style of indicator to use for highlighting other occurrences of the current selection on the editor.
fr: Le style d'indicateur à utiliser pour surligner les autres occurrences de la sélection actuelle dans l'éditeur.
ru: Стиль индикатора, используемый для выделения других вхождений текущего выбора в редакторе.

source: The color used to indicate the current text selection on editable text.
de: Die Farbe, die verwendet wird, um die aktuelle Textauswahl des zu bearbeitenden Textes anzuzeigen.
fr: La couleur utilisée pour indiquer la sélection de texte courante sur du texte évitable.
ru: Цвет, используемый для указания текущего выбора текста в редактируемом тексте.

source: The maximum number of names allowed on a single symbol menu
fr: Nombre maximum de noms alloués à un menu à symbole simple
ru: Максимальное количество имен, разрешенных в меню с одним символом

source: Set this to allow scrolling the editor past the last line.
fr: Fixer ceci pour autoriser le défilement dans l'éditeur au delà de la dernière ligne.
ru: Позволяет прокручивать редактор за последней строкой.

source: Do Nothing
de: Nichts machen
fr: Ne rien faire
ru: Ничего не делать

source: Copy Whole Line
de: Ganze Zeile kopieren
fr: Copier la ligne entière
ru: Копировать Всю Строку

source: Cut or Copy Whole Line
de: Ganze Zeile kopieren oder ausschneiden
fr: Couper ou copier la ligne entière
ru: Вырезать или скопировать всю линию

source: Controls whether or not to copy or cut the whole current line when there is no selection on the editor.
fr: Contrôle si ça copie ou coupe, ou non, la ligne courante en entier quand il n'y a aucune sélection dans l'éditeur.
ru: Определяет, следует ли копировать или вырезать всю текущую строку при отсутствии выделения в редакторе.

source: Clipboard
de: Zwischenablage
fr: Presse-papier
ru: Буфер обмена

source: Debug/Test
de: Debuggen/Testen
fr: Débogage/test
ru: Отладка/Тест

source: Revision Control
de: Versionsverwaltung
fr: Contrôle de révision
ru: Контроль Версий

source: Controls which groups of menu items will be shown in the editor's context menu.
fr: Contrôle quels groupes d'éléments du menu seront affichés dans le menu contextuel de l'éditeur.
ru: Управляет тем, какие группы элементов меню будут отображаться в контекстном меню редактора.

source: Extra menu items to add to the editor context menu.
fr: Éléments supplémentaires du menu à ajouter au menu contextuel de l'éditeur.
ru: Дополнительные пункты меню для добавления в контекстное меню редактора.

source: Item Name
de: Eintrag Name
fr: Nom de l'élément
ru: Имя элемента

source: Whether to add an eol at the end of the file when it is saved
fr: Ajouter, ou non, une fin-de-ligne à la fin du fichier lorsqu'il est sauvegardé
ru: Нужно ли добавлять EOL в конце файла при его сохранении

source: Whether to allow font size zooming in the editor, using the mouse wheel, track pad, or zoom-in and zoom-out commands.
fr: Autorise le zoom sur la taille des polices dans l’éditeur, en utilisant la roulette de la souris, le track pad, ou les commandes de zoom avant, zoom arrière.
ru: Разрешить ли масштабирование шрифта в редакторе с помощью колесика мыши, трекпада или команд увеличения и уменьшения масштаба.

source: The amount by which to zoom font sizes in or out in the Source Assistant.
fr: La quantité pour laquelle les tailles de polices peuvent zoomer avant ou arrière dans l’Assistant source.
ru: Размер, с помощью которого можно масштабировать размер шрифта в или из Помощника Источника.

source: Default
de: Standard
fr: Par défaut
ru: По умолчанию

source: Top and Bottom
de: Oben und unten
fr: Haut et bas
ru: Верх и низ

source: Side by Side
de: Seite an Seite
fr: Côte à côte
ru: Рядом

source: Command-Click
de: Kommando-Klick
fr: Commande-clic

source: Alt-Click
de: Alt-Klick
fr: Alt-clic

source: Ctrl-Click
de: Strg-Klick
fr: Ctrl-clic

source: Alt-Click or Meta-Click
de: Alt-Klick oder Meta-Klick
fr: Alt-clic ou Meta-clic
ru: Alt-Click или Meta-Click

source: If there are multiple selections
fr: S’il y a des sélections multiples
ru: При наличии нескольких выборок

source: When to display multiple selections popup window
fr: Quand afficher la fenêtre popup de sélections multiples
ru: Когда отображается всплывающее окно множественного выбора

source: On Dark Backgrounds
de: Auf dunklem Hintergrund
fr: Sur des arrières-plans sombres
ru: На темном фоне

source: Print Failed
de: Drucken gescheitert
fr: Impression échouée
ru: Ошибка печати

source: Print aborted because no characters will fit on a page. Please check the page margins and font sizes.
de: Drucken abgebrochen, da nicht alle Zeichen auf eine Seite passen. Bitte prüfen Sie die Seitenränder und Schriftgrößen.
fr: Impression abandonnée car aucun caractère n'ira sur une page. Veuillez vérifier les marges et les tailles de police de la page.
ru: Печать прервана, так как символы не помещаются на странице. Пожалуйста, проверьте поля страницы и размеры шрифта.

source: Foreground
de: Vordergrund
fr: Premier plan
ru: Передний план

source: Bold
de: Fett
fr: Gras
ru: Жирный

source: Italic
de: Kursiv
fr: Italique
ru: Курсив

source: EOL Filled
de: EOL gefüllt
fr: Fin de lignes complétées
ru: EOL заполнение

source: Return value:
de: Rückgabe-Wert:
fr: Valeur retournée :
ru: Возвращаемое значение:

source: Copy
de: Kopieren
fr: Copier
ru: Копия

source: {} failed because text could not be copied to clipboard
fr: {} a échoué car le texte n'a pas pu être copié dans le presse-papier
ru: {} ошибка, не удалось скопировать текст в буфер обмена

source: Cut
de: Ausschneiden
fr: Couper
ru: Вырезать

source: Whether to ensure file ends with an EOL character when it is save: Either refer to the preference, or override the preference to always ensure file ends with an EOL or never ensure file ends with an EOL
ru: Следует ли проверять, заканчивается файл символом EOL, при его сохранении: Ссылается на предпочтение, или переопределить предпочтение, чтобы всегда обеспечивать завершение файлов EOL или никогда не завершать файлы символом EOL

source: Press : again to indent following block instead
de: Nochmal : drücken um statt dessen den folgenden Block einzurücken
ru: Нажмите: еще раз вместо отступа, следующего за блоком

source: Press : again to select another possible indent
de: Nochmal : drücken um andere mögliche Einrückung auszuwählen
ru: Нажмите: еще разчтобы выбрать другой возможный отступ

source: Press : again to indent following line
de: Nochmal : drücken um die folgende Zeile einzurücken
ru: Нажмите: еще раз для отступа после строки

source: _Options
de: _Optionen
ru: Опции

source: Indentation
de: Einrückung
ru: Отступ

source: Action:
de: Aktion:
ru: Действие:

source: Conversions:
de: Umwandlungen:
ru: Преобразования:

source: Configure runtime environment for executing this file
ru: Настройка среды выполнения для выполнения этого файла

source: Environment must be in var=value form, one per line:
ru: Окружение должно быть в форме var = value, по одному в строке:

source: Terminal
ru: Терминал

source: Delete Build Command?
de: Build-Befehl löschen?
ru: Удалить Команду Сборки?

source: Type
de: Typ
ru: Тип

source: Source Assistant
de: Source-Assistent
ru: Помощник Источника

source: PEP 287 parse error threshold
de: Grenzwert für PEP 287 Fehler
ru: PEP 287 порог ошибки анализа

source: Rewrap plain text docstrings
ru: Перепаковка текста комментария

source: Add Missing Default Snippets?
de: Fehlende Schnipsel hinzufügen?
ru: Добавить Недостающие Фрагменты По Умолчанию?

source: Are you sure you want to add missing default snippets? This will restore any removed snippets but will not overwrite snippets you have changed and will not remove snippets you have added.
ru: Вы уверены, что хотите добавить недостающие фрагменты по умолчанию? Это восстановит все удаленные фрагменты, но не перезапишет измененные фрагменты и не удалит добавленные фрагменты.

source: Some snippet files could not be copied, including the following. Please check disk permissions and then try again with Add Missing Default Snippets from the Snippets tool's options menu:
ru: Не удалось скопировать некоторые файлы фрагментов, включая следующие. Проверьте права доступа к диску и повторите попытку, добавив отсутствующие Фрагменты по умолчанию из меню параметров инструмента Фрагменты:

source: Add Missing Default Snippets
de: Fehlende Standard-Schnipsel hinzufügen
ru: Добавить Недостающие Фрагменты По Умолчанию

source: Search wrapped
de: Suche umgebrochen
ru: Поиск переноса

source: INSERT
de: EINFÜGEN
ru: ВСТАВИТЬ
