Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_testing.po
Languages: fr, ru

source: List of test files
fr: Liste des fichiers test
ru: Список тестовых файлов

source: Regexp
fr: Expression régulière
ru: Регулярные выражения

source: Name of the unit testing framework
fr: Nom du framework de test unitaire
ru: Имя платформы модульного тестирования

source: The environment to use when running unit tests. Either select a launch configuration, or use the given run arguments with the default environment for the project.
ru: Среда, используемая при выполнении модульных тестов. Выберите конфигурацию запуска или используйте заданные аргументы запуска в среде по умолчанию для проекта.

source: Maximum number of testing processes to run at on time.
fr: Nombre maximum de process de test exécutables en même temps.
ru: Максимальное число процессов тестирования, выполняемых одновременно.

source: Last known test results
fr: Derniers résultats de tests connus
ru: Последние известные результаты теста

source: All Results
fr: Tous les résultats
ru: Все результаты

source: All Results Without Output
fr: Tous les résultats sans sortie
ru: Все результаты без вывода

source: Test results are stored in the user branch of the project file without output by default and then restored when the project is opened. This can be disabled or the output can be stored along with the results.
ru: Результаты тестирования сохраняются в пользовательской ветви файла проекта без вывода по умолчанию, а затем восстанавливаются при открытии проекта. Это можно отключить или сохранить выходные данные вместе с результатами.

source: Default for Testing Framework
fr: Framework de test par défaut
ru: По умолчанию для Testing Framework

source: Run as Package Module if in Package Directory
ru: Запуск как Package Module если в Package Directory

source: Always Run as a Top-Level Module
ru: Всегда запускать как модуль верхнего уровня

source: Whether to run a file in a package directory as a package module. If the file is not run as a package module, it is run as a top-level script. The default varies depending on the unit testing framework and the test runners for some frameworks may ignore this setting.
ru: Запускать ли файл в каталоге пакета как модуль пакета. Если файл не запускается как модуль пакета, он запускается как сценарий верхнего уровня(top-level script). Значение по умолчанию варьируется в зависимости от платформы модульного тестирования, и движки тестов для некоторых платформ могут игнорировать этот параметр.

source: Output
fr: Sortie
ru: Вывод

source: Non-Python Output
fr: Sortie non-Python
ru: Вывод не-Python

source: <i>no children</i>
fr: <i>pas d'enfants</i>
ru: <i>не потомок</i>

source: _Run Tests
fr: Lancer les tests
ru: Выполнить Тест

source: _Debug Tests
fr: _Déboguer les tests
ru: Отладить Тест

source: Filter:
fr: Filtre :
ru: Фильтр:

source: Succeeded
fr: Réussi
ru: Успешно

source: Failed
fr: Echoué
ru: Неудачно

source: Error
fr: Erreur
ru: Ошибка

source: Syntax Error
fr: Erreur de syntaxe
ru: Синтаксическая ошибка

source: Running
fr: En cours
ru: Выполнить

source: No tests to run
fr: Aucun test à lancer
ru: Нет тестов для запуска

source: Clear All Test Results?
fr: Effacer tous les résultats du test ?
ru: Очистить все результаты тестирования?

source: Are you sure you want to clear all the stored test results?
fr: Êtes-vous sûr de vouloir effacer tous les résultats de tests stockés ?
ru: Вы уверены, что хотите очистить все сохраненные результаты теста?

source: Remove File
fr: Enlever le fichier
ru: Удалить файл

source: Remove Files
fr: Enlever les fichiers
ru: Удалить файлы

source: Sort Tests Alphabetically
fr: Trier les tests alphabétiquement
ru: Сортировать тесты по алфавиту

source: Sort Tests by Source Order
fr: Trier les tests par ordre de source
ru: Сортировать тесты по порядку источника

source: Goto Source
fr: Aller à la source
ru: Перейти к источнику

source: Run Test
fr: Lancer le test
ru: Выполнить Тест

source: Debug Test
fr: Test de débogage
ru: Отладка Теста

source: Run All Tests
fr: Lancer tous les tests
ru: Выполнить Все Тесты

source: Clear All Results
fr: Effacer tous les résultats
ru: Очистить Все Результаты

source: Abort Tests
fr: Abandonner les tests
ru: Отменить Тесты

source: Expand All Failed Tests
fr: Développer tous les tests échoués
ru: Развернуть Все Неудачные Тесты

source: Collapse All Tests
fr: Masquer tous les tests
ru: Свернуть Все Тесты

source: Add Files from Project...
fr: Ajouter des fichiers du projet...
ru: Добавить файлы из проекта ...

source: Add Single File...
fr: Ajouter un seul fichier...
ru: Добавить Один Файл...

source: File Properties...
fr: Propriétés du fichier...
ru: Свойства Файла...

source: Select All
fr: Tout sélectionner
ru: Выбрать все

source: Copy Selected Text
fr: Copier le texte sélectionné
ru: Копировать Выделенный Текст

source: Copy Failure Summary
fr: Copier le résumé des Échecs
ru: Сводка Ошибок Копирования

source: Copy All Results
fr: Copier tous les résultats
ru: Копировать Все Результаты

source: Show Testing Documentation
fr: Afficher la documentation sur les tests
ru: Показать Документацию По Тестированию

source: Completed tests
fr: Tests terminés
ru: Завершенные тесты

source: _Abort Tests
fr: _Abandonner les Tests
ru: Отменить Тесты

source: Testing
fr: Tests
ru: Тестирование

source: Unit Tests
fr: Tests unitaires
ru: Модульное тестирование

source: Automatically Ignored Exceptions
fr: Exceptions automatiquement ignorées
ru: Автоматически Игнорируемые Исключения

source: Default Test Framework
fr: Framework de test par défaut
ru: Test Framework по умолчанию

source: Test file patterns
fr: Modèles de fichier de test
ru: Шаблоны тестовых файлов

source: Pattern Type
fr: Type de modèle
ru: Тип Шаблона

source: Pattern
fr: Modèle
ru: Шаблон

source: Environment
fr: Environnement
ru: Окружение

source: Process Model
fr: Modèle de process
ru: Модель процесса

source: Number of Processes
fr: Nombre de process
ru: Число процессов

source: Run As Package Modules
ru: Запуск Пакета Модулей

source: _Testing
fr: Tests
ru: Тестирование

source: Default (%s)
fr: Par défaut (%s)
ru: По умолчанию (%s)

source: Use Project Setting and Run Args:
fr: Utiliser les paramètres du projet et lancer les arguments :
ru: Использовать Настройки Проекта и запускать Args:

source: Use the testing configuration from Project Properties with the specified run arguments
ru: Использовать конфигурацию тестирования из свойств проекта с указанными аргументами запуска

source: Use Selected Launch Configuration:
fr: Utiliser le lancement de configuration sélectionné :
ru: Использовать Выбранную Конфигурацию Запуска:

source: Select a custom launch configuration for testing this file
fr: Sélectionner un lancement de configuration personnalisé pour tester ce fichier
ru: Выберите пользовательскую конфигурацию запуска для тестирования этого файла

source: The environment to use when running this file as a unit test. Either select a launch configuration, or use the given run arguments with the project-specified environment.
ru: Среда, используемая при запуске этого файла в качестве модульного теста. Выберите конфигурацию запуска или используйте заданные аргументы запуска в среде, заданной для проекта.

source: Starting local tests: %s
fr: Lancement des tests locaux : %s
ru: Запуск локальных тестов: %s

source: Starting tests on hostname %s: %s
fr: Lancement des tests sur le nom d’hôte %s : %s
ru: Запуск тестов на хосте %s: %s

source: Debugging local tests: %s
fr: Débogage des tests locaux : %s
ru: Отладка локальных тестов: %s

source: Could not start debug process
fr: N'a pas pu lancer le processus de débogage
ru: Не удалось запустить процесс отладки

source: Debugging tests on hostname %s: %s
ru: Отладка тестов на хосте %s: %s

source: Test process aborted: some tests were not run
fr: Process de test interrompu : des tests n’ont pas été exécutés
ru: Процесс тестирования прерван: некоторые тесты не были выполнены

source: Test process suddenly quit while running %s
fr: Le process de test a quitté soudainement durant l’exécution de %s
ru: Процесс тестирования внезапно прервался при запуске %s

source: in %s
fr: dans %s
ru: в %s

source: Could not execute test runner
ru: Не удалось запустить тестовый движок

source: Could not read any output from test runner
ru: Не удалось прочитать Выходные данные из тестового движка

source: Per-Module
fr: Par-Module

source: Per-Package
fr: Par-Package

source: No Results or Output
fr: Pas de résultats ou de sorties

source: _Debug
fr: Déboguer

source: Clear _All
fr: Tout effacer

source: _Cancel
fr: Annuler

source: Save In Project File
fr: Enregistrer dans le fichier projet

source: Test Framework
fr: Framework de test
