Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_guimgr.po
Languages: de, ru

source: Set this to cause Wing to automatically change perspectives to "debug" whenever debugging is started. The previous perspective ("edit" by default) is restored after debugging has stopped.
ru: Установите, чтобы заставить Wing автоматически изменять перспективы для «отладки» при запуске отладки. Предыдущая перспектива («редактирование» по умолчанию) восстановится после прекращения отладки.

source: Can't access %s
de: Auf %s kann nicht zugegriffen werden
ru: Не удается получить доступ %s

source: The user settings directory %s is read-only or cannot be accessed. Wing cannot run without write access to this directory.
de: Das Verzeichnis %s mit den Benutzer-Einstellungen ist nur lesbar oder es kann nicht darauf zugegriffen werden. Wing kann ohne Schreibzugriff für dieses Verzeichnis nicht ausgeführt werden.
ru: Каталог параметров пользователя %s доступен только для чтения или недоступен. Wing не может работать без доступа на запись в этот каталог.

source: Can't create %s
de: Kann %s nicht erstellen
ru: Не удается создать %s

source: Unable to create a %s directory because the disk is read-only or a file of the same name already exists. Wing cannot run without write access to this directory.
de: Ein %s Verzeichnis kann nicht erstellt werden, weil die Festplatte nur lesbar ist oder eine Datei mit dem gleichen Namen bereits existiert. Wing kann ohne Schreibzugriff für dieses Verzeichnis nicht ausgeführt werden.
ru: Не удалось создать каталог %s, потому что диск доступен только для чтения или файл с тем же именем уже существует. Wing не может работать без разрешения записи в этот каталог.

source: Create a new file set
de: Neue Dateigruppe erstellen
ru: Создать новый набор файлов

source: Delete the selected file set
de: Ausgewählte Dateigruppe löschen
ru: Удалить выбранный набор файлов

source: New
de: Neu
ru: Новый

source: Delete
de: Löschen
ru: Удалить

source: _Show Docs...
de: _Dokumentation anzeigen...
ru: Показать Docs...

source: _Load
de: _Laden
ru: _Загрузить

source: _Close
de: _Schließen
ru: _Закрыть

source: Key Binding
de: Tastenbelegung
ru: Привязка клавиш

source: Shared
de: Geteilt
ru: Общий

source: Name
ru: Название

source: Right click on the list for additional operations
de: Rechtsklick auf die Liste für zusätzliche Operationen
ru: Щелкните правой кнопкой мыши по списку для дополнительных операций

source: Manage File Sets
de: Dateigruppen verwalten
ru: Управление наборами файлов

source: Replace Existing File Set?
de: Vorhandene Dateigruppe ersetzen?
ru: Заменить существующий набор файлов?

source: That fileset already exists. Are you sure you want to replace the existing fileset '%s'?
de: Diese Dateigruppe ist bereits vorhanden. Wollen Sie wirklich die Dateigruppe '%s' ersetzen?
ru: Этот набор уже существует. Вы уверены, что хотите заменить существующий набор файлов '%s'?

source: _Cancel
de: _Abbrechen
ru: _Отмена

source: Confirm File Set Delete
de: Löschen der Dateigruppe bestätigen
ru: Подтвердить Удаление Набора Файлов

source: Are you sure you want to delete file set '%s'?
de: Wollen Sie wirklich die Dateigruppe '%s' löschen?
ru: Вы уверены, что хотите удалить набор файлов '%s'?

source: Open This File Set
de: Diese Dateigruppe öffnen
ru: Открыть Этот Набор Файлов

source: New...
de: Neu...
ru: Новый...

source: Delete...
de: Löschen...
ru: Удалить...

source: Set Key Binding...
de: Tastenbelegung setzen...
ru: Установить привязку клавиш...

source: Update with Currently Opened Files
de: Mit gegenwärtig geöffneten Dateien aktualisieren
ru: Обновление текущих открытых файлов

source: File Set Key Binding
de: Dateigruppe Tastenzuordnung
ru: Привязка Ключа Набору Файлов

source: The key binding to assign to the file set. When pressed, this causes Wing to open all the files in the file set.
de: Tastenkürzel das dieser Dateigruppe zugeordnet werden soll. Wing öffnet alle Dateien dieser Gruppe, wenn gedrückt.
ru: Привязка ключа набору файлов . При нажатии заставит Wing открыть все файлы в наборе файлов.

source: Save current GUI State?
de: Aktuellen Zustand der Oberfläche speichern?
ru: Сохранить текущее состояние GUI?

source: Do you want to save the current GUI state for the perspective %s before changing to perspective %s?
de: Wollen Sie den aktuellen GUI-Zustand für die Perspektive %s sichern, bevor Sie zur Perspektive %s wechseln?
ru: Вы хотите сохранить текущее состояние GUI для перспективы %s Перед переходом на перспективу %s?

source: Auto-Perspectives Enabled
de: Automatische Perspektiven aktiviert
ru: Авто-перспективы включены

source: Wing has turned on auto-perspectives for this project and has changed to the perspective '%s'.
de: Wing hat die automatischen Perspektiven für dieses Projekte aktiviert und zur Perspektive '%s' gewechselt.
ru: Wing включил авто-перспективы для этого проекта и изменил на перспективу '%s'.

source: Auto-Perspectives Disabled
de: Automatische Perspektiven deaktiviert
ru: Автоматические перспективы отключены

source: Wing has turned off auto-perspectives for this project and has changed to the default perspective 'user'.
de: Wing hat die automatischen Perspektiven für dieses Projekte deaktiviert und zur Standard-Perspektive 'user' gewechselt.
ru: Wing отключил авто-перспективы для этого проекта и изменил на перспективу по умолчанию 'user'.

source: The previously current perspective '%s' has been saved and can be restored from the Tools menu.
de: Die zuvor aktuelle Perspektive '%s' wurde gesichert und kann über das Menü Werkzeuge wiederhergestellt werden.
ru: Ранее существующая перспектива '%s' была сохранена и может быть восстановлена из меню «Инструменты».

source: Create a new perspective
de: Neue Perspektive erstellen
ru: Создать новую перспективу

source: Duplicate the selected perspective
de: Ausgewählte Perspektive duplizieren
ru: Дублировать выбранную перспективу

source: Delete the selected perspective
de: Ausgewählte Perspektive löschen
ru: Удалить выбранную перспективу

source: Duplicate
de: Duplizieren
ru: Дублировать

source: _Preferences...
de: _Einstellungen...
ru: Настройки...

source: Auto-save
de: Auto-Speichern
ru: Автосохранение

source: Style
de: Stil
ru: Стиль

source: Manage Perspectives
de: Perspektiven verwalten
ru: Управление Перспективами

source: Cannot Rename Built-in Perspective
de: Eingebaute Perspektive kann nicht umbenannt werden
ru: Не удается переименовать встроенную перспективу

source: The perspective '%s' is a built-in perspective and cannot be renamed.
de: Die Perspektive '%s' ist fest eingebaut und kann nicht umbenannt werden.
ru: Перспектива '%s' является встроенной и не может быть переименована.

source: Overwrite Existing Perspective?
de: Vorhandene Perspektive überschreiben?
ru: Перезаписать существующую перспективу?

source: That perspective already exists. Are you sure you want to overwrite the existing perspective '%s'?
de: Diese Perspektive ist bereits vorhanden. Sind Sie sicher, dass Sie die vorhandene Perspektive '%s' überschreiben wollen?
ru: Эта перспектива уже существует. Вы действительно хотите перезаписать её '%s'?

source: Cannot Delete Built-in Perspective
de: Perspektive duplizieren
ru: Нельзя удалить встроенную перспективу

source: The perspective '%s' is a built-in perspective and cannot be deleted.
de: Die Perspektive '%s' ist fest eingebaut und kann nicht gelöscht werden.
ru: Перспектива '%s' является встроенной и не может быть удалена.

source: Confirm Perspective Delete
de: Löschen der Perspektive bestätigen
ru: Подтверждение удаления перспективы

source: Are you sure you want to delete perspective '%s'? The stored state will be lost.
de: Wollen Sie die Perspektive '%s' wirklich löschen? Der gespeicherte Zustand geht verloren.
ru: Вы уверены, что хотите удалить перспективу '%s'? Сохраненное состояние будет потеряно.

source: _New...
de: _Neu...
ru: _Новый...

source: D_uplicate...
de: D_uplizieren...
ru: _Дублировать...

source: _Delete...
de: _Löschen...
ru: _Удалить...

source: Set _Key Binding...
de: _Tastenbelegung setzen...
ru: Установить привязку клавиш...

source: Update with _Current State
de: Aktualisieren mit derzeitigem Status
ru: Обновление Текущего состояния

source: _Restore Saved State
de: Gespeicherten Status _wiederherstellen
ru: Восстановить сохраненное состояние

source: Perspective Key Binding
de: Perspektive Tastaturbelegung
ru: Перспектива Привязка клавиш

source: The key binding to assign to the perspective. When pressed, this causes Wing to change to that perspective and restore the GUI state associated with it.
ru: Привязка клавиш назначаемых перспективе. При нажатии это заставляет Wing измениться на ту перспективу и восстановить состояние GUI, связанное с ней.

source: _Keyboard Personality
de: _Tastatur-Profil
ru: _Личная Клавиатура

source: Add Selection for Next Occurrence
ru: Добавить выделенное для следующего события

source: Drop Current and Add Next Occurrence
ru: Отбросить текущее и добавить следующее событие

source: Drop Extra Selections
ru: Отбросить Дополнительные Выбор

source: Add All in File
de: Alles in der Datei hinzufügen
ru: Добавить все в файл

source: Add All in Class
de: Alles in der Klasse hinzufügen
ru: Добавить все в класс

source: Add All in Function / Method
de: Alles in der Funktion / Methode hinzufügen
ru: Добавить все в функцию / метод

source: Add All in Block
de: Alles im Block hinzufügen
ru: Добавить все в блок

source: Add Next Wraps
ru: Добавить следующие обертки

source: Case-Sensitive Matching
de: Groß-/Kleinschreibung beachten
ru: Сопоставление с учетом регистра

source: Match Whole Word
de: Ganzes Wort vergleichen
ru: Совпадение всего слова

source: Show Selections Window
de: Auswahlfenster einblenden
ru: Показать окно выбора

source: Hide Selections Window
de: Auswahlfenster ausblenden
ru: Скрыть окно выбора

source: Configure Selections Window
de: Auswahlfenster konfigurieren
ru: Настройка окна выбора

source: Multiple Selections
de: Mehrfachauswahl
ru: Множественный выбор

source: _File
de: _Datei
ru: _Файл

source: _Debug
de: Deb_uggen
ru: _Отладка

source: _Project
de: _Projekt
ru: Проект

source: Testi_ng
de: _Testen
ru: Тестирование

source: W_indow
de: _Fenster
ru: Окно

source: _Recent
de: _Letzte
ru: _Последний

source: Debug _Recent
de: Le_tzte Debuggen
ru: Отладить _последний

source: Debug Named Entry Point
de: Benannten Einsprungspunkt debuggen
ru: Отладка именованной точки входа

source: Execute Re_cent
de: Let_zte Ausführen
ru: Выполнить последний

source: Execute Named Entry Point
de: Benannten Einsprungpunkt ausführen
ru: Выполнить именованную точку входа

source: Recen_t
de: _Letzte
ru: Последний

source: New Panel Window
de: Neues Feldfenster
ru: Новое окно панели

source: Compare Files...
de: Dateien vergleichen...
ru: Сравнение файлов...

source: Compare Directories...
de: Verzeichnisse vergleichen...
ru: Сравнение папок...

source: Compare Visible Files
de: Sichtbare Dateien vergleichen
ru: Сравнить видимые файлы

source: Compare Buffer with Disk
de: Puffer mit gespeicherter Version vergleichen
ru: Сравнить буфер с диском

source: Compare Recent
de: Letzte vergleichen
ru: Сравнить последние

source: Compare to Repository
de: Mit Projektarchiv vergleichen
ru: Сравнить с репозиторием

source: Next Difference
de: Nächster Unterschied
ru: Следующая разница

source: Previous Difference
de: Vorheriger Unterschied
ru: Предыдущая разница

source: Merge Change A->B
de: Änderung A->B zusammenführen
ru: Слияние изменения A-> B

source: Merge Change B->A
de: Änderung B->A zusammenführen
ru: Слияние изменение B-> A

source: Terminate Session
de: Sitzung beenden
ru: Завершить сеанс

source: Lock Scrolling
de: Scrollen sperren
ru: Блокировка прокрутки

source: Ignore Whitespace
de: Leerzeichen ignorieren
ru: Игнорировать пробелы

source: _New
de: _Neu
ru: _Новый

source: _Open...
de: _Öffnen...
ru: _Открыть

source: Open from _Project...
de: Vom _Projekt öffnen...
ru: Открыть из _Project ...

source: Open from _Keyboard
de: Öffnen mit _Tastatur
ru: Открыть с _Клавиатуры

source: File Sets
de: Dateigruppen
ru: Набор файлов

source: Name Set of Open Files...
de: Gruppe geöffneter Dateien benennen...
ru: Имя набора открытых файлов...

source: Name Set of Selected Files...
de: Gruppe ausgewählter Dateien benennen...
ru: Имя набора выбранных файлов...

source: Manage File Sets...
de: Dateigruppen verwalten...
ru: Управление наборами файлов...

source: Clos_e All
de: _Alle schließen
ru: Закрыть вс_е

source: Close O_thers
de: Andere s_chließen
ru: Закрыть Д_ругие

source: _Save
de: S_peichern
ru: _Сохранить

source: Save _As...
de: Speichern _unter...
ru: Сохранить _Как...

source: Save A_ll
de: Alle spe_ichern
ru: Сохранить _Все

source: Revert to _Disk
de: Zur gespeicherten Version _zurückkehren
ru: Вернуться к _Disk

source: _Insert File...
de: Datei einfü_gen...
ru: _Вставить файл...

source: _Print...
de: D_rucken...
ru: _Печать...

source: Pa_ge Setup...
de: Seite _einrichten...
ru: Па_раметры страницы...

source: _Quit
de: _Beenden
ru: В_ыход

source: Configure Auto-Editing...
de: Auto-Bearbeitung konfigurieren...
ru: Настройка авто-редактирования...

source: Configure Tab Key...
de: Tab-Taste konfigurieren...
ru: Настроить клавишу TAB...

source: _Undo
de: _Rückgängig
ru: _Отменить

source: _Redo
de: _Wiederherstellen
ru: _Повторить

source: Cu_t
de: _Ausschneiden
ru: Выр_езать

source: _Copy
de: _Kopieren
ru: _Копировать

source: _Paste
de: _Einfügen
ru: _Вставить

source: C_lear
de: _Löschen
ru: Очистить

source: C_opy Filenames
de: Datei_namen kopieren
ru: Копировать имя файла

source: S_elect
de: Aus_wählen
ru: Выбрать

source: Select _All
de: _Alles auswählen
ru: Выбрать Все

source: Select _More
de: Weniger auswählen
ru: Выбрать больше

source: Select _Less
de: Mehr auswählen
ru: Выбрать меньше

source: Select _Statement
de: _Anweisung auswählen
ru: Выбрать _Statement

source: Select _Next Statement
de: Nächste Anweisung auswählen
ru: Выбрать следующий Statement

source: Select _Previous Statement
de: Vorherige Anweisung auswählen
ru: Выбрать предыдущий Statement

source: Select _Block
de: _Block auswählen
ru: Выбрать блок

source: Select Ne_xt Block
de: Nächsten Block auswählen
ru: Выбрать следующий блок

source: Select Pre_vious Block
de: Vorherigen Block auswählen
ru: Выбрать предыдущий блок

source: Select S_cope
de: Bereich auswählen
ru: Выбрать область

source: Select Nex_t Scope
de: Nächsten Bereich auswählen
ru: Выбрать следующуюобласть

source: Select Prev_ious Scope
de: Vorherigen Bereich auswählen
ru: Выбрать предыдущую область

source: S_election Mode
de: Auswa_hlmodus
ru: Режим выбора

source: _Characters
de: Zei_chen
ru: _Символы

source: _Line
de: Zei_le
ru: Линия

source: Ca_ncel
de: Abbreche_n
ru: Отмена

source: _Multiple Selections
de: _Mehrfachauswahl
ru: Множественный выбор

source: _Search and Replace
de: _Suchen und Ersetzen
ru: _Поиск и Замена

source: _Search
de: _Suchen
ru: _Поиск

source: _Replace
de: _Ersetzen
ru: _Замена

source: Search for Selection F_orward
de: Suche für Auswahl v_orwärts
ru: Поиск выбранного вперёд

source: Search for Selection _Backward
de: Suche für Auswahl rückw_ärts
ru: Поиск выбранного назад

source: _Next Match
de: _Nächster Treffer
ru: _Следующее соответствие

source: _Previous Match
de: _Vorheriger Treffer
ru: _Предыдущие соответствие

source: Search in _Files
de: In _Dateien suchen
ru: Поиск в файлах

source: R_eplace in Files
de: In Da_teien ersetzen
ru: Заменить в файлах

source: Mini-searc_h
de: _Mini-Suche
ru: Мини-поиск

source: _Forward
de: _Vorwärts
ru: _Вперед

source: _Backward
de: _Rückwärts
ru: _Назад

source: Selection For_ward
de: Auswahl Vor_wärts
ru: Выбор вперед

source: Selection Bac_kward
de: Auswahl Rüc_kwärts
ru: Выбор назад

source: Rege_x Forward
de: Rege_x vorwärts
ru: Regex вперед

source: Regex Ba_ckward
de: Regex rü_ckwärts
ru: Regex назад

source: _Query/Replace
de: A_bfragen/Ersetzen
ru: Запрос/Замена

source: Q_uery/Replace Regex
de: Regex _Abfragen/Ersetzen
ru: Запрос/Замена Regex

source: _Replace String
de: _Zeichenkette ersetzen
ru: Заменить строку

source: R_eplace Regex
de: Regex _ersetzen
ru: Заменить Regex

source: _Goto Line...
de: _Gehe zu Zeile...
ru: _Перейти к строке...

source: Show L_ine Numbers
de: _Zeilennummern anzeigen
ru: Показать номера строк

source: Hide L_ine Numbers
de: _Zeilennummern ausblenden
ru: Скрыть номера строк

source: Zoom
ru: Масштаб

source: Zoom In
de: Vergrößern
ru: Увеличить

source: Zoom Out
de: Verkleinern
ru: Уменьшить

source: Reset Zoom
de: Normal
ru: Сброс масштаба

source: Start _Macro Record
de: Makroauf_zeichnung starten
ru: Запустить запись макроса

source: Stop _Macro Record
de: Makroauf_zeichnung stoppen
ru: Остановить запись макроса

source: E_xecute Macro
de: Makro ausführe_n
ru: Выполнить макрос

source: Reload All Scripts
de: Alle Skripte neu laden
ru: Перезагрузить все скрипты

source: Command by _Name
de: Befehl über Name
ru: Команда по имени

source: Configure P_ython...
de: P_ython konfigurieren...
ru: Настройка Python...

source: Pre_ferences...
de: E_instellungen...
ru: Настройки...

source: Enclose with ()
de: Umschließen mit ()
ru: Заключить в ()

source: Enclose with []
de: Umschließen mit []
ru: Заключить в []

source: Enclose with {}
de: Umschließen mit {}
ru: Заключить в {}

source: Enclose with ''
de: Umschließen mit ''
ru: Заключить в ''

source: Enclose with ""
de: Umschließen mit ""
ru: Заключить в ""

source: Enclose with <>
de: Umschließen mit <>
ru: Заключить в <>

source: Change to Lower Case
de: In Kleinschreibung ändern
ru: Изменить на нижний регистр

source: Change to Upper Case
de: In Großschreibung ändern
ru: Изменить на верхний регистр

source: Change to Title Case
de: In Titel-Schreibweise ändern
ru: Изменение регистра заголовка

source: Toggle Symbol Case
de: Groß-/Kleinschreibung des Symbols umschalten
ru: Переключить Регистр Символов

source: _Rename Symbol
de: Symbol _umbenennen
ru: Переименовать идентификатор

source: _Move Symbol
de: Symbol _verschieben
ru: Переместить идентификатор

source: E_xtract Function / Method
de: Funktion / Methode e_xtrahieren
ru: Извлечь функцию / метод

source: _Introduce Variable
de: _Neue Variable einführen
ru: _Ввести Переменную

source: Symbol to _UpperCamelCase
de: Symbol zu _UpperCamelCase
ru: Символ в UpperCamelCase

source: Symbol to _lowerCamelCase
de: Symbol zu _lowerCamelCase
ru: Символ в lowerCamelCase

source: Symbol to under_scored_name
de: Symbol zu under_scored_name
ru: Символ в under_scored_name

source: Symbol to UNDER_SCORED_NAME
de: Symbol zu UNDER_SCORED_NAME
ru: Символ в UNDER_SCORED_NAME

source: Re_wrap Text
de: Text neu _umbrechen
ru: Редактировать текст

source: _Match Braces
de: _Klammernsuche
ru: Сравнить фигурные скобки

source: Insert _Tab Character
de: Tab-Zeichen einf_ügen
ru: Вставить символ _Tab

source: _Show Auto-completer
de: Auto-Vervoll_ständiger anzeigen
ru: Показать автозаполнение

source: _Evaluate File in Python Shell
de: Datei in _Python-Shell bewerten
ru: _Выполнить файл в Python Shell

source: E_valuate Selection in Python Shell
de: Auswahl in Python-Shell be_werten
ru: Оценить выбранное в оболочке Python

source: Toggle Block _Comment
de: Block-Kommentar umschalten
ru: Включить Комментарий Блока

source: _Goto Selected Symbol Defn
de: _Gehe zur gewählten Symboldefinition
ru: _Перейти к выбранному символу Defn

source: Find Points of _Use
de: _Verwendungsstellen finden
ru: Поиск точек использования

source: _Find Symbol
de: Symbol _finden
ru: _Найти Символ

source: Find S_ymbol in Project
de: Finde S_ymbol im Projekt
ru: Найти символ в проекте

source: Toggle _Bookmark
de: Lesezeichen umschalten
ru: Переключить закладку

source: Set _Named Bookmark...
de: _Benanntes Lesezeichen setzen...
ru: Установить именованную закладку...

source: G_oto Bookmark...
de: Ge_he zu Lesezeichen...
ru: Перейти к закладке...

source: Traverse Bookmarks
de: Lesezeichen durchlaufen
ru: Перемещение закладок

source: _Next Bookmark
de: _Nächstes Lesezeichen
ru: Следующая закладка

source: _Previous Bookmark
de: _Vorheriges Lesezeichen
ru: Предыдущая закладка

source: Ne_xt Bookmark in Current File
de: _Nächstes Lesenzeichen in der aktuellen Datei
ru: Следующая закладка в текущем файле

source: Pre_vious Bookmark in Current File
de: _Vorheriges Lesezeichen in der aktuellen Datei
ru: Предыдущая закладка в текущем файле

source: _Indentation
de: _Einrückung
ru: _Абзац

source: In_dent Line(s) to Match
de: Zeile(n) ein_rücken zum Anpassen
ru: Строка(и) отступа для соответствия

source: _Indent
de: _Einrücken
ru: _Отступ

source: _Outdent
de: _Ausrücken
ru: Выступ

source: Indentation _Manager
de: Einrückungs_manager
ru: Диспетчер отступов

source: Line Editing
de: Zeilen bearbeiten
ru: Операции со строками

source: New Line Above
de: Neue Zeile darüber
ru: Вставить новую строку перед текущей

source: New Line Below
de: Neue Zeile darunter
ru: Вставить новую строку после текущей

source: Duplicate Lines Above
de: Zeilen nach oben vervielfachen
ru: Дублировать строку перед текущей

source: Duplicate Lines Below
de: Zeilen nach unten vervielfachen
ru: Дублировать строку после текущей

source: Move Lines Up
de: Zeilen nach oben verschieben
ru: Переместить строку вверх

source: Move Lines Down
de: Zeilen nach unten verschieben
ru: Переместить строку вниз

source: Delete Lines
de: Zeilen löschen
ru: Удаление строк

source: Swap Lines
de: Zeilen vertauschen
ru: Замена строк

source: Enclose
de: Umschließen
ru: Окружать

source: _Folding
de: _Faltung
ru: _Свернуть

source: _Toggle Current Fold
de: Aktuelle Faltung _wechseln
ru: Переключить текущую свертку блока

source: _Collapse Current More
de: Aktuelle weiter _zusammenklappen
ru: _Свернуть текущий блок

source: _Expand Current More
de: Aktuelle weiter _ausklappen
ru: _Развернуть текущий блок

source: C_ollapse Current Completely
de: Aktuelle vollständig zusammen_klappen
ru: Свернуть Текущий полностью

source: E_xpand Current Completely
de: Aktuelle vollständig ausklappen
ru: Развернуть Текущий полностью

source: Collapse _All
de: _Alle zusammenklappen
ru: Свернуть Все

source: Ex_pand All
de: Alle ausklappen
ru: Развернуть Все

source: Fold Python _Methods
de: Python-_Methoden falten
ru: Сложить методы Python

source: Fold Python _Classes
de: _Python-Klassen falten
ru: Сложить классы Python

source: Fold Python Classes and _Defs
de: Python-Klassen und _Defs falten
ru: Сложите классы Python и defs

source: Difference and Merge
de: Vergleichen und Zusammenführen
ru: Разница и слияние

source: Change Case
de: Schreibweise ändern
ru: Изменение регистра

source: Show _Python Environment...
de: _Python-Umgebung zeigen...
ru: Показать среду Python...

source: Current File P_roperties...
de: Aktuelle Dateieigens_chaften...
ru: Свойства текущего файла...

source: _New Project...
de: _Neues Projekt...
ru: Новый проект...

source: _Open Project...
de: Projekt _öffnen...
ru: Открыть проект...

source: _Save Project
de: _Projekt speichern
ru: Сохранить проект

source: Save Project _As...
de: Projekt speichern _unter...
ru: Сохранить проект как...

source: _Close Project
de: Projekt _schließen
ru: _Закрыть Проект

source: Add Existing _Directory...
de: Vorhandenes _Verzeichnis hinzufügen...
ru: Добавить существующий каталог...

source: Add C_urrent File
de: Ak_tuelle Datei hinzufügen
ru: Добавить текущий файл

source: Add Existing _File...
de: _Vorhandene Datei hinzufügen...
ru: Добавить существующий файл...

source: Add New F_ile
de: Neue Date_i hinzufügen
ru: Добавить новый файл

source: Remove Selected _Entry
de: Markierten _Eintrag entfernen
ru: Удалить выбранную запись

source: Show Current File in Project Tool
de: Aktuelle Datei im Projekt-Werkzeugen zeigen
ru: Показать текущий файл в Project Tool

source: _Launch Configurations...
de: _Start-Konfigurationen...
ru: _Конфигурации запуска...

source: Remote _Hosts...
ru: Удаленные узлы...
