Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_wingide.po
Languages: fr

source: About Wing
fr: À propos de Wing

source: Product
fr: Produit

source: Release Type
fr: Type de distribution

source: Release Date
fr: Date de distribution

source: Install Directory
fr: Répertoire d'installation

source: Settings Directory
fr: Répertoire de configurations

source: Cache Directory
fr: Répertoire de cache

source: OS Version
fr: Version de l'OS

source: Memory
fr: Mémoire

source: GUI Toolkit
fr: Boîte à outils d’interface graphique (GUI)

source: Original Install
fr: Installation d’origine

source: _Check for Updates
fr: Vérification des mises a jour

source: License Number
fr: Numéro de licence

source: Licensed Product
fr: Produit licencié

source: License Type
fr: Type de licence

source: Activation Date
fr: Date d'activation

source: License Term
fr: Terme de la licence

source: Customer Info
fr: Informations client

source: Perpetual License - Commercial Use
fr: Licence perpétuelle - Utilisation commerciale

source: Perpetual License - Non-Commercial Use
fr: Licence perpétuelle - Utilisation non-commerciale

source: Perpetual License - Educational Use
fr: Licence perpétuelle - Utilisation éducative

source: Trial License - Evaluation Use Only
fr: Licence d’essai - Utilisation d’évaluation uniquement

source: Annual License - Commercial Use
fr: Licence annuelle - utilisation commerciale

source: Annual License - Non-Commercial Use
fr: Licence annuelle - utilisation non-commerciale

source: Free Annual License - Educational Use
fr: Licence annuelle gratuite - Utilisation éducative

source: Invalid License Type
fr: Type de licence invalide

source: %s (unknown)
fr: %s (inconnu)

source: (missing)
fr: (manquant)

source: _Deactivate License
fr: Désactiver la licence

source: _Renew License
fr: Renouveler la licence

source: _License
fr: Licence

source: _Credits
fr: Crédits

source: Close
fr: Fermer

source: Are you sure you want to revert to version %s?
fr: Êtes-vous sûr de vouloir revenir à la version %s ?

source: _Cancel
fr: Annuler

source: Skipping update check -- done too recently
fr: Saute la vérification des mises-à-jour -- effectué trop récemment

source: Finding Updates
fr: Recherche de mises-à-jour

source: Submitting update request. Please wait:
fr: Soumission d'une requête de mise à jour. Veuillez patienter :

source: Starting update check...
fr: Démarrage de la vérification de mises a jour...

source: Submitting usage stats...
fr: Envoi des statistiques d’utilisation…

source: Connecting to wingware.com
fr: Connexion à wingware.com

source: Network Error
fr: Erreur réseau

source: Unable to connect to wingware.com. Please check your network connection and try again.
fr: Impossible de se connecter à wingware.com. Veuillez vérifier votre connexion réseau et essayez à nouveau.

source: Submitting Stats
fr: Envoi de stats

source: Checking for Updates
fr: Recherche de mises-à-jour

source: Waiting for Reply
fr: Attente de réponse

source: Reading Reply
fr: Lecture de la réponse

source: Error Obtaining Updates
fr: Erreur lors de l'obtention de mises a jour

source: An error was encountered parsing the updates list. This may be caused by a web proxy server, or transient network problem.
fr: Une erreur a été rencontrée en analysant la liste des mises a jour. Cela peut être causé par un serveur de proxy web, ou un problème réseau transitoire.

source: There are no new updates available. Your copy of %s %s is up to date.
fr: Il n'y a pas de nouvelles mises a jour disponibles. Votre copie de %s %s est à jour.

source: No Updates Available
fr: Pas de mises-à-jour disponibles

source: Update Requires an Installer
fr: La mise-à-jour requiert un installer

source: Show Details
fr: Afficher les détails

source: Support+Upgrades Expired
fr: Support+mises-à-niveau expirés

source: Renew _Support+Upgrades
fr: Renouveler Support+mises-à-niveau

source: Support+Upgrades Expiring Soon
fr: Support+mises-à-niveau bientôt à expiration

source: Extend _Support+Upgrades
fr: Étendre Support+mises-à-niveau

source: No Support+Upgrades Subscription
fr: Pas d’abonnement de Support+mises a niveau

source: Add _Support+Upgrades
fr: Ajouter Support+mises-à-niveau

source: _Automatically show this reminder
fr: Afficher automatiquement ce rappel

source: Preparing Interface
fr: Préparation de l'interface

source: _Update
fr: Mise-à-jour

source: A Newer Version is Available
fr: Une nouvelle version est disponible

source: New Version!
fr: Nouvelle version !

source: Summary of changes:
fr: Résumé des modifications :

source: Automatically check for updates
fr: Vérification automatique de mises-à-jour

source: Installing Updates
fr: Installation des mises-à-jour

source: Downloading update to %s
fr: Téléchargement de la mise-à-jour à %s

source: Connecting to server
fr: Connexion au serveur

source: Could not open connection to download update
fr: N’a pas pu ouvrir la connexion pour télécharger la mise-à-jour

source: Downloading update
fr: Téléchargement de la mise-à-jour

source: Downloading update (%d.2MB)
fr: Téléchargement de la mise-à-jour (%d.2MB)

source: Failed to download update
fr: Échec du téléchargement de la mise-à-jour

source: Installing update
fr: Installation de la mise-à-jour

source: Update Failed
fr: Mise-à-jour échouée

source: The update could not be applied. Errors were:
fr: La mise-à-jour n’a pas pu être appliquée. Les erreurs étaient :

source: _Restart Now
fr: Redémarer maintenant

source: _Continue Working
fr: Continuer de travailler

source: Validation Failed
fr: Échec de la validation

source: Update Complete
fr: Mise-à-jour terminée

source: The update has been installed successfully. Please restart Wing to start using the new version.
fr: La mise-à-jour a été installée avec succès. Veuillez redémarrer Wing pour commencer à utiliser cette version.

source: Could not read update data.
fr: Impossible de lire les données de mise-à-jour.

source: Invalid Update File
fr: Fichier de mise-à-jour invalide

source: The selected file %s is not an update file
fr: Le fichier sélectionné %s n’est pas un fichier de mise-à-jour

source: Cannot Apply Update
fr: N’a pas pu appliquer la mise-à-jour

source: Select Update
fr: Sélectionner les mises-à-jour

source: Select the update file
fr: Sélectionner le fichier de mise-à-jour

source: Initializing script manager...
fr: Initialisation du gestionnaire de script…

source: Could not store foreground lock timeout
fr: Il est impossible d'enregistrer le temps d'affichage de l'écran de veille

source: WARNING: Could not restore the original foreground lock timeout used on Windows 98/ME and 2K/XP to control whether background applications can raise windows to the very front. This means that other applications may be able to raise windows unexpectedly until you log out or reboot.
fr: Avertissment : Il est impossible de restaurer le temps d'affichage de l'écran de veille utilisé sous Windows 98/ME et 2000/XP pour contrôler lorsque les applications en tâche de fond peuvent mettre en évidence une fenêtre. Cela signifie que d'autres applications peuvent mettre en évidence une fenêtre lorsque vous vous déconnecter ou que vous redémarrez l'ordinateur.

source: Starting application instance manager...
fr: Démarrage du gestionnaire d’instance d’application…

source: Checking autosaves...
fr: Vérification des auto-enregistrements...

source: Cannot execute unsaved file.
fr: Impossible d'exécuter un fichier non sauvegardé.

source: Cannot execute %s because it does not exist.
fr: Impossible d'exécuter %s parce qu'il n'existe pas.

source: Cannot execute
fr: Impossible à exécuter

source: Could not display %s
fr: Impossible d'afficher %s

source: Error = %s
fr: Erreur = %s

source: Failed to display document viewer or web browser
fr: Impossible d'afficher le visionneur de document ou le navigateur internet

source: Could not display
fr: Impossible d'afficher

source: Bad viewer command
fr: Mauvaise commande du visionneur

source: Timeout waiting for process exit
fr: Attente du délai d'expiration pour quitter le processus

source: Could not start process
fr: Impossible de démarrer le processus

source: Process failed
fr: Processus échoué

source: Could not find in path
fr: Impossible à trouver dans le path

source: Python webbrowser.open() failed
fr: Python webbrowser.open() a échoué

source: Could not launch document viewer for %s. Tried these:
fr: Impossible de lancer le visionneur de document pour %s. A essayé ceux-ci :

source: %s (Error=%ld): %s
fr: %s (Erreur=%ld) : %s

source: Could not read autosave file: %s
fr: Impossible de lire le fichier autosauvegardé : %s

source: Could restore project auto-save file: %s
fr: A pu restaurer le fichier projet auto-sauvegardé : %s

source: Recover Unsaved Changes?
fr: Récupérer les modifications non sauvegardées ?

source: Wing has found changes that were not saved during your last session. Please select the files you wish to recover:
fr: Wing a trouvé des modifications qui n'ont pas été sauvegardées durant votre dernière session. Veuillez sélectionner les fichiers que vous souhaitez récupérer :

source: _Discard Unsaved Changes
fr: Annuler les modifications non sauvegardées

source: _Re-select Files
fr: Re-sélectionner le(s) fichier(s)

source: Discard Unsaved Changes?
fr: Annuler les modification non sauvegardées ?

source: Are you sure you want to discard all unsaved changes?
fr: Êtes-vous sûr de vouloir annuler tous les modifications non sauvegardées ?

source: Discard Some Unsaved Changes?
fr: Annuler quelques modifications non sauvegardées ?

source: Are you sure you want to discard the unsaved changes in the files you did not select?
fr: Êtes-vous sûr de vouloir annuler les modifications non sauvegardées dans les fichiers que vous n'avez pas sélectionnés ?

source: _Restore Selected Files
fr: Restaurer le(s) fichier(s) sélectionné(s)

source: Do _not Restore
fr: Ne pas restaurer

source: Opening specified project...
fr: Ouverture du projet spécifié...

source: Warning: More than one project specified on command line. Only the last one was opened.
fr: Avertissement : Plus d'un projet a été spécifié sur la ligne de commande. Seul le dernier a été ouvert.

source: Opening recent project...
fr: Ouverture du projet récent...

source: Preparing workspace...
fr: Préparation de l'espace de travail...

source: Opening default project...
fr: Ouverture du projet par défaut...

source: Displaying windows...
fr: Affichage des fenêtres...

source: Opening files...
fr: Ouverture des fichiers...

source: No License::Failed to deactivate: No license is active.
fr: Pas de Licence:: Échec de désactivation: Pas de licence active.

source: Deactivate License and Quit?
fr: Désactiver la Licence et Quitter ?

source: Are you sure you want to deactivate and remove license %s and quit Wing?
fr: Êtes-vous sûr de vouloir désactiver et enlever la licence %s et quitter Wing ?

source: _Deactivate and Quit
fr: Désactiver et quitter

source: _Never show any offers
fr: Ne jamais afficher une quelconque offre

source: _Buy Wing Pro Now!
fr: Acheter Wing Pro maintenant !

source: _Remind Me Later
fr: Me le rappeler plus tard

source: _Skip This Offer
fr: Passer cette offre

source: Release Candidate
fr: Distribution admissible (RC)

source: Final Release
fr: Distribution finale

source: Proxy Server Configuration
fr: Configuration du serveur proxy

source: Unable to connect to wingware.com. Please check your network connection and try again. You may need to manually configure proxy settings if you are using an http proxy and Wing is not picking up the settings automatically.
fr: Impossible de se connecter à wingware.com. Veuillez vérifier votre connection réseau et essayer de nouveau. Vous devriez peut-être configurer manuellement vos configurations proxy si vous utilisez un proxy http et que Wing n'arrive pas à repérer vos paramètres automatiquement.

source: _Configure Proxy...
fr: Configurer le proxy...

source: Please quit Wing before logging out or shutting down your system. This ensures that all your changes will be saved to disk.
fr: Veuillez quitter Wing avant de vous déconnecter ou d'éteindre votre système. Ceci assure que toutes vos modifications seront sauvegardées sur le disque.

source: Please quit Wing
fr: Veuillez quitter Wing

source: Some remotely stored files were not saved. Please check Wing before logging out to make sure that all your remotely stored files have been saved successfully.
fr: Quelques fichiers stockés à distance n’ont pas été enregistrés. Veuillez vérifier Wing avant de le quitter pour être sûr que tous vos fichiers stockés à distance ont bien été enregistrés avec succès.
