Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_testing_commands.po
Languages: fr

source: Globally available commands defined for the unit testing manager. These commands are available regardless of whether a testing manager is visible or has keyboard focus.
fr: Commandes disponibles globalement définies pour le gestionnaire de tests unitaires. Ces commandes sont disponibles indépendament de la visibilité du gestionnaire de test ou du focus du clavier.

source: Returns gtk widget; can return None, particularly when show is false
fr: Retourne le widget gtk ; peut retourner None, particulièrement quand show est faux

source: Run or debug the tests in the current editor. Uses the given file or files instead if locs is not None. The locations list may be a list of locations or filenames or a single location or filename. The tests are debugged if debug=True.
fr: Lancer ou déboguer les tests dans l'éditeur actuel. Utilise le ou les fichiers donnés si locs n'est pas None. La liste des emplacements peut être une liste d'emplacements ou de noms de fichiers ou un simple emplacement ou un nom de fichier. Les tests sont débogués si debug=Vrai.

source: Debug the tests in the current editor. Uses the given file or files if locs is not None. The locations can be a list of filenames or locations or a single filename or location.
fr: Déboguer les tests dans l'éditeur actuel. Utilise le ou les fichiers donnés si locs n'est pas None. Les emplacements peuvent être une liste de noms de fichiers ou d'emplacements ou un simple nom de fichier ou un emplacement.

source: Abort any running tests.
fr: Abandonner tous tests en cours.

source: Runs all the tests in testing panel.
fr: Lancer tous les tests dans le panneau de tests.

source: Debug all the tests in testing panel.
fr: Déboguer tous les tests dans le panneau de tests.

source: Run the tests currently selected in the testing panel. The tests are debugged when debug is True.
fr: Lancer les tests sélectionnés actuellement dans le panneau de tests. Les tests sont débogués quand debug est Vrai.

source: Debug the tests currently selected in the testing panel.
fr: Déboguer les tests sélectionnés actuellement dans le panneau de tests.

source: Run again the last group of tests that were run. The tests are debugged when debug is True.
fr: Lancer de nouveau le dernier groupe de tests qui ont été lancés. Les tests sont débogués quand debug est Vrai.

source: Debug the last group of tests that were run.
fr: Déboguer le dernier groupe de tests lancés.

source: Re-run all the previously failed tests. The tests are debugged when debug is True.
fr: Re-lancer tous les tests précédemment échoués. Les tests sont débogués quand debug est Vrai.

source: Re-run all the previously failed tests in the debugger.
fr: Re-lancer tous les tests précédemment échoués dans le débogueur.

source: Runs the current test or tests, if possible. The current tests are determined by the current position in the active view. The tests are debugged when debug is True.
fr: Lance le ou les tests actuel(s), si possible. Les tests actuels sont déterminés par la position actuelle dans la vue active. Les tests sont débogués quand debug est Vrai.

source: Runs the current test or tests, if possible. The current tests are determined by the current position in the active view.
fr: Lance le ou les tests actuel(s), si possible. Les tests actuels sont déterminés par la position actuelle dans la vue active.

source: Runs the clicked test or tests, if possible. The tests are determined by the last clicked position in the active view. The tests are debugged when debug is True.
fr: Lance le ou les tests cliqué(s), si possible. Les tests sont déterminés par la dernière position cliquée dans la vue active. Les tests sont débogués quand debug est Vrai.

source: Runs the clicked test or tests, if possible. The tests are determined by the last clicked position in the active view.
fr: Lance le ou les tests cliqué(s), si possible. Les tests sont déterminés par la dernière position cliquée dans la vue active.

source: Add a file to the set of unit tests. Adds the current editor file if add_current=True. Otherwise, asks the user to select a file.
fr: Ajouter un fichier au jeu de tests unitaires. Ajoute le fichier actuel de l'éditeur si add_current = Vrai. Sinon, demande à l'utilisateur de sélectionner un fichier.

source: Select files to add
fr: Sélectionner les fichiers à ajouter

source: Add a file or files to the set of unit tests. locs can be a list of filenames or locations or a single filename or location. Adds the current editor file if locs is None.
fr: Ajouter un ou des fichiers au jeu de tests unitaires. locs peut être une liste de noms de fichiers ou d'emplacements ou un simple nom de fichier ou emplacement. Ajoute le fichier actuel de l'éditeur si locs est None.

source: Save all test results to a file.
fr: Enregistrer tous les résultats de test dans un fichier.

source: The file to save
fr: Le fichier à enregistrer

source: File to save:
fr: Fichier à enregistrer :

source: Load all test results from a file.
fr: Charger tous les résultats de test depuis un fichier.

source: The file to load
fr: Le fichier à charger

source: File to load:
fr: Fichier à charger :

source: Start verbose logging of test results
fr: Démarrer les loggings verbeux des résultats de test

source: Stop verbose logging of test results
fr: Arrêter les loggings verbeux des résultats de test
