Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_guimgr.po
Languages: de, ru

source: Whether feedback dialog is shown to user on quit.
de: Bestimmt, ob der Feedback-Dialog dem Benutzer beim Beenden angezeigt wird.
ru: Отображается ли диалог обратной связи пользователю при выходе.

source: Used internally to avoid showing the feedback dialog on exit over and over again.
de: Wählt ob das Feedbackdialog am Beenden gezeigt wird.
ru: Используется внутри, чтобы избежать повторного отображения диалога обратной связи при выходе.

source: Whether the error bug reporting dialog (also available from the Help menu) is shown automatically when an unexpected exception is encountered inside Wing.
ru: Отображается ли диалоговое окно сообщения об ошибках (также доступно из меню Справка) автоматически при обнаружении неожиданного исключения внутри Wing.

source: Used internally to remember which unexpected exceptions have already been reported so we only show error reporting dialog once for each.
ru: Используется внутренне, чтобы помнить, какие неожиданные исключения уже были сообщены, поэтому мы показываем диалог отчетов об ошибках только один раз для каждого.

source: Maximum number of non-sticky (auto-closing) editors to keep open at one time, in addition to any that are visible on screen
ru: Максимальное количество non-sticky (автоматическое закрытие) редакторов, которые можно открыть одновременно, в дополнение к тем, которые видны на экране

source: Email address to use by default in the Feedback and Bug Report dialogs
de: E-Mail-Adresse, die standardmäßig in den Feedback- und Fehlerbericht-Dialogen verwendet wird
ru: Адрес электронной почты для использования по умолчанию в диалоговом окне Обратная связь и ошибка

source: Both Option keys
de: Beide Optionstasten
ru: Оба варианта ключей

source: Left Option key
de: Linke Optionstaste
ru: Левая клавиша выбора

source: Command keys
de: Befehls Tasten
ru: Командные клавиши

source: No Alt key
de: Keine Alt-Taste
ru: Нет клавиши Alt

source: Selects the key to use as the Alt- modifier in key bindings. Note that the Option key is also used to enter characters, such as ® on US keyboards or ] on German keyboards. When the Option key is used for the Alt key, Alt-key bindings take precedence and thus may block entering of characters with the Option key. If both functions are needed, use the left Option key for the Alt-key and enter characters with the right Option key. If the Command keys are used for the Alt key, any Alt-key bindings will override Command-key bindings for the same key.
ru: Выбирает ключ для использования в качестве Alt-модификатора при привязке клавиш. Обратите внимание, что клавиша Option также используется для ввода символов, таких как ® на клавиатурах США или ] на немецких клавиатурах. Когда клавиша Option используется для клавиши Alt, привязки клавиш Alt имеют приоритет и, таким образом, могут блокировать ввод символов с помощью клавиши Option. Если обе функции необходимы, используйте левую клавишу Option для клавиши Alt и введите символы с помощью правой клавиши Option. Если для клавиши Alt используются клавиши Command, любые привязки Alt-клавиш будут переопределять привязки клавиш Command для ключевого ключа.

source: Controls whether names are sorted case sensitively (with all caps preceding small letters) or case insensitively
de: Bestimmt, ob bei der Sortierung von Namen die Groß- und Kleinschreibung beachtet werden soll (wobei Großbuchstaben vor Kleinbuchstaben erscheinen) oder ob die Schreibung keine Auswirkung auf die Sortierung haben soll.
ru: Определяет, будут ли имена отсортированы с учетом регистра (со всеми заглавными , предшествующими мелким буквам) или без учета регистра

source: Controls whether "Search in Files" dialog has an extra row of visible options as buttons.
ru: Определяет, имеет ли диалоговое окно "Поиск в файлах" дополнительную строку видимых параметров в виде кнопок.

source: Use Default for OS
de: Voreinstellung für Betriebssystem verwenden
ru: Использовать по умолчанию для OS

source: Use for Copy/Cut/Paste
de: Für Kopieren/Ausschneiden/Einfügen verwenden
ru: Использовать для копировать/вырезать/вставить

source: Use for VI Native Actions
de: Für VI native Aktionen verwenden
ru: Использовать для VI собственных действий

source: Controls whether to automatically move keyboard focus from the editor to tools when they are revealed.
ru: Контролирует, следует ли автоматически перемещать фокус клавиатуры из редактора в инструменты, когда они отображаются.

source: File Operations
de: Dateioperationen
ru: Файловые операции

source: Clipboard
de: Zwischenablage
ru: Буфер

source: Selections
de: Auswahlen
ru: Выбор

source: Indentation
de: Einrückung
ru: Отступ

source: Project Management
de: Projektverwaltung
ru: Управление проектом

source: Bookmarks
de: Lesezeichen
ru: Закладки

source: Testing
de: Testen
ru: Тестирование

source: Controls which groups of tools will be shown in the toolbar.
ru: Управляет отображением групп инструментов на панели инструментов.

source: Extra items to add to the tool bar.
ru: Дополнительные элементы для добавления в панель инструментов.

source: Icon
de: Symbol
ru: Пиктограмма

source: Quit application when last document window closes
de: Anwendung beenden, wenn das letzte Dokumentenfenster geschlossen wird
ru: Выход из приложения при закрытии последнего окна документа

source: -- Editor has unsaved changes!
de: -- Editor hat ungesicherte Änderungen!
ru: --Редактор имеет несохраненные изменения!

source: These edited items have also changed on disk. Select those for which you want to discard your changes and reload from disk:
de: Diese Dateien wurden auch auf der Festplatte geändert. Bitte wählen Sie alle Dateien aus, für die Sie die Änderungen verwerfen möchten und die Dateien von der Festplatte neu laden wollen:
ru: Эти элементы также были изменены на диске. Выберите те, для которых вы хотите отменить свои изменения и перезагрузить с диска:

source: Discard Changes & _Reload
de: Änderungen verwerfen & _Neu Laden
ru: Отменить изменения и перезагрузить

source: _Don't Reload
de: _Nicht Neu Laden
ru: _Не перезагружать

source: These items, some with local edits, have changed on disk. Select those which you want to reload from disk. Any changes in the editor will be discarded:
ru: Эти элементы, некоторые с локальными изменениями, изменились на диске. Выберите те, которые вы хотите перезагрузить с диска. Любые изменения в редакторе будут потеряны:

source: These unedited items have changed on disk. Select those which you want to reload:
de: Diese unbearbeiteten Einträge wurden auf der Festplatte geändert. Bitte wählen Sie die, die neu geladen werden sollen:
ru: Эти неотредактированные элементы изменились на диске. Выберите те, которые вы хотите обновить:

source: _Reload Selected
de: Ma_rkierte Neu Laden
ru: _Перезагрузить выбранную

source: Confirm Reload
de: Neu Laden bestätigen
ru: Подтвердите перезагрузку

source: Con_figure Reloading
de: Neu Laden kon_figurieren
ru: Настройка перезагрузки

source: Use System Default (%s)
de: Standard-Thema verwenden (%s)
ru: Использовать системную настройку (%s)

source: Use Preference Setting (%s)
de: Einstellung verwenden (%s)
ru: Использовать настройки предпочтений (%s)

source: The file %s has been modified. Save it now?
de: Die Datei %s wurde geändert. Jetzt speichern?
ru: Файл %s был изменен. Сохранить сейчас?

source: Save the following files? The selected files will be saved. You will be prompted to name any untitled files:
de: Die folgenden Dateien speichern? Ausgewählte Dateien werden gespeichert. Sei werden nach Namen für alle unbenannten Dateien gefragt:
ru: Сохранить следующие файлы? Выбранные файлы будут сохранены. Вам будет предложено назвать все файлы без названия:

source: (Could not encode)
de: (Es konnte nicht kodiert werden)
ru: (Не удалось закодировать)

source: (Changing file format)
de: (Datei-Format ändern)
ru: (Изменение формата файла)

source: (Disk file is newer)
de: (Datei auf der Festplatte ist neuer)
ru: (Файл на диске новее)

source: (Write failed)
de: (Schreiben fehlgeschlagen)
ru: (Сбой при записи)

source: (Remote write pending)
de: (Remote schreiben in Arbeit)
ru: (Ожидание удаленной записи)

source: Could Not Save Remote Files
de: Remote-Dateien konnten nicht gespeichert werden
ru: Не удалось сохранить удаленные файлы

source: Save Files?
de: Dateien speichern?
ru: Сохранить файлы?

source: _Save Selected Files
de: Ausgewählte Dateien _speichern
ru: _Сохранить выбранные файлы

source: _Don't Save Any Files
de: _Keine Dateien speichern
ru: _Не сохранять файлы

source: Save Document As
de: Dokument speichern unter
ru: Сохранить документ как

source: File is open
de: Datei ist geöffnet
ru: Файл уже открыт

source: A file named '%s' is already open for editing. Please choose a new file name or close the file and choose save as again.
de: Eine Datei mit dem Namen '%s' ist bereits zum Bearbeiten geöffnet. Bitte wählen Sie einen neuen Dateinamen oder schließen Sie die Datei und wählen nochmals Speichern unter.
ru: Файл с именем '%s' уже открыт для редактирования. Выберите новое имя файла или закройте файл и снова выберите Сохранить как.

source: Save As Failed
de: Speichern als fehlgeschlagen
ru: Ошибка Сохранения

source: Failed to inspect remote location %s before save as
ru: Не удалось проверить удаленное расположение %s перед сохранением как

source: File exists
de: Datei existiert
ru: Файл существует

source: A file named '%s' exists. Do you want to replace it?
de: Eine Datei namens '%s' ist bereits vorhanden. Wollen Sie diese ersetzen?
ru: Файл с именем '%s' существует. Вы хотите заменить его?

source: Failed to write file
de: Schreiben der Datei ist fehlgeschlagen
ru: Не удалось записать файл

source: Failed to write %s. Save to another file?
de: Das Schreiben von %s ist fehlgeschlagen. In einer anderen Datei speichern?
ru: Не удалось записать %s. Сохранить в другом файле?

source: Another _File
de: Andere _Datei
ru: Другой файл

source: Different file format
de: Falsche Datei-Format
ru: Другой формат файла

source: File %s doesn't match the file format being written.
de: Datei %s passt nicht zum gewählten Format.
ru: Файл %s не соответствовать формату записываемого файла.

source: Do you want to write changes to this file, select another target file, or cancel the save?
de: Möchten Sie die Änderungen überschreiben, eine andere Zieldatei wählen, oder das Speichern abbrechen?
ru: Вы хотите записать изменения в этот файл, выбрать другой целевой файл или отменить сохранение?

source: O_verwrite
de: Ü_berschreiben
ru: Перезаписать

source: _Another File
de: _Andere Datei
ru: _Другой файл

source: Could not encode file contents
de: Dateiinhalte konnten nicht kodiert werden
ru: Не удалось закодировать содержимое файла

source: Could not encode.
de: Es konnte nicht kodiert werden.
ru: Не удалось закодировать.

source: _Save using Specified Encoding
de: _Speichern mit der angegebenen Kodierung
ru: _Сохранить с помощью указанной кодировки

source: _Overwrite
de: Ü_berschreiben
ru: _Перезаписать

source: Disk file is newer
de: Datei auf der Festplatte ist neuer
ru: Файл на диске новее

source: _Abandon
de: _Verwerfen
ru: _Отказаться

source: Failed to Save As
de: Speichern unter fehlgeschlagen
ru: Не удалось сохранить как

source: Failed to write %s. You have closed the editor window!
de: Das Schreiben von %s ist fehlgeschlagen. Sie haben das Editorfenster geschlossen!
ru: Не удалось записать %s. Вы закрыли окно редактора!

source: Conflicting Filenames
de: Widersprüchliche Dateinamen
ru: Конфликтующие имена файлов

source: The file %s is open in another editor. Please specify another file name to save to.
de: Die Datei %s ist in einem anderen Editor geöffnet. Bitte geben Sie einen anderen Dateinamen für das Speichern an.
ru: Файл %s открыт в другом редакторе. Укажите другое имя файла для сохранения.

source: Icon Size
de: Symbolgröße
ru: Размер значка

source: Tool Style
de: Werkzeugstil
ru: Инструмент Стиль

source: Show Tool Tips
de: Tooltips anzeigen
ru: Показать подсказки

source: Hide this Group
de: Diese Gruppe ausblenden
ru: Скрыть эту группу

source: Groups Shown
de: Angezeigte Gruppen
ru: Отображаемые группы

source: Customize Toolbar...
de: Werkzeugleiste anpassen...
ru: Настроить панель инструментов ...

source: Show at startup
de: Beim Starten anzeigen
ru: Показать при запуске

source: Reformat File for PEP 8
de: Datei für PEP 8 neu formatieren

source: Reformat Selection for PEP 8
de: Auswahl für PEP 8 neu formatieren

source: Configure Auto-Formatting...
de: Auto-Formatierung konfigurieren...

source: Find Points of _Use in Current File
de: _Verwendungsstellen in aktueller Datei finden

source: _Extensions
de: _Erweiterungen

source: _Configure Project for Django
de: Projekt für Django _konfigurieren

source: Start _Django Project
de: Django-Projekt starten

source: Next Tool
de: Nächstes Werkzeug

source: Previous Tool
de: Vorheriges Werkzeug

source: _How-Tos
de: _Wing How-Tos

source: Apply Update...
de: Aktualisierung anwenden...

source: Match Indent
de: Einrückung anpassen

source: Remove Bookmark
de: Lesezeichen entfernen

source: Table of Contents
de: Inhaltsverzeichnis

source: Summary:
de: Zusammenfassung:

source: Details:
de: Einzelheiten:

source: Where did you hear about Wing?
de: Wie haben Sie von Wing erfahren?

source: If you want us to respond, please include a valid email address:
de: Wenn Sie eine Antwort von uns möchten, geben Sie bitte eine gültige E-Mail-Adresse ein:

source: Thanks for your bug report. It has been submitted to wingware.com and will be emailed to our software development staff.
de: Vielen Dank für Ihren Fehlerbericht. Er wurde bei wingware.com eingereicht und wird an unser Software-Entwicklungsteam weitergeleitet.

source: Thanks for your feedback. It has been submitted to wingware.com and will be emailed to our software development staff.
de: Vielen Dank für Ihr Feedback. Es wurde bei wingware.com eingereicht und wird an unser Software-Entwicklungsteam weitergeleitet.

source: Installed updates: %s
de: Installierte Aktualisierungen: %s

source: Wing Menu: %s
de: Wing Menü: %s

source: Failed to set colors
de: Einrichten der Farben ist fehlgeschlagen

source: Failed to set selected colors because the file %s could not be written
de: Das Einrichten der ausgewählten Farben ist fehlgeschlagen, da die Datei %s nicht geschrieben werden konnte

source: _Tab Key Action
de: Aktion der _Tab-Taste

source: Code warnings
de: Code Warnungen

source: No warnings
de: Keine Warnungen

source: Code Warnings:
de: Code Warnungen:

source: More...
de: Mehr...

source: Update All Warnings in File
de: Alle Warnungen in der Datei aktualisieren

source: Show Code Warnings Tool
de: Code Warnungs-Werkzeug anzeigen

source: Bookmarks:
de: Lesezeichen:

source: Could not open %s. Please check the filename.
de: %s konnte nicht geöffnet werden. Bitte überprüfen Sie den Dateinamen.

source: Split Side by Side
de: Nebeneinander teilen

source: Controls whether the color palette is used throughout the user interface
de: Steuert, ob die Farbpalette im überall in der Benutzeroberfläche verwendet wird

source: All Messages
de: Alle Nachrichten

source: Only Warnings and Errors
de: Nur Warnungen und Fehler

source: Only Errors
de: Nur Fehler

source: Controls the format and verbosity of messages shown to the user for each message domain in the message area. Each domain specifies the format (in Python 2.3 logging.Formatter format), and the minimum logging level that should be shown in the display. If a message domain is left unspecified, then the parent domain settings are used instead ("" is the parent of all domains).
de: Kontrolliert das Format und den Umfang von Nachrichten, die dem Nutzer für jede Nachrichtendomäne im Nachrichtenbereich angezeigt werden. Jede Domäne bestimmt das Format (in Python 2.3 logging.Formatter Format) und die minimale Protokollierungsebene, die in der Anzeige gezeigt werden sollte. Wenn eine Nachrichtendomäne nicht spezifiziert wird, dann werden stattdessen die Einstellungen der Parent-Domäne verwendet ("" ist der Parent von allen Domänen).

source: Config
de: Konfiguration

source: Domain
de: Bereich

source: Max Lines
de: Max. Zeilen

source: Minimum Level
de: Minimale Ebene

source: Controls the behavior of the Ctrl-X/C/V key bindings in vi mode. Either always use these for cut/copy/paste, use them for vi native actions such as initiate-numeric-repeat and start-select-block, or use the default by system (clipboard on win32 and other commands elsewhere).
de: Steuert das Verhalten der Tastaturbefehle Strg-X/C/V im VI-Modus. Entweder immer für Ausschneiden/Kopieren/Einfügen, für VI native Aktionen wie für initiate-numeric-repeat und start-select-block oder die Standardeinstellung für das jeweilige System verwenden (Zwischenablage in win32 oder andere Befehle beim Rest).

source: _Compare to Disk
de: Mit gespeicherter Version _vergleichen

source: (Host unavailable)
de: (Host nicht verfügbar)

source: _Save Now
de: _Jetzt speichern

source: _Try Again
de: _Nochmal versuchen

source: Failed to write remote %s. Save to another file?
de: Das Schreiben von entfernter %s ist fehlgeschlagen. In andere Datei speichern?

source: Disk file no longer exists
de: Datei auf der Festplatte ist nicht mehr vorhanden

source: Disk file is older
de: Datei auf der Festplatte ist älter

source: File %s is older on disk than when it was opened in the editor. Do you want to overwrite the file, abandon your changes and reload, select another file to save to, or cancel save?
de: Datei %s ist auf der Festplatte älter als beim Öffnen im Editor. Möchten Sie die Datei überschreiben, Ihre Änderungen verwerfen und neu laden, in eine andere Datei speichern oder das Speichern abbrechen?

source: File %s is newer on disk. Do you want to overwrite changes, abandon your changes and reload, select another file to save to, or cancel save?
de: Datei %s ist neuer auf der Festplatte. Möchten Sie die Änderungen überschreiben, Ihre Änderungen verwerfen und neu laden, in eine andere Datei speichern oder das Speichern abbrechen?

source: Com_pare to Disk
de: Mit gespeicherter Version vergleichen
