Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit_commands.po
Languages: de, fr

source: Cut selected text
de: Markierten Text ausschneiden
fr: Couper le texte sélectionné

source: Copy selected text
de: Markierten Text kopieren
fr: Copier le texte sélectionné

source: Clear selected text
de: Markierten Text löschen
fr: Effacer le texte sélectionné

source: Paste text from clipboard
de: Text aus der Zwischenablage einfügen
fr: Coller le texte depuis le presse-papier

source: Set the register to use for subsequent cut/copy/paste operations
de: Das zu verwendende Register für die folgenden Ausschneiden/Kopieren/Einfügen-Operationen setzen
fr: Affecter le registre pour utiliser les opérations à venir de couper/copier/coller

source: Move the text spanned by the next cursor motion to a register
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, in ein Register verschieben
fr: Déplacer le texte qui s'étend jusqu'au prochain mouvement de curseur dans un registre

source: Undo last action
de: Letzte Aktion rückgangig machen
fr: Annuler la dernière action

source: Redo last action
de: Letzte Aktion wiederherstellen
fr: Refaire la dernière action

source: Kill rest of line from cursor to end of line, and place it into the clipboard with any other contiguously removed lines. End-of-line is removed only if there is nothing between the cursor and the end of the line.
de: Rest der Zeile vom Cursor bis zum Zeilenende löschen und es mit allen anderen zusammenhängend entfernten Zeilen in die Zwischenablage platzieren. Das Ende der Zeile wird nur entfernt, wenn nichts zwischen dem Cursor und dem Zeilenende ist.
fr: Tuer le reste de la ligne depuis le curseur jusqu'à la fin de la ligne, et le placer dans le presse-papier avec toutes les lignes contigues retirées. La fin-de-ligne est enlevée seulement si il n'y a rien entre le curseur et la fin-de-ligne.

source: Initiate incremental mini-search forward from the cursor position, optionally entering the given search string
de: Eine inkrementale Mini-Suche vorwärts an der aktuellen Cursor-Position beginnen, den Suchstring wahlweise eingeben
fr: Initie une mini-recherche incrémentale en avant depuis la position du curseur, optionellement en entrant la chaîne de recherche donnée

source: Initiate incremental regular expression mini-search forward from the cursor position, optionally entering the given search string
de: Eine inkrementale Mini-Suche vorwärts für reguläre Ausdrücke an der aktuellen Cursor-Position beginnen; den Suchstring wahlweise eingeben
fr: Initie une mini-recherche incrémentale d'expression régulière en avant depuis la position du curseur, optionellement en entrant la chaîne de recherche donnée

source: Initiate incremental mini-search backward from the cursor position, optionally entering the given search string
de: Eine inkrementale Mini-Suche rückwärts an der aktuellen Cursor-Position beginnen, den Suchstring wahlweise eingeben
fr: Initie une mini-recherche incrémentale en arrière depuis la position du curseur, optionellement en entrant la chaîne de recherche donnée

source: Initiate incremental regular expression mini-search backward from the cursor position, optionally entering the given search string
de: Eine inkrementale Mini-Suche rückwärts für reguläre Ausdrücke an der aktuellen Cursor-Position beginnen; den Suchstring wahlweise eingeben
fr: Initie une mini-recherche incrémentale d'expression régulière en arrière depuis la position du curseur, optionellement en entrant la chaîne de recherche donnée

source: Repeat the most recent isearch, using same string and regex/text. Reverse direction when reverse is True.
de: Die letzte Suche wiederholen und dafür den gleichen String und Regex/Text verwenden. Suchrichtung umdrehen, wenn "reverse" (umdrehen) auf Wahr gesetzt ist.
fr: Répéter la isearch la plus récente, utilisant les mêmes chaînes et expressions régulières/texte. Inverser la direction quand reverse est Vrai.

source: Initiate incremental mini-search forward from the cursor position, using current selection as the search string. Set persist=False to do the search but end the interactive search session immediately.
de: Eine inkrementale Mini-Suche vorwärts an der Cursor-Position beginnen; dabei die aktuelle Auswahl als Suchstring verwenden. Die Option "persist=False" setzen, um die Suche auszuführen, aber die interaktive Suchsitzung sofort zu beenden.
fr: Initier une mini-recherche incrémentale en avant depuis la position du curseur, en utilisant la sélection actuelle comme chaîne de recherche. Affecter persist=False pour faire la recherche mais finir la session de recherche interactive immédiatement.

source: Initiate incremental mini-search backward from the cursor position, using current selection as the search string. Set persist=False to do the search but end the interactive search session immediately.
de: Eine inkrementale Mini-Suche rückwärts an der Cursor-Position beginnen, dabei die aktuelle Auswahl als Suchstring verwenden. Die Option "persist=False" setzen, um die Suche auszuführen, aber die interaktive Suchsitzung sofort zu beenden.
fr: Initier une mini-recherche incrémentale en arrière depuis la position du curseur, en utilisant la sélection actuelle comme chaîne de recherche. Affecter persist=False pour faire la recherche mais finir la session de recherche interactive immédiatement.

source: Search for the given character. Searches to right if dir > 0 and to left if dir < 0. Optionally place cursor pos characters to left or right of the target (e.g., use -1 to place one to left). If repeat > 1, the Nth match is found. Set single_line=1 to search only within the current line.
de: Suche nach dem gegebenen Zeichen. Sucht nach rechts, wenn dir > 0 ist und nach links, wenn dir < 0 ist. Optional können die Cursor-Positionszeichen (cursor pos characters) links oder rechts vom Zielpunkt platziert werden (z. B. -1 verwenden, um sie links zu platzieren). Wenn repeat > 1 ist, wird der n-te-Treffer gefunden. Die Option "single_line=1" setzen, um nur in der aktuellen Zeile zu suchen.
fr: Rechercher le caractère donné. Recherche à droite si dir > 0 and à gauche si dir < 0. optionellement place le curseur de position des caractères de gauche à droite de la cible (e.g., utiliser -1 pour en placer un à gauche). Si repeat > 1, la Nème correspondance sera trouvée. Affecter single_line=1 pour chercher uniquement dans la ligne actuelle.

source: Search direction (>0 to right, <0 to left)
de: Suchrichtung (>0 nach rechts, <0 nach links)
fr: Chercher la direction (>0 vers la droite, <0 vers la gauche)

source: Target cursor position relative to search target, negative to move to left
de: Ziel-Cursor-Position relativ zum Suchziel; ist negativ um nach links zu verschieben
fr: Position cible relative du curseur par rapport à la cible de recherche, négatif pour bouger à gauche

source: Target Pos:
de: Zielposition:
fr: Position cible :

source: Number of matches to traverse
de: Anzahl der zu durchlaufenden Treffer
fr: Nombre de correspondances à traverser

source: Repeat:
de: Wiederholen:
fr: Répéter :

source: Search only with current line
de: Nur in der aktuellen Zeile suchen
fr: Chercher seulement avec la ligne actuelle

source: Single Line:
de: Einzelne Zeile:
fr: Ligne simple :

source: Repeat the last search_char operation, optionally in the opposite direction.
de: Die letzte search_char Operation wiederholen; optional in der entgegengesetzten Richtung.
fr: Répéter la dernière opération search_char, optionellement dans la direction opposée.

source: Change to opposite direction of search
de: Zur entgegengesetzten Suchrichtung wechseln
fr: Changer dans la direction opposée de recherche

source: Opposite:
de: Entgegengesetzt:
fr: Opposé :

source: Repeat the last editor command
de: Letzten Editorbefehl wiederholen
fr: Répéter la dernière commande de l'éditeur

source: Show the auto-completer for current cursor position
de: Auto-Vervollständiger an der aktuellen Cursor-Position aufschlagen
fr: Afficher l'auto-compléteur pour la position actuelle du curseur

source: Match brace at current cursor position, selecting all text between the two and hilighting the braces
de: Klammer an der aktuellen Cursor-Position anpassen, gesamten Text zwischen den beiden auswählen und die Klammern markieren
fr: Correspondance d'accolades à la position actuelle du curseur, sélectionnant tout le texte entre les deux accolades en surbrillance

source: Place a tab character at the current cursor position
de: Ein Tab-Zeichen an der aktuellen Cursor-Position setzen
fr: Placer un caractère de tabulation à la position actuelle du curseur

source: Outdent line at current position
de: Zeile an der aktuellen Position ausrücken
fr: Désindenter la ligne de la position actuelle

source: Implement the tab key, the action of which is configurable by preference
de: Tab-Taste implementieren, deren Aktion über die Einstellungen konfiguriert werden kann
fr: Implémente la touche tabulation, l'action qui est configurable dans les préférences

source: Indent to next indent stop from the current position. Acts like indent command if selection covers multiple lines.
de: Von der aktuellen Position bis zum nächsten Einrückungsstopp einrücken. Funktioniert wie der Einrückungsbefehl, wenn die Auswahl mehrere Zeilen abdeckt.
fr: Indente jusqu'au prochain stop d'indent depuis la position actuelle. Agit comme une commande d'indent si la sélection couvre plusieurs lignes.

source: Move to beginning of current wrapped line
de: Zum Anfang der aktuellen umgebrochenen Zeile gehen
fr: Déplacer au début du retour à la ligne de la ligne actuelle

source: Move to beginning of current wrapped line, extending selection
de: Zum Anfang der aktuellen umgebrochenen Zeile gehen und dabei Auswahl erweitern
fr: Déplacer au début du retour à la ligne de la ligne actuelle, extendant la sélection

source: Move to first non-blank character at beginning of current wrapped line
de: Zum ersten, nicht-leeren Zeichen am Anfang der aktuellen, umgebrochenen Zeile gehen
fr: Se déplacer au premier caractère non-blanc du début de la ligne repliée actuelle

source: Move to first non-blank character at beginning of current wrapped line, extending selection
de: Zum ersten, nicht-leeren Zeichen am Anfang der aktuellen, umgebrochenen Zeile gehen und dabei Auswahl erweitern
fr: Se déplacer au premier caractère non-blanc du début de la ligne repliée actuelle, en étendant la sélection

source: Move to end of current line
de: Zum Ende der aktuellen Zeile gehen
fr: Se déplacer à la fin de la ligne actuelle

source: Move to end of current line, adjusting the selection range to new position
de: Zum Ende der aktuellen Zeile gehen und den Auswahlbereich an die neue Position anpassen
fr: Se déplacer à la fin de la ligne repliée actuelle, en ajustant la gamme de sélection à la nouvelle position

source: Move to end of current wrapped line
de: Zum Ende der aktuellen, umgebrochenen Zeile gehen
fr: Se déplacer à la fin de la ligne repliée actuelle

source: Move to end of current wrapped line, extending selection
de: Zum Ende der aktuellen, umgebrochenen Zeile gehen und dabei Auswahl erweitern
fr: Se déplacer à la fin de la ligne repliée actuelle, en étendant la sélection

source: Move to middle of current wrapped line
de: Zur Mitte der aktuellen, umgebrochenen Zeile gehen
fr: Se déplacer au milieu de la ligne repliée actuelle

source: Move to middle of current wrapped line, extending selection
de: Zur Mitte der aktuellen, umgebrochenen Zeile gehen und dabei die Auswahl erweitern
fr: Se déplacer au milieu de la ligne repliée actuelle, en étendant la sélection

source: Move cursor forward one character
de: Cursor ein Zeichen vorwärts bewegen
fr: Déplacer le curseur un caractère en avant

source: Move cursor forward one character, adjusting the selection range to new position
de: Cursor ein Zeichen vorwärts bewegen und den Auswahlbereich an die neue Position anpassen
fr: Déplacer le curseur un caractère en avant, en ajustant la gamme de sélection à la nouvelle position

source: Move cursor forward one character, adjusting the rectangular selection range to new position
de: Cursor ein Zeichen vorwärts bewegen und den rechteckigen Auswahlbereich an die neue Position anpassen
fr: Déplacer le curseur un caractère en avant, en ajustant la gamme de sélection rectangulaire à la nouvelle position

source: Move cursor backward one character
de: Cursor ein Zeichen zurück bewegen
fr: Déplacer le curseur un caractère en arrière

source: Move cursor backward one character, adjusting the selection range to new position
de: Cursor ein Zeichen zurück bewegen und den Auswahlbereich an die neue Position anpassen
fr: Déplacer le curseur un caractère en arrière, en ajustant la gamme de sélection à la nouvelle position

source: Move cursor backward one character, adjusting the rectangular selection range to new position
de: Cursor ein Zeichen zurück bewegen und den rechteckigen Auswahlbereich an die neue Position anpassen
fr: Déplacer le curseur un caractère en arrière, en ajustant la gamme de sélection rectangulaire à la nouvelle position

source: Move cursor forward one word. Optionally, provide a string that contains the delimiters to define which characters are part of a word. Gravity may be "start" or "end" to indicate whether cursor is placed at start or end of the word.
de: Cursor ein Wort vorwärts bewegen. Optional kann eine Zeichenkette festgelegt werden, welche die Abgrenzer enthält, die definieren, welche Zeichen Teil eines Worts sind. Mögliche Einstellungen sind "start" oder "end", um anzugeben, ob der Cursor am Beginn oder Ende eines Worts platziert werden soll.
fr: Déplacer le curseur en avant d'un mot. optionellement, fourni une chaine qui contient les délimiteurs qui définissent quels caractères font partis d'un mot. La gravité peut être "start" ou "end" pour indiquer si le curseur est placé au début ou à la fin du mot.

source: Move cursor forward one word, adjusting the selection range to new position. Optionally, provide a string that contains the delimiters to define which characters are part of a word. Gravity may be "start" or "end" to indicate whether cursor is placed at start or end of the word.
fr: Déplacer le curseur en avant d'un mot, ajustant la gamme de la sélection à une nouvelle position. optionellement, fourni une chaine qui contient les délimiteurs qui définissent quels caractères font partis d'un mot. La gravité peut être "start" ou "end" pour indiquer si le curseur est placé au début ou à la fin du mot.

source: Move cursor backward one word. Optionally, provide a string that contains the delimiters to define which characters are part of a word. Gravity may be "start" or "end" to indicate whether cursor is placed at start or end of the word.
de: Cursor ein Wort zurück bewegen. Optional kann eine Zeichenkette festgelegt werden, welche die Abgrenzer enthält, die definieren, welche Zeichen Teil eines Worts sind. Mögliche Einstellungen sind "start" oder "end", um anzugeben, ob der Cursor am Beginn oder Ende eines Worts platziert werden soll.
fr: Déplacer le curseur en arrière d'un mot. optionellement, fourni une chaine qui contient les délimiteurs qui définissent quels caractères font partis d'un mot. La gravité peut être "start" ou "end" pour indiquer si le curseur est placé au début ou à la fin du mot.

source: Move cursor backward one word, adjusting the selection range to new position. Optionally, provide a string that contains the delimiters to define which characters are part of a word. Gravity may be "start" or "end" to indicate whether cursor is placed at start or end of the word.
de: Cursor ein Wort zurück bewegen und den Auswahlbereich an die neue Position anpassen. Optional kann eine Zeichenkette festgelegt werden, welche die Abgrenzer enthält, die definieren, welche Zeichen Teil eines Worts sind. Mögliche Einstellungen sind "start" oder "end", um anzugeben, ob der Cursor am Beginn oder Ende eines Worts platziert werden soll.
fr: Déplacer le curseur en arrière d'un mot, ajustant la gamme de la sélection à une nouvelle position. optionellement, fourni une chaine qui contient les délimiteurs qui définissent quels caractères font partis d'un mot. La gravité peut être "start" ou "end" pour indiquer si le curseur est placé au début ou à la fin du mot.

source: Move cursor forward one paragraph (to next all-whitespace line).
de: Cursor einen Paragraph vorwärts bewegen (zur nächsten Zeile, die nur Leerräume enthält).
fr: Déplacer le curseur en avant d'un paragraphe (à la ligne que-des-espaces suivante).

source: Move cursor forward one paragraph (to next all-whitespace line), adjusting the selection range to new position.
de: Cursor einen Paragraph vorwärts bewegen (zur nächsten Zeile, die nur Leerräume enthält) und den Auswahllbereich an die neue Position anpassen.
fr: Déplacer le curseur en avant d'un paragraphe (à la ligne que-des-espaces, suivante), en ajustant la gamme de sélection à la nouvelle position.

source: Move cursor backward one paragraph (to next all-whitespace line).
de: Cursor einen Paragraph zurück bewegen (zur nächsten Zeile, die nur Leerräume enthält).
fr: Déplacer le curseur en arrière d'un paragraphe (à la ligne que-des-espaces suivante).

source: Move cursor backward one paragraph (to next all-whitespace line), adjusting the selection range to new position.
de: Cursor einen Paragraph zurück bewegen (zur nächsten Zeile, die nur Leerräume enthält) und den Auswahllbereich an die neue Position anpassen.
fr: Déplacer le curseur en avant d'un paragraphe (à la ligne que-des-espaces, suivante), en ajustant la gamme de sélection à la nouvelle position.

source: Move cursor forward one page
de: Cursor eine Seite vorwärts bewegen
fr: Déplacer le curseur d'une page en avant

source: Move cursor forward one page, adjusting the selection range to new position
de: Cursor eine Seite vorwärts bewegen und den Auswahllbereich an die neue Position anpassen
fr: Déplacer le curseur d'une page en avant, en ajustant la gamme de sélection à la nouvelle position

source: Move cursor backward one page
de: Cursor eine Seite zurück bewegen
fr: Déplacer le curseur d'une page en arrière

source: Move cursor backward one page, adjusting the selection range to new position
de: Cursor eine Seite zurück bewegen und den Auswahllbereich an die neue Position anpassen
fr: Déplacer le curseur d'une page en arrière, en ajustant la gamme de sélection à la nouvelle position

source: Move cursor to start of document
de: Cursor zum Anfang des Dokuments bewegen
fr: Déplacer le curseur au début du document

source: Move cursor to start of document, adjusting the selection range to new position
de: Cursor zum Anfang des Dokuments bewegen und den Auswahllbereich an die neue Position anpassen
fr: Déplacer le curseur au début du document, en ajustant la gamme de sélection à la nouvelle position

source: Move cursor to end of document
de: Cursor zum Ende des Dokuments bewegen
fr: Déplacer le curseur à la fin du document

source: Move cursor to end of document, adjusting the selection range to new position
de: Cursor zum Ende des Dokuments bewegen und den Auswahllbereich an die neue Position anpassen
fr: Déplacer le curseur à la fin du document, en ajustant la gamme de sélection à la nouvelle position

source: Clear any pending move command action, as for VI mode
fr: Effacter toute action de commande de déplacement en attente, comme en mode VI

source: Delete one character in front of the cursor
de: Ein Zeichen vor dem Cursor löschen
fr: Supprime un caractère en avant du curseur

source: Delete one character in front of the cursor unless at end of line, in which case delete backward. Do nothing if the line is empty. This is VI style 'x' in browser mode.
fr: Supprime un caractère en avant du curseur sauf à la fin de la ligne, auquel cas cela supprime un caractère en arrière. Ne rien faire si la ligne est vide. C'est le style VI 'x' en mode explorateur.

source: Delete one char in front of the cursor and enter insert mode (when working in modal key bindings)
de: Ein Zeichen vor dem Cursor löschen und in Einfügemodus gehen (wenn Sie mit modalen Tastaturbefehlen arbeiten)
fr: Supprime un caractère en avant du curseur et entre le mode insertion (lors du travail en raccourci clavier modal)

source: Delete one word in front of the cursor
de: Ein Wort vor dem Cursor löschen
fr: Supprime un mot en avant du curseur

source: Delete one word in front of the cursor and enter insert mode (when working in modal key bindings)
de: Ein Wort vor dem Cursor löschen und in Einfügemodus gehen (wenn Sie mit modalen Tastaturbefehlen arbeiten)
fr: Supprime un mot en avant du curseur et entre le mode insertion (lors du travail en raccourci clavier modal)

source: Delete one character behind the cursor, or the current selection if not empty.
de: Ein Zeichen nach dem Cursor oder die aktuelle Auswahl löschen wenn nicht leer.
fr: Supprime un caractère à l'arrière du curseur, ou de la sélection courante si elle n'est pas nulle

source: Delete one word behind of the cursor
de: Ein Wort hinter dem Cursor löschen
fr: Supprime un mot à l'arrière du curseur

source: Delete the current line or lines when the selection spans multiple lines or given repeat is > 1
de: Die aktuelle Zeile oder Zeilen löschen, wenn die Auswahl mehrere Zeilen umfasst oder die angegebene Wiederholung > 1 ist
fr: Supprimer la ligne ou les lignes actuelles quand la sélection s'étend sur de multiples lignes ou que le repeat donné est > 1

source: Delete the current line or lines when the selection spans multiple lines or given repeat is > 1. Enters insert mode (when working with modal key bindings).
de: Die aktuelle Zeile oder Zeilen löschen, wenn die Auswahl mehrere Zeilen umfasst oder die angegebene Wiederholung > 1 ist. Geht in den Einfügemodus (wenn Sie mit modalen Tastaturbefehlen arbeiten).
fr: Supprimer la ligne ou les lignes actuelles quand la sélection s'étend sur de multiples lignes ou que le repeat donné est > 1. Entre en mode insertion (lors de travail avec des raccourcis clavier de touches modaux).

source: Delete everything between the cursor and start of line
de: Alles zwischen dem Cursor und dem Zeilenanfang löschen
fr: Supprimer tout entre le curseur et le début de la ligne

source: Delete everything between the cursor and end of line
de: Alles zwischen dem Cursor und dem Zeilenende löschen
fr: Supprimer tout entre le curseur et la fin de la ligne

source: Delete everything between the cursor and end of line and enter insert move (when working in a modal editor key binding)
de: Alles zwischen dem Cursor und dem Zeilenende löschen und in den Einfügemodus gehen (wenn Sie mit Tastaturbefehlen eines modalen Editors arbeiten)
fr: Tout supprimer entre le curseur et la fin de la ligne et entrer un mouvement d'insertion (lors d'un travail dans un raccourci clavier d'éditeur modal)

source: Delete the text covered by the next cursor move command.
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, löschen.
fr: Supprimer le texte couvert par la prochaine commande de déplacement du curseur.

source: Delete the text covered by the next cursor move command and then enter insert mode (when working in a modal editor key binding)
de: Text, der mit der nächsten Cursor-Bewegung eingeschlossen wird, löschen und dann in den Einfügemodus gehen (wenn Sie mit Tastaturbefehlen eines modalen Editors arbeiten)
fr: Supprimer le texte couvert par la prochaine commande de déplacement du curseur et entrer en mode insertion (lors du travail en raccourci clavier modal)

source: Duplicate the current line or lines. Places the duplicate on the line following the selection if pos is 'below' or before the selection if it is 'above'.
fr: Dupliquer la ou les lignes actuelles. Place la copie sur la ligne suivant la sélection si pos est 'below' ou avant la sélection si c'est 'above'.
