Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_cache.po
Languages: de, ru

source: Failed to read %s: %s
ru: Не удалось прочитать %s: %s

source: Could not read file due to remote agent abort
de: Datei konnte nicht gelesen werden durch einen Abbruch des Remote-Agenten
ru: Не удалось прочитать файл из-за прерывания удаленного агента

source: Codec not found
de: Codec nicht gefunden
ru: Кодек не найден

source: Could not convert file %s when reading it -- the codec for the '%s' text encoding could not be found. Trying default encoding '%s' instead.
de: Konnte Datei %s nicht umwandeln - der Codec für Text Kodierung '%s' wurde nicht gefunden. Standardkodierung '%s' wird statt dessen versucht.
ru: Не удалось преобразовать файл %s при его чтении -- кодек для текстовой кодировки '%s' не найден. Вместо этого используется Кодировка по умолчанию '%s'.

source: Could not convert from encoding
de: Konnte nicht von der Kodierung umwandeln
ru: Не удалось преобразовать из кодировки

source: Could not convert all characters in %s when reading it as a %s encoded file. Replacing unmappable characters with ?'s so saving the file may result in a corrupted file. You may want to right click on the file and set encoding in the file's properties, or reopen it after changing the Files / Default Encoding preference.
de: Es konnten nicht alle Zeichen in %s umgewandelt werden, während die Datei als %s kodierte Datei gelesen wurde. Nicht übersetzbare Zeichen werden durch ? ersetzt - das Speichern der Datei kann daher zu einer beschädigten Datei führen. Sie sollten vielleicht in Erwägung ziehen, in den Dateieigenschaften (Rechtsklick) die Datei-Kodierung zu setzen oder die Einstellung Dateien / Standard-Kodierung anzupassen und dann die Datei erneut zu öffnen.
ru: Не удалось преобразовать все символы в %s при чтении файла в кодировке %s. Неприменимые символы заменены на ?. Таким образом, сохранение файла может привести к повреждению файла. Вы можете щелкнуть правой кнопкой мыши на файле и установить кодировку в свойствах файла, или открыть его после изменения исправив в предпочтениях Файлы/Кодировка по умолчанию.

source: Could not convert any characters in file
de: Es konnten keine Zeichen in der Datei umgewandelt werden
ru: Не удалось преобразовать символы в файле

source: Failed to convert any characters in %s when reading it as a %s encoded file. Reading it as a latin-1 encoded file instead which will probably result in the wrong characters being displayed. You probably want to right click on the file and set encoding in the file's properties, or reopen it after changing the Files / Default Encoding preference.
de: Es konnten nicht alle Zeichen in %s umgewandelt werden, während die Datei als %s kodierte Datei gelesen wurde. Die Datei wird statt dessen als Latin-1 kodierte Datei eingelesen, was vermutlich zur Darstellung von falschen Zeichen führt. Sie sollten vielleicht in Erwägung ziehen, in den Dateieigenschaften (Rechtsklick) die Datei-Kodierung zu setzen oder die Einstellung Dateien / Standard-Kodierung anzupassen und dann die Datei erneut zu öffnen.
ru: Не удалось преобразовать символы в %s при чтении файла в кодировке %s. Был прочитан, как файл закодированный latin-1, что, вероятно, приведет к неправильному отображению символов. Можете щелкнуть правой кнопкой мыши на файле и установить кодировку в свойствах файла или снова открыть его после изменения предпочтения Файлы/Кодировка по умолчанию.

source: Could not read file
de: Datei konnte nicht gelesen werden
ru: Не удалось прочитать файл

source: Read failed because characters could not be read in %s when reading it as a %s encoded file.
de: Das Lesen ist fehlgeschlagen, da die Zeichen in %s beim Einlesen als %s kodierte Datei nicht gelesen werden konnten.
ru: Ошибка чтения из-за невозможности чтения символов в %s при чтении файла в кодировке %s.

source: Unsupported encoding '%s' found in encoding comment -- Wing cannot write this file until the comment is changed
de: Nicht unterstützte Kodierung '%s' wurde im Kommentar gefunden -- Wing kann die Datei nicht speichern, bis die Kodierung im Kommentar geändert wurde
ru: Неподдерживаемая Кодировка '%s' найдена в encoding comment -- Wing не может записать этот файл, пока комментарий не будет изменен

source: Could not convert text "%s" on line %d to the %s encoding
de: Konnte den Text "%s" in Zeile %d nicht in die Kodierung %s umwandeln
ru: Не удалось преобразовать текст '%s' в строке %d в кодировку %s

source: Could not convert file contents to the %s encoding
de: Konnte die Dateiinhalte nicht in die Kodierung %s umwandeln
ru: Не удалось преобразовать содержимое файла в кодировку %s

source: General write error
de: Allgemeiner Schreibfehler
ru: Общая ошибка записи

source: Encoding of %s changed to %s
de: Die Kodierung von %s wurde in %s geändert
ru: Кодировка %s изменена на %s
