Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_pysource.po
Languages: fr, ru

source: Analyze main file for sys.path changes
fr: Analyser le fichier principal pour des modifications de sys.path
ru: Анализ основного файла для изменения sys.path

source: Inconsistent indentation (not in units of indent size)
fr: Indentation inconsistente (pas en unités de taille d'indent)
ru: Несогласованный отступ (не в единицах отступов)

source: This code will never be reached
fr: Ce code ne sera jamais atteint
ru: Этот код никогда не будет связан

source: Expected indentation to decrease
fr: Diminution de l'indentation attendue
ru: Ожидаемый отступ для уменьшения

source: Expected indentation to increase
fr: Augmentation de l'indentation attendue
ru: Ожидаемый отступ для увеличения

source: Unexpected indentation decrease
fr: Diminution de l'indentation inattendue
ru: Неожиданное уменьшение отступов

source: Unexpected indentation increase
fr: Augmentation de l'indentation inattendue
ru: Неожиданное увеличение отступа

source: Bad indentation level
fr: Mauvais niveau d'identation
ru: Плохой уровень отступов

source: Indentation error (unspecified)
fr: Erreur d'indentation (non spécifiée)
ru: Ошибка отступов (неуказанная)

source: Scrape errors for %s: %s
fr: Erreurs de lecture des infos internes pour %s : %s
ru: Очистка ошибок для %s: %s

source: %s does not exist (scrape failed)
fr: %s n'existe pas (lecture des infos internes échouée)
ru: %s не существует (ошибка очистки)

source: %s is empty (scrape failed; removing file now)
fr: %s est vide (lecture des infos internes échouée ; enlever le fichier maintenant)
ru: %s пусто (ошибка очистки; удаление файла)

source: Scraping %s
fr: Lecture des infos internes de %s
ru: Очистка %s

source: Failed to scrape extension module %s: Python not found
fr: Échec de lecture des infos internes du module d'extension %s : Python non trouvé
ru: Не удалось очистить модуль расширения %s: Python не найден

source: Failed to start process to scrape extension module %s: could not find suitable rundir
fr: Échec du démarrage du processus de lecture des infos internes du module d'extension %s : n'a pas pu trouvé un rundir adéquat
ru: Не удалось запустить процесс очистки модуля расширения %s: не удалось найти подходящий rundir

source: Failed to start process to scrape extension module %s
fr: Échec du démarrage du processus de lecture des infos internes du module d'extension %s
ru: Не удалось запустить процесс очистки модуля расширения %s

source: Failed scraping API for %s
fr: Échec de lecture des infos internes de l'API pour %s
ru: Ошибка очистки API для %s

source: API scraping process for %s completed
fr: Processus de lecture des infos internes de l'API pour %s terminé
ru: Процесс очистки API для %s завершен

source: Failed to start process to scrape extension module %s: cannot encode arguments
fr: Échec du démarrage du processus de lecture des infos internes du module d'extension %s : n'a pas pu encoder les arguments
ru: Не удалось запустить процесс очистки модуля расширения %s: cannot encode arguments

source: Cache file is %s
fr: Le fichier de cache est %s
ru: Файл кэша %s

source: Path to search for interface files for extension modules. If directory name is relative, it will be interpreted as relative to the user settings directory (%s)
fr: Chemin pour chercher les fichiers d'interface pour les modules d'extension. Si le nom du répertoire est relatif, il sera interprêté comme relatif au répertoire des préférences utilisateur (%s)
ru: Путь для поиска файлов интерфейса модулей расширений. Если имя каталога относительное, оно будет интерпретироваться как относительное к каталогу пользовательских настроек (%s)

source: Whether Wing should try to analyze python source in the background.
fr: Wing essaye d'analyser les sources python en tâche de fond.
ru: Должен ли Wing попытаться проанализировать источник python в фоновом режиме.

source: The maximum size of the disk cache in megabytes
fr: Taille maximum du cache disque en mégaoctets
ru: Максимальный размер дискового кэша в мегабайтах

source: Clear cache
fr: Vider le cache
ru: Очистить кэш

source: Clear cache files and re-analyse all source code
fr: Nettoyer les fichiers de cache et ré-analyser tout le code source
ru: Очистить кэш-файлы и повторно проанализировать весь исходный код

source: The maximum # of analysis info buffers that can be in-memory at once for files that are not open.
fr: Nombre maximum d'analyses de tampons d'information qui peuvent être en mémoire simultanément pour les fichiers qui ne sont pas ouverts.
ru: Максимальное число буферов данных анализа, которые могут находиться в памяти одновременно для файлов, которые не открыты.

source: Enable to automatically load and introspect extension modules and other modules that cannot be statically analysed. These modules are loaded in another process space and 'scraped' to obtain at least some analysis of the module's contents.
fr: Activer pour charger automatiquement et introspecter des modules d'extension et d'autre modules qui ne peuvent pas être analysés statiquement. Ces modules sont chargés dans un autre espace de process et 'scrappés' pour obtenir au moins quelqu'analyse des contenus du module.
ru: Позволяют автоматически загружать и интроспектировать модули расширения и другие модули, которые не могут быть статически проанализированы. Эти модули загружаются в другое пространство процесса и "выскабливаются", чтобы получить хотя бы некоторый анализ содержимого модуля.

source: This is a dictionary from module name to Python code that should be executed before attempting to load extension modules for scraping. This is needed in cases where the extension modules are designed to be loaded only after some configuration magic is performed. For most extension modules, no extra configuration should be needed.
fr: C'est un dictionnaire du nom de module au code Python qui devrait être exécuté avant de tenter de charger les modules d'extension pour lire leurs infos internes. C'est nécessaire dans des cas où les modules d'extension sont conçus pour être chargés seulement après que quelque magie de configuration soit effectuée. Pour la plupart des modules d'extension, aucune configuration supplémentaire ne devrait être nécessaire.
ru: Это словарь из имени модуля в Код Python, который должен быть выполнен перед попыткой загрузки модулей расширения для scraping. Это необходимо в тех случаях, когда модули расширения предназначены для загрузки только после выполнения некоторой магии конфигурации. Для большинства модулей расширения Дополнительная настройка не требуется.

source: Configuration Code
fr: Code de configuration
ru: Код конфигурации

source: Module Name
fr: Nom du module
ru: Имя модуля

source: Use slower, dotfile locking for sqllite databases to work around buggy remote file servers. Only needed if the user cache directory is on a remote file system or can be accessed via a remote file system. It is recommended that the user cache directory be on the local file system for performance reasons.
ru: Используйте медленную блокировку dotfile для баз данных sqllite, чтобы обойти багги удаленных файловых серверов. Требуется только в том случае, если каталог кэша пользователя находится в удаленной файловой системе или доступен через удаленную файловую систему. По соображениям производительности рекомендуется, чтобы каталог кэша пользователя находился в локальной файловой системе.

source: Prefix for Python Standard Library Documentation. This should be in the form https://docs.python.org/library/ and Wing will append module and symbol specific to the given URL. To use locally stored documentation, you must run a local web server since # bookmarks do not work in file: URLs.
ru: Префикс для документации стандартной библиотеки Python. Это должно быть в форме https://docs.python.org/library / и Wing будет добавлять модуль и символ, специфичные для данного URL. Чтобы использовать локально сохраненную документацию, необходимо запустить локальный веб-сервер, так как # закладки не работают в File: URLs.

source: Use docs.python.org
fr: Utiliser docs.python.org
ru: Использовать docs.python.org

source: Other:
fr: Autre :
ru: Другие:

source: class
fr: classe
