Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_search.po
Languages: de, fr, ru

source: _Text Search
de: _Textsuche
fr: Recherche de _texte
ru: Поиск текста

source: Wi_ldcard Search
de: Wi_ldcard-Suche
fr: Recherche avec joker
ru: Поиск По Шаблону

source: Rege_x Search
de: _Regex-Suche
fr: Recherche avec expressions régulières
ru: Поиск Регулярных Выражений

source: _Search:
de: _Suche:
fr: Chercher :
ru: Найти:

source: Rep_lace:
de: Ersetzen:
fr: Remplacer :
ru: Заменить:

source: Wrapped Search Failed
de: Umgebrochene Suche fehlgeschlagen
fr: Échec de recherche emballée
ru: Скрытый поиск завершен

source: Re_gex Flags
fr: Drapeaux d'expressions régulières
ru: Флаги Regex

source: Replace _All
de: _Alle ersetzen
fr: Tout _remplacer
ru: Заменить все

source: _Next
de: _Weiter
fr: Suivant
ru: Следующий

source: _Previous
de: _Vorherige
fr: Précédent
ru: Предыдущий

source: _Replace
de: E_rsetzen
fr: Remplacer
ru: Заменить

source: Clear
de: Leeren
fr: Effacer
ru: Очистить

source: Cut
de: Ausschneiden
fr: Couper
ru: Вырезать

source: Copy
de: Kopieren
fr: Copier
ru: Копировать

source: Paste
de: Einfügen
fr: Coller
ru: Вставить

source: Insert Newline (Ctrl-Enter)
de: Neue Zeile einfügen (Strg-Enter)
fr: Insérer une nouvelle ligne (Ctrl-Entrée)
ru: Вставить Новую строку (Ctrl-Enter)

source: Insert Line Feed
de: Zeilenvorschub einfügen
fr: Insérer un saut de ligne
ru: Вставить символ новой строки

source: Insert Carriage Return
de: Carriage Return einfügen
fr: Insérer un Retour Charriot
ru: Вставить символ возврата каретки

source: Insert Tab (Ctrl-T)
de: Tab einfügen (Strg-T)
fr: Insérer une tabulation (Ctrl-T)
ru: Вставить Tab (Ctrl-T)

source: Interpret Backslash Sequences
de: Backslash-Sequenzen interpretieren
fr: Interpréter les Séquences d'Antislash
ru: Интерпретировать Последовательность '\'

source: Expanded Entry Area
de: Erweiterter Eingabebereich
fr: Zone d'entrée développée
ru: Расширенная область ввода

source: All Files
de: Alle Dateien
fr: Tous les fichiers
ru: Все файлы

source: Create/Edit _Filters...
de: _Filter erstellen/bearbeiten...
fr: Créer/Éditer des Filtres...
ru: Создание/Редактирование фильтров...

source: Project Files
de: Projektdateien
fr: Fichiers de projet
ru: Файлы проекта

source: Current File
de: Aktuelle Datei
fr: Fichier actuel
ru: Текущий файл

source: All Open Files
de: Alle geöffneten Dateien
fr: Tous les fichiers ouverts
ru: Все открытые файлы

source: File Sets
fr: Ensembles de fichiers
ru: Набор файлов

source: Select directory to use
de: Zu verwendendes Verzeichnis auswählen
fr: Sélectionner le répertoire à utiliser
ru: Выберите каталог для использования

source: Select directory to search in
de: Verzeichnis für die Suche auswählen
fr: Sélectionner le répertoire où chercher
ru: Выберите каталог для поиска в

source: No open file
de: Keine geöffnete Datei
fr: Pas de fichier ouvert
ru: Нет открытого файла

source: Single Open File
de: Einzelne geöffnete Datei
fr: Un fichier ouvert
ru: Один открытый файл

source: Select Directory...
de: Verzeichnis auswählen...
fr: Sélectionner un répertoire...
ru: Выбрать каталог...

source: _Case sensitive
de: _Groß- und Kleinschreibung beachten
fr: Sensible à la casse
ru: Учитывать регистр

source: _Whole words
de: _Ganze Wörter
fr: Mots entiers
ru: Слова целиком

source: _Text search
de: _Textsuche
fr: Recherche de _texte
ru: Поиск текста

source: Wil_dcard search
de: Wi_ldcard-Suche
fr: Recherche avec joker
ru: Поиск по шаблону

source: Rege_x search
de: _Regex-Suche
fr: Recherche avec expressions régulières
ru: Поиск регулярных выражений

source: _Look in:
de: _Suchen in:
fr: Recherche dans :
ru: Заглянуть внутрь:

source: F_ilter:
fr: Filtre :
ru: Фильтр:

source: _Name Only
de: Nur _Name
fr: _Nom seulement
ru: Только Имя

source: _Window Title
de: _Fenstertitel
fr: _Titre de la fenêtre
ru: Название окна

source: _Full Path
de: _Vollständiger Pfad
fr: _Chemin complet
ru: Полный путь

source: _Group
de: _Gruppe
fr: _Groupe
ru: Группа

source: Replace Operates on Disk
de: Ersetzen arbeitet auf dem Laufwerk
fr: Remplacer opère sur le disque

source: Result File Na_me
de: Dateina_me des Ergebnisses
fr: Nom de Fi_chier du résultat
ru: Имя файла результата

source: Show Search T_ype In Tool
fr: Afficher le T_ype de recherche dans l'outil
ru: Показать тип поиска в утилите

source: Show _Replace
de: E_rsetzen anzeigen
fr: Afficher remplacer
ru: + Заменять

source: Find _After Replace
de: Suchen n_ach Ersetzen
fr: Trouver _après remplacer
ru: Искать после Замены

source: Rec_ursive Directory Search
de: Rek_ursive Verzeichnissuche
fr: Recherche récursive des répertoires
ru: Рекурсивный Поиск В Каталоге

source: File Set Name
de: Name der Dateigruppe
fr: Nom d’Ensemble de fichiers
ru: Имя Набора Файлов

source: The name under which to store the list of matching files
fr: Le nom sous lequel stocker la liste de fichiers correspondant
ru: Имя, под которым хранится список совпадающих файлов

source: Create File Set
de: Dateigruppe erstellen
fr: Créer un Ensemble de fichier
ru: Создать набор файлов

source: _Omit Binary Files
de: _Binärdateien auslassen
fr: _Omettre les fichiers binaires
ru: Пропускать двоичные файлы

source: Auto-re_start Searches
de: Suchen automatisch neu _starten
fr: Auto-re_démarrage des recherches
ru: Автоперезапуск поиска

source: Open _First Match
de: _Ersten Treffen öffnen
fr: Ouvrir la _première correspondance
ru: Открыть первое совпадение

source: Show Line _Numbers
de: Zeilen_nummern anzeigen
fr: Afficher les _numéros de lignes
ru: Показать номера строк

source: Copy Results to Clipboard
de: Ergebnisse in die Zwischenablage kopieren
fr: Copier les résultats dans le presse-papier
ru: Скопировать результаты в буфер обмена

source: Name Result File Set
de: Benennen der Ergebnis-Dateigruppe
fr: Nommer un Ensemble de fichiers avec les résultats
ru: Имя Результирующего Набора Файлов

source: _Case Sensitive
de: _Groß- und Kleinschreibung beachten
fr: _Sensible à la casse
ru: Учитывать регистр

source: _Whole Words
de: _Ganze Wörter
fr: _Mots entiers
ru: Целые слова

source: Search in files state
de: In Dateizustand suchen
fr: État de recherche dans fichiers
ru: Поиск в файлах состояния

source: Line %s:
de: Zeile %s:
fr: Ligne %s :
ru: Строка %s:

source: %s, line %i:
de: %s, Zeile %i:
fr: %s, ligne %i :
ru: %s, строка %i:

source: File: %s
de: Datei: %s
fr: Fichier : %s
ru: Файл: %s

source: Wrapped
de: Umgebrochen
fr: Retour à la ligne effectué
ru: Обертка

source: %sFile: %s
de: %sDatei: %s
fr: %s Fichier : %s
ru: %sФайл: %s

source: Search Aborted
de: Suche abgebrochen
fr: Recherche annulée
ru: Поиск отменен

source: Directory does not exist: "%s"
de: Verzeichnis ist nicht vorhanden: "%s"
fr: Le répertoire n'existe pas : "%s"
ru: Каталог не существует: "%s"

source: Directory search not supported
de: Verzeichnissuche wird nicht unterstützt
fr: Recherche dans les répertoires non supportée
ru: Поиск по каталогу не поддерживается

source: Search Starting
de: Suche wird begonnen
fr: Lancement de la recherche
ru: Поиск Запуска

source: Found %i matches in %i files
de: Es wurden %i Treffer in %i Dateien gefunden
fr: %i résultat(s) trouvé(s) dans %i fichier(s)
ru: Найдено %i совпадений в %i файлах

source: Reading directory:
de: Lesen von Verzeichnis:
fr: Lecture du répertoire :
ru: Чтение каталога:

source: Searching remote files...
fr: Recherche dans les fichiers distants…
ru: Поиск удаленных файлов...

source: Scanning:
de: Durchsuchen:
fr: Scanne :
ru: Сканирование:

source: Search Paused
de: Suche angehalten
fr: Recherche en pause
ru: Поиск приостановлен

source: Search Continued
de: Suche fortgesetzt
fr: La recherche continue
ru: Искать дальше

source: No search string
de: Kein Suchstring
fr: Pas de chaîne en recherche
ru: Нет строки поиска

source: Could not replace: No previous search match
de: Konnte nicht ersetzen: Kein vorheriger Suchtreffer
fr: N'a pas pu remplacer : Aucune recherche précédente ne correspond
ru: Не удалось заменить: нет предыдущего совпадения

source: Failed to display editor for replace
de: Die Anzeige des Editors zum Ersetzen ist fehlgeschlagen.
fr: Échec d'affichage de l'éditeur pour remplacer
ru: Не удалось отобразить редактор для замены

source: You have configured Replace All to open all altered files into Wing. <strong>Note:</strong> This may open many editors and changes can only be undone within individual editors. Are you sure you want to do this?
de: Sie haben "Alle Ersetzen" so konfiguriert, dass alle geänderten Dateien in Wing geöffnet werden. <strong>Hinweis:</strong> Dies kann dazu führen, dass viele Editoren geöffnet werden und Änderungen können nur innerhalb der einzelnen Editoren rückgängig gemacht werden. Sind Sie sicher, dass Sie diese Einstellung möchten?
fr: Vous avez configuré Tout remplacer pour ouvrir tous les fichiers modifiés dans Wing. <strong>Note :</strong> Cela peut ouvrir plusieurs éditeurs et les modifications ne pourront être annulées que dans des éditeurs individuels. Êtes-vous sûr de vouloir faire cela ?
ru: Ваши настройки Заменить Все, приведут к открытию все изменяемых файлов в Wing. <strong>Примечание:</ strong> Это приведет к запуску нескольких редакторов, и изменения могут быть отменены только в отдельных редакторах. Вы уверены, что хотите это сделать?

source: You have configured Replace All to operate directly on disk files (already open files will be changed only within Wing and left unsaved). <strong>Note:</strong> Changes made on disk cannot be undone! Are you sure you want to do this?
de: Sie haben "Alle Ersetzen" so konfiguriert, dass es direkt an Dateien auf der Festplatte durchgeführt wird (bereits geöffnete Dateien werden nur in Wing geändert und bleiben ungespeichert). <strong>Hinweis:</strong> Änderungen, die auf der Festplatte vorgenommen werden, können nicht rückgängig gemacht werden! Sind Sie sicher, dass Sie diese Einstellung möchten?
fr: Vous avez configuré Tout remplacer pour opérer directement sur les fichiers du disque (les fichiers déjà ouverts seront seulement modifiés dans Wing et laissés non sauvegardés). <strong>Note :</strong> Les modifications faites sur le disque ne pourront pas être annulées ! Êtes-vous sûr de vouloir faire cela ?
ru: Ваши настройки Заменить Все предназначены для работы непосредственно с дисковыми файлами (уже открытые файлы будут изменены только внутри Wing и оставлены несохраненными). <strong>Примечание:</strong> Изменения, сделанные на диске, не могут быть отменены! Вы уверены, что хотите это сделать?

source: Confirm Replace All
de: Alle Ersetzen bestätigen
fr: Confirmation pour Tout remplacer
ru: Подтвердить Заменить Все

source: _Replace All
de: Alle E_rsetzen
fr: _Tout remplacer
ru: Заменить все

source: _Cancel
de: _Abbrechen
fr: _Annuler
ru: Отмена

source: Filter '%s' is invalid
de: Filter '%s' ist ungültig
fr: Le filtre '%s' est invalide
ru: Недопустимый фильтр '%s'

source: Warning: Replace All
de: Warnung: Alle Ersetzen
fr: Avertissement : Tout remplacer
ru: Предупреждение: Заменить Все

source: You have set Replace All to operate directly on disk files (already open files will be changed only within Wing until they are saved to disk). <strong>Note:</strong> Changes made on disk cannot be undone. To avoid data loss, we strongly recommend making backups of all your files, or using a revision control system.
de: Sie haben "Alle Ersetzen" so konfiguriert, dass es direkt an Dateien auf der Festplatte durchgeführt wird (bereits geöffnete Dateien werden nur in Wing geändert bis sie auf der Festplatte gespeichert werden). <strong>Hinweis:</strong> Änderungen, die auf der Festplatte vorgenommen werden, können nicht rückgängig gemacht werden! Wir empfehlen Ihnen dringend, Sicherheitskopien von allen Dateien anzufertigen oder ein Versionsverwaltungssystem zu verwenden, um Datenverluste zu vermeiden.
fr: Vous avez configuré Tout remplacer pour opérer directement sur les fichiers du disque (les fichiers déjà ouverts seront seulement modifiés dans Wing jusqu’à ce qu’il soient sauvegardés sur le disque). <strong>Note :</strong> Les modifications faites sur le disque ne pourront pas être annulées. Pour éviter toute perte de données, nous recommandons fortement de faire des copies de sauvegardes de tous vos fichiers, ou d'utiliser un système de contrôle de révision.
ru: Вы установили Заменить Все для работы непосредственно с файлами на диске (уже открытые файлы будут изменены только в пределах Wing, пока они не будут сохранены на диске). <strong>Примечание:</strong> Изменения, сделанные на диске, не могут быть отменены. Чтобы избежать потери данных, мы настоятельно рекомендуем делать резервные копии всех ваших файлов или использовать систему контроля версий.

source: You have set Replace All to open altered files into Wing. <strong>Note:</strong> Changes can be undone in individual editors and do not alter disk files until saved.
de: Sie haben "Alle Ersetzen" so konfiguriert, dass geänderte Dateien in Wing IDE geöffnet werden. <strong>Hinweis:</strong> Änderungen können in den einzelnen Editoren rückgängig gemacht werden und die Dateien auf der Festplatte erst dann geändert, wenn die Änderungen gespeichert werden.
fr: Vous avez configuré Tout remplacer pour ouvrir les fichiers modifiés dans Wing. <strong>Note :</strong> Les modifications faites pourront être annulées dans des éditeurs individuels et ne pas altérer les fichiers du disque jusqu'à ce qu'ils soient sauvegardés.
ru: Вы установили Заменить Все, чтобы открыть измененные файлы в Wing. <strong>Примечание:</strong> Изменения могут быть отменены в отдельных редакторах и не изменяют файлы на диске, пока не будут сохранены пользователем.

source: Search in Files
de: In Dateien suchen
fr: Chercher dans fichiers
ru: Поиск в файлах

source: Multiple File Search and Replace
de: Suchen und Ersetzen in mehreren Dateien
fr: Chercher dans plusieurs fichiers et remplacer
ru: Поиск и замена нескольких файлов

source: Possible match
de: Wahrscheinlicher Treffer
fr: Correspondance possible
ru: Возможные совпадения

source: Unlikely match
de: Unwahrscheinlicher Treffer
fr: Correspondance improbable
ru: Маловероятное совпадение

source: Whole file
de: Ganze Datei
fr: Fichier complet
ru: Весь файл

source: %s, line %s:
de: %s, Zeile %s:
fr: %s, ligne %s :
ru: %s, строка %s:

source: Searching...
de: Suchen...
fr: Recherche...
ru: Поиск...

source: Refresh
de: Aktualisieren
fr: Rafraîchir
ru: Обновить

source: Show Possible Uses
fr: Afficher les utilisations possibles
ru: Показать возможные способы использования

source: Show matches where either the match or the search symbol is undefined
fr: Afficher les correspondances dont la correspondance ou le symbole cherché est indéfini
ru: Показать совпадения, где символ совпадения или символ поиска не определен

source: Show Unlikely Uses
fr: Afficher les utilisations improbables
ru: Показать Маловероятное Использование

source: Show matches where definition of the match does not match the definition of the search symbol
fr: Afficher les correspondances dont les définitions ne correspondent pas à celles du symbole cherché
ru: Показывать совпадения, когда определение соответствия не соответствует определению символа поиска

source: Search Project Files
de: Projektdateien suchen
fr: Chercher dans les fichiers de projet
ru: Поиск файлов проекта

source: Search for uses in all Python files in the project
fr: Chercher les utilisations dans tous les fichiers Python dans le projet
ru: Искать во всех Python файлы в проекте

source: Search Original File
fr: Chercher dans le fichier Original
ru: Поиск исходного файла

source: Search for uses in the file where the symbol was selected
fr: Chercher les utilisations dans le fichier où le symbole était sélectionné
ru: Поиск использования в файле, где был выбран символ

source: Points of use
fr: Points d'utilisation
ru: Пункты использования

source: Uses of module
fr: Utilisations de module
ru: Использование модуля

source: Uses of
fr: Utilisations de
ru: Использование

source: All
fr: Tout

source: in %s
fr: dans %s

source: in Project Files
fr: dans fichiers de projet

source: Uses of module %s
fr: Utilisations du module %s
ru: Использование модуля %s

source: Uses of class %s (%s)
fr: Utilisations de la classe %s (%s)

source: Uses of method %s (%s)
fr: Utilisations de la méthode %s (%s)

source: Uses of function %s (%s)
fr: Utilisations de la fonction %s (%s)

source: Previous Match
de: Vorheriger Treffer
fr: Correspondance précédente
ru: Предыдущее совпадение

source: Next Match
de: Nächster Treffer
fr: Correspondance suivante
ru: Следующее совпадение

source: Select a symbol in an editor and use Find Points of Use in the Source menu
fr: Sélectionner un symbole dans un éditeur et utiliser trouver les points d'utilisation dans le menu source
ru: Выберите символ в редакторе и используйте «Найти точки использования» в меню «Источник».

source: Show Documentation
de: Dokumentation anzeigen
fr: Afficher la documentation
ru: Показать документацию

source: Uses
fr: Utilisations
ru: Использует

source: Points of Use
fr: Points d'utilisation
ru: Точки использования

source: _Interactive Search
de: _Interaktive Suche
fr: Recherche interactive
ru: Интерактивный поиск

source: _Batch Search Files
de: _Batch-Suche in Dateien
fr: _Grouper les fichiers de recherche
ru: Пакетный Поиск Файлов

source: Batch Search _Disk
de: Batch-Suche der _Festplatte
fr: Grouper _disque de recherche
ru: Пакетный поиск на диске

source: Batch Search D_ocumentation
de: Batch-Suche der D_okumentation
fr: Grouper la documentation de recherche
ru: Документация Пакетного Поиска

source: Interactive _Replace
de: Interaktives E_rsetzen
fr: _Remplacement interactif
ru: Интерактивное замещение

source: Batch Re_place Files
de: Batch-Er_setzen in Dateien
fr: Grouper les fichiers de remplacement
ru: Пакетная замена файлов

source: Batch Replace Dis_k
de: Batch-Ersetzen auf dem Laufwer_k
fr: Grouper le disque de remplacement
ru: Пакетная замена на диске

source: Search:
de: Suche:
fr: Chercher :
ru: Найти:

source: Replace:
de: Ersetzen:
fr: Remplacer :
ru: Заменить:

source: Failed to find editor for replace
de: Es wurde kein Editor für das Ersetzen gefunden.
fr: Échec pour trouver un éditeur pour remplacer
ru: Не удалось найти редактор для замены

source: Replace OK
de: Ersetzen OK
fr: Remplacement OK
ru: Заменить ОК

source: Replacing %s
de: %s wird ersetzt
fr: En cours de remplacement %s
ru: Замена %s

source: Replace Error: Could not read %s
fr: Erreur de remplacement : N'a pas pu lire %s
ru: Ошибка замены: не удалось прочитать %s

source: Replace Error: Could not convert %s to unicode
de: Fehler beim Ersetzen: %s konnte nicht in Unicode umgewandelt werden.
fr: Erreur de remplacement : N'a pas pu convertir %s vers unicode
ru: Ошибка замены :не удалось преобразовать %s в юникод

source: Replace Error: Could not write remote file %s
fr: Erreur de remplacement : N'a pas pu écrire le fichier distant %s
ru: Ошибка замены: не удалось записать удаленный файл %s

source: Replace Error: Could not convert replaced %s to output encoding
de: Fehler beim Ersetzen: Konnte die ersetzten %s nicht in die Ausgabe-Kodierung umwandeln.
fr: Erreur de remplacement : N'a pas pu convertir le remplacé %s vers l'encodage de sortie
ru: Ошибка замены: не удалось преобразовать замененный %s в кодировку вывода

source: Replace failed to open document %s
fr: Remplacement échoué pour ouvrir le document %s
ru: Не удалось открыть документ %s

source: Replaced %i matches in %s
de: Es wurden %i Treffer in %s ersetzt
fr: Remplacé %i correspondance(s) dans %s
ru: Заменено %i соответствий в %s

source: Replaced %i matches in %i files
de: Es wurden %i Treffer in %i Dateien ersetzt
fr: Remplacé %i correspondance(s) dans %i fichiers
ru: Заменено %i соответствий в %i файлах

source: Replaced %i matches in %i file
de: Es wurden %i Treffer in %i Datei ersetzt
fr: Remplacé %i correspondance(s) dans %i fichier
ru: Заменено %i соответствий в %i файле

source: Replace Paused
de: Ersetzen angehalten
fr: Remplacement en pause
ru: Замена приостановлена

source: Replace Continued
de: Ersetzen fortgesetzt
fr: Le remplacement continue
ru: Замена продолжена

source: Search manager state
de: Zustand des Suchmanagers
fr: État du gestionnaire de recherche
ru: Состояние диспетчера поиска

source: Skipping large file %s; size=%i; max=%i
fr: Saute le gros fichier %s ; taille=%i ; max=%i
ru: Пропустить большой файл %s; size=%i; max=%i

source: Could not open %s
fr: Ne peut pas ouvrir %s
ru: Не смог открыть %s

source: _In Selection
de: In Au_swahl
fr: Dans la _sélection
ru: В выборе

source: Wr_ap Search
de: Suche _umbrechen
fr: Recherche emballée
ru: Скрытый Поиск

source: _Incremental
de: _Inkremental
fr: _Incrémental
ru: Пошаговый

source: Could not replace all: no search string
de: Konnte nicht alle ersetzen: Kein Suchstring
fr: N'a pas pu tout remplacer : pas de chaîne de recherche
ru: Не удалось заменить все: нет строки поиска

source: Could not replace all: no active document
de: Konnte nicht alle ersetzen: Kein aktives Dokument
fr: N'a pas pu tout remplacer : pas de document actif
ru: Не удалось заменить все: нет активного документа

source: Could not replace: document is readonly
de: Konnte nicht ersetzen: Dokument ist nur lesbar
fr: N'a pas pu remplacer : document en lecture seule
ru: Не удалось заменить: документ доступен только для чтения

source: Search Successful
de: Suche erfolgreich
fr: Recherche réussie
ru: Успешный Поиск

source: Search Failed
de: Suche gescheitert
fr: Recherche échouée
ru: Поиск не выполнен

source: Search
de: Suchen
fr: Chercher
ru: Поиск

source: Interactive Search and Replace
de: Interaktives Suchen und Ersetzen
fr: Recherche et remplacement Interactifs
ru: Интерактивный Поиск и Замена

source: Pa_use
de: _Anhalten
ru: Пауза

source: _Options
de: _Optionen
ru: Опции

source: Documentation
de: Dokumentation
ru: Документация
