Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_pref.po
Languages: fr, ru

source: Serious error writing preferences file %s: File may be corrupted. Please report this problem to support@wingware.com
fr: Erreur sérieuse lors de l'écriture du fichier de préférences %s. Le fichier peut être corrompu. Veuillez transmettre ce problème à support@wingware.com
ru: Ошибка записи файла настроек %s: файл может быть поврежден. Пожалуйста, сообщите об этой проблеме support@wingware.com

source: Failed to write portions of preferences file to %s: Some preferences have been lost.
fr: Échec de l'écriture d'une partie du fichier de préférences %s. Plusieurs préférences ont été perdues.
ru: Не удалось записать часть файла настроек в %s: некоторые настройки были потеряны.

source: Please report this problem to support@wingware.com
fr: Veuillez transmettre ce problème à support@wingware.com
ru: Пожалуйста, сообщите об этой проблеме support@wingware.com

source: Ca_tegory
fr: Catégorie
ru: Категории

source: _Factory Defaults
fr: Valeurs par défaut
ru: Заводские установки

source: _Cancel
fr: Annuler
ru: Отмена

source: _Apply
fr: _Appliquer
ru: Применить

source: Preferences
fr: Préférences
ru: Параметры

source: General
fr: Général
ru: Главное

source: Really Clear Preferences?
fr: Vraiment effacer les préférences ?
ru: Действительно очистить настройки?

source: This command will clear your preferences file and restore the factory defaults. Are you sure you want to do this?
fr: Cette commande va effacer votre fichier de préférences et restaurer les valeurs d'usine par défaut. Êtes-vous sûr de vouloir cela ?
ru: Эта команда очистит ваш файл настроек и восстановит заводские настройки по умолчанию. Вы уверены, что хотите это сделать?

source: _Yes
fr: Oui
ru: _Да

source: _No
fr: _Non
ru: _Нет

source: Smart Tab End of Line Indents
ru: Поведение Tab в конеце строки

source: Fallback to Mac OS key bindings
ru: Откат к привязкам клавиш Mac OS

source: Auto-wrap Arguments
ru: автоматический перенос аргументов

source: Orientation
ru: Ориентация

source: Introspect Live Runtime
ru: Самоанализ "живой" среды выполнения

source: Maximum Process Count
ru: Максимальное количество процессов

source: Flush I/O Periodically
ru: Периодический сброс I/O

source: Kill Externally Launched Processes
ru: Убить внешние запущенные процессы

source: Resolve Properties
ru: Разрешить свойства

source: Call Python ____repr____ Methods
ru: Вызов Python ____repr____ Методы

source: When Build Fails
ru: При сбое сборки

source: Show Breaks Moved Dialog
ru: Показывать диалог отчета об ошибке

source: Close Connection on Timeout
ru: Закрыть соединение по таймауту

source: Hung Connection Timeout
ru: Время ожидания соединения

source: Occurrences
ru: Экземпляры

source: Indentation
ru: Отступ

source: Perspectives
ru: Перспективы

source: Exceptions
ru: Исключения

source: Diagnostics
ru: Диагностика
