Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_wingide_topcommands.po
Languages: de, fr

source: A non-empty directory %s already exists. Please remove it or select another location.
de: Eine nicht-leeres Verzeichnis %s existiert bereits. Bitte entfernen Sie es oder wählen ein anderes Verzeichnis.
fr: Un répertoire non vide %s existe déjà. Veuillez le retirer ou sélectionner un autre emplacement.

source: Unable to create directory %s. Please check disk permissions.
fr: Incapable de créer le répertoire %s. Veuillez vérifier les permissions du disque.

source: Unable to copy all of directory %s. Please check disk permissions and free space.
fr: N’a pas réussi à copier tout le répertoire %s. Veuillez vérifier les permissions du disque et l’espace libre.

source: Tutorial copied
de: Tutorial wurde kopiert
fr: Tutoriel copié

source: Tutorial was copied to %s
de: Tutorial wurde in %s kopiert
fr: Le tutoriel a été copié vers %s

source: Choose Target Folder
de: Wählen Sie den Ziel Ordner aus
fr: Choisissez le répertoire cible

source: Please select a target folder to which to copy the tutorial files
de: Bitte wählen Sie einen Ordner, in den die Source-Dateien des Tutorials kopiert werden sollen.
fr: Veuillez sélectionner le répertoire cible où copier les fichiers du tutoriel

source: Show the contents of all non-empty text registers in a temporary editor
de: Die Inhalte aller nicht-leeren Textregister in einem vorübergehenden Editor anzeigen
fr: Afficher les contenus de tous les registres non-vides de texte dans un éditeur temporaire

source: Utility to get current editor
de: Werkzeug, um aktuellen Editor zu holen
fr: Utilitaire pour obtenir l'éditeur actuel

source: Set Named Bookmark
de: Benanntes Lesezeichen setzen
fr: Affecter un signet nommé

source: The project-wide name of the bookmark to set or replace.
fr: Le nom de l'ensemble du projet du signet à établir ou remplacer.

source: Name:
fr: Nom :

source: Remove bookmark at current line, if any. This command is only available if there is a bookmark on the line.
fr: Enlever le signet à la ligne actuelle, si existant. Cette commande est seulement disponible si il y a un signet sur la ligne.

source: Goto named bookmark
de: Zum benannten Lesezeichen gehen
fr: Aller au signet nommé

source: Bookmark
de: Lesezeichen
fr: Signet

source: Bookmark:
de: Lesezeichen:
fr: Signet :

source: Show a list of all currently defined bookmarks
de: Liste aller zurzeit definierten Lesezeichen anzeigen
fr: Afficher une liste de tous les signets actuellement définis

source: Export File:
fr: Exporter le fichier :

source: Import File:
fr: Importer le fichier :

source: Returns list of menu items for selecting among defined bookmarks
fr: Retourne une liste d'éléments du menu pour sélectionner parmi les signets définis

source: Set a bookmark at current location on the editor using the next key press as the name of the bookmark.
de: Ein Lesezeichen am aktuellen Ort im Editor setzen. Dabei soll der nächste Tastenanschlag als Name des Lesezeichens verwendet werden.
fr: Établir un signet à l'emplacement actuel dans l'éditeur en utilisant la prochaine pression de touche comme le nom du signet.

source: Goto bookmark using single character name defined by the next pressed key
de: Zum Lesezeichen gehen; dabei einen Namen mit einem einzelnen Zeichen verwenden, der durch den nächsten Tastenanschlag definiert wird
fr: Aller au signet en utilisant un seul nom de caractère défini par la prochaine touche pressée

source: Restore the given named perspective.
de: Das angegebene benannte Perspektive wiederherstellen.
fr: Restaurer la perspective nommée donnée.

source: Invalid Perspective::The perspective '%s' does not exist
de: Ungültige Perspektive::Die Perspektive '%s' existiert nicht
fr: Perspective invalide::La perspective '%s' n'existe pas

source: Display the perspectives manager dialog
de: Den Perspektiven-Manager Dialog anzeigen
fr: Afficher la boîte de dialogue du gestionnaire de perspectives

source: Enable auto-perspectives
de: Auto-Perspektiven aktivieren
fr: Activer les auto-perspectives

source: Disable auto-perspectives
de: Auto-Perspektiven deaktivieren
fr: Désactiver les auto-perspectives

source: Load the given named file set
de: Die angegebene benannte Dateigruppe laden
fr: Charge l’ensemble de fichiers nommé donné

source: Invalid File Set::The named file set '%s' does not exist
de: Ungültige Dateigruppe::Die benannte Dateigruppe '%s' ist nicht vorhanden
fr: Ensemble de fichier invalide::L’ensemble de fichier nommé '%s' n'existe pas

source: Display the file set manager dialog
de: Dateigruppen-Manager Dialog anzeigen
fr: Afficher la boîte de dialogue du gestionnaire d’ensemble de fichiers

source: Create a new named file set with the currently open files
de: Erstellen einer neuen benannten Dateigruppe aus den momentan geöffneten Dateien
fr: Crée un nouvel ensemble de fichiers nommés avec les fichiers ouverts actuellement

source: Create a new named file set with the currently selected files
de: Erstellen einer neuen benannten Dateigruppe aus den momentan ausgewählten Dateien
fr: Crée un nouvel ensemble de fichiers nommés avec les fichiers sélectionnés actuellement

source: Enter a new license code, replacing any existing license activation
de: Einen neuen Lizenzcode eingeben und dabei alle vorhanden Lizenzaktivierungen überschreiben
fr: Entrer un nouveau code de licence, remplacant toute activation de licence existante

source: Commands to dynamically generate menu items for the top level menus.
de: Befehle, um Menüeintrage für die Top-Level Menüs dynamisch zu erzeugen.
fr: Commandes pour générer dynamiquement les éléments du menu pour les menus de haut niveau.

source: Returns list of menu item definitions for all windows.
de: Gibt Liste der Definitionen der Menüeinträge für alle Fenster aus.
fr: Retourne la liste des définitions des éléments des menus pour toutes les fenêtres.

source: Untitled
de: Unbenannt
fr: Sans titre

source: Buy Now
de: Jetzt kaufen
fr: Acheter maintenant

source: Upgrade to Commercial Use Now
de: Jetzt auf kommerzielle Nutzung upgraden
fr: Mettre à niveau vers une utilisation commerciale maintenant

source: Enter License...
de: Lizenz eingeben...
fr: Entrer la Licence...

source: Returns list of menu item definitions for all documents in active window.
de: Gibt Liste der Definitionen der Menüeinträge für alle Dokumente im aktiven Fenster aus.
fr: Retourne une liste des définitions des éléments du menu pour tous les documents de la fenêtre active.

source: Wing Help
de: Wing Hilfe
fr: Aide Wing

source: Debug loc; used to implement recent menu.
de: Debug loc, verwendet, um das letzte Menü zu implementieren.
fr: Debug loc ; utilisé pour implémenter le menu récent.

source: Generates list of menu items for recent files menu.
de: Erzeugt eine Liste der Menüeinträge für das Menü Letzte Dateien.
fr: Génère une liste des éléments du menu pour le menu des fichiers récents.

source: Generates list of menu items for recent projects menu.
de: Erzeugt eine Liste der Menüeinträge für das Menü Letzte Projekte.
fr: Génère une liste des éléments du menu pour le menu de projets récent.

source: Generates list of menu items for recent debug menu.
de: Erzeugt eine Liste der Menüeinträge für das Menü Letzte Debuggen.
fr: Génère une liste des éléments du menu pour le menu de débogage récent.

source: Generates a list of menu items for creating a new debug process, if multi-process debugging is enabled
fr: Génère une liste d'éléments du menu pour créer un nouveau process de débogage si le débogage multi-process est activé

source: Start _New Process
de: _Neuen Prozess starten
fr: Démarrer un nouveau process

source: Step _Into New Process
fr: Un pas dans un nouveau process

source: Run to C_ursor in New Process
fr: Exécuter jusqu’au curseur dans un nouveau process

source: _Continue All Processes
de: Alle Prozesse _fortsetzen
fr: Continuer tous les process

source: _Pause All Processes
de: Alle Prozesse _pausieren
fr: Mettre en pause tous les process

source: _Restart All Processes
de: Alle Prozesse _neu starten
fr: Redémarrer tous les process

source: _Kill All Processes
de: Alle Prozesse _töten
fr: Tuer tous les process

source: _Attach to Process...
de: An Prozess _anhängen...
fr: Attacher au process…

source: _Detach from Process
de: Von Prozess _trennen
fr: Détacher du process

source: Detach from A_ll Processes
fr: Détacher de tous les process

source: Pro_cesses
de: Pro_zesse
fr: Process

source: Generates list of menu items for named debug entry points.
de: Erzeugt eine Liste der Menüeinträge für benannte Debug Einsprungspunkte.
fr: Génère une liste d'éléments du menu pour les points d'entrée nommés de débogage.

source: Manage Named Entry Points...
de: Benannte Einsprungspunkte verwalten...
fr: Gestion des points d'entrée...

source: Execute loc; used to implement recent menu.
fr: Execute loc ; utilisé pour implémenter le menu récent.

source: Generates list of menu items to execute named entry points.
de: Erzeugt eine Liste der Menüeinträge für das Ausführen benannter Einsprungspunkte.
fr: Génère une liste des éléments du menu pour exécuter les points d'entrée nommés.

source: Create list of tool menu items. If new_window is True, commands attached to items will create new tool window.
de: Liste von Einträgen der Werkzeugleiste anlegen. Wenn new_window auf Wahr gesetzt ist, werden Befehle, die an Einträge angehängt sind, neue Werkzeugfenster anlegen.
fr: Créer une liste des éléments du menu d'outils. Si new_window est Vrai, les commandes attachées aux éléments créeront une nouvelle fenêtre d'outil.

source: Returns list of menu items for the tools menu.
de: Gibt Liste der Menüeinträge für das Werkzeugmenü aus.
fr: Retourne la liste des éléments pour le menu d'outils

source: Show _Horizontal Tool Area
de: _Waagerechten Werkzeugbereich anzeigen
fr: Afficher la zone d'outils _horizontale

source: Hide _Horizontal Tool Area
de: _Waagerechten Werkzeugbereich ausblenden
fr: Masquer la zone d'outils _horizontale

source: Show _Vertical Tool Area
de: _Senkrechten Werkzeugbereich anzeigen
fr: Afficher la zone d'outils _verticale

source: Hide _Vertical Tool Area
de: _Senkrechten Werkzeugbereich ausblenden
fr: Masquer la zone d'outils _verticale

source: _Move Vertical Tool Area to Right
de: Senkrechten Werkzeugbereich nach rechts _verschieben
fr: Déplacer la zone d’outils verticale à droite

source: _Move Vertical Tool Area to Left
de: Senkrechten Werkzeugbereich nach links _verschieben
fr: Déplacer la zone d’outils verticale à gauche

source: Ma_ximize Editor Area
de: Editor-Bereich m_aximieren
fr: Ma_ximiser la zone d'édition

source: Un-ma_ximize Editor Area
de: Ma_ximierung des Editor-Bereichs aufheben
fr: Dé-ma_ximiser la zone d'édition

source: Show Toolbar
de: Werkzeugleiste anzeigen
fr: Afficher la barre d'outils

source: Hide Toolbar
de: Werkzeugleiste ausblenden
fr: Masquer la barre d'outils

source: Create list of perspective menu items that call the given action with the perspective name
fr: Créer un liste des éléments du menu perspective qui appelent l'action donnée avec le nom de perspective

source: Returns list of menu items for setting current perspective
fr: Retourne une liste d'éléments du menu pour configurer la perspective actuelle

source: Returns list of menu items for deleting perspectives
fr: Retourne la liste des éléments du menu pour supprimer des perspectives

source: Returns list of menu items for selecting keyboard personality
fr: Retourne une liste d'éléments du menu pour sélectionner la personnalité du clavier

source: Generates list of menu items for all named file sets.
de: Erzeugt eine Liste von Menüeinträgen für alle benannten Dateigruppen.
fr: Génère une liste des éléments du menu pour tous les ensembles de fichiers nommés.

source: Beep once
de: Einmal piepsen
fr: Beeper une fois

source: topcommands.py -- Top-level application commands Copyright (c) 1999-2012, Archaeopteryx Software, Inc. All rights reserved. Written by Stephan R.A. Deibel and John P. Ehresman
de: topcommands.py -- Top-Level Anwendungsbefehle Copyright (c) 1999-2012, Archaeopteryx Software, Inc. Alle Rechte vorbehalten. Geschrieben von Stephan R.A. Deibel und John P. Ehresman

source: Create, set up signal handlers, but don't move forward or back. multi is the multi editor to cycle through.
de: Signal-Handler erstellen und einrichten, aber nicht vor oder zurück gehen. Multi ist der zu durchlaufende Multi-Editor.

source: Key press handler; must run before command map lookup
de: Handler für Tastaturbetätigung; muss vor dem Suchen nach Befehlskombinationen ausgeführt werden

source: Move to the next document alphabetically in the list of documents open in the current window
de: In der Liste der Dokumente, die im aktuellen Fenster geöffnet sind, alphabetisch zum nächsten Dokument gehen

source: Move to the previous document alphabetically in the list of documents open in the current window
de: In der Liste der Dokumente, die im aktuellen Fenster geöffnet sind, alphabetisch zum vorherigen Dokument gehen

source: Get the active multieditor in the given window (most recent window if wnd==None).
de: Schlägt den aktiven Multi-Editor im gegebenen Fenster auf (zuletzt besuchtesFenster, wenn wnd==None).

source: Get the list of (wnd, multi, loc, panel_instance) for all editors in the given windows (None is current window / window set). The returned list is in order of visit time with any as yet unvisited documents appended at end.
de: Schlägt die Liste von (wnd, multi, loc, panel_instance) für alle Editoren in den gegebenen Fenstern auf (None ist das aktuelle Fenster/Fensterset). Die ausgegebene Liste ist in der Reihenfolge der Besuchszeit mit allen noch nicht besuchten Dokumenten am Ende.

source: Current Bookmark Category
de: Aktuelle Lesezeichen-Kategorie

source: Generates menu items for remote project open commands
de: Erzeugt eine Liste der Menüeinträge für das Menü Letzte Projekte

source: Generates menu items for remote project save commands
de: Erzeugt eine Liste der Menüeinträge für das Menü Letzte Projekte

source: Generates menu items for remote file save commands
de: Erzeugt eine Liste der Menüeinträge für das Menü Letzte Dateien
