Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit_commands.po
Languages: de, fr

source: Scroll text right a column w/o moving cursor's relative position on screen. Repeat is number of columns or if >0 and <1.0 then percent of screen.
de: Text eine Spalte nach rechts rollen, ohne die relative Position des Cursors auf dem Bildschirm zu verschieben. Wiederholung ist die Anzahl der Spalten oder Prozent des Bildschirms, wenn >0 und <1.0.

source: Turn on profiling for the current source editor
de: Editor Auslastungs-Protokollroutine anschalten.

source: Stop profiling and print stats to stdout
de: Editor Auslastungs-Protokollroutine abschalten und Statistik zu stdout drucken

source: Repeat the last query replace or range replace operation on the current line. The first match is replaced without confirmation.
de: Die letzte Ersetzen-Anfrage oder Auswahl-Ersetzen-Operation in der aktuellen Zeile wiederholen. Der erste Treffer wird ohne Bestätigung ersetzt.

source: Toggle status of overtyping mode
de: Status Überschreibmodus wechseln

source: Return arg info sequence for insert-file command.
de: Info-Sequenz des Arguments zum Befehl Datei einfügen zurücksenden.

source: Return arg info sequence for goto-line command.
de: Info-Sequenz des Arguments zum Befehl Gehe-zu-Zeile zurücksenden.

source: Position cursor at start of given line number (1=first, -1 = last). This differs from goto-line in that it never prompts for a line number but instead uses the previously entered numeric modifier or defaults to going to line one. The cursor can be positioned at 'start', 'end', or 'fnb' for first non-blank character.
de: Cursor am Beginn der gegebenen Zeilennummer positionieren (1=erste; -1=letzte). Dies unterscheidet sich von 'goto-line' (Gehe-zu-Zeile), da es nie nach einer Zeilennummer verlangt, aber stattdessen den vorher eingegebenen numerischen Modifikator verwendet oder standardmäßig zur ersten Zeile geht. Der Cursor kann am 'start' (Beginn), 'end' (Ende) oder 'fnb' (erstes nicht-leeres Zeichen) positioniert werden.

source: Same as goto_nth_line but defaults to end of file if no lineno is given
de: Das gleiche wie goto_nth_line (Gehe zur n-ten Zeile), aber geht standardmäßig zum Ende der Datei, wenn keine Zeilennummer angegeben ist

source: Goto percent
de: Gehe zu Prozent

source: Position cursor at start of line at given percent in file. This uses the previously entered numeric modifier or defaults to going to line one. The cursor can be positioned at 'start', 'end', or 'fnb' for first non-blank character, or in VI mode it will do brace matching operation to reflect how VI overrides this command.
de: Cursor am Beginn der gegebenen Zeilen beim gegebenen Prozent in der Datei positionieren. Dies verwendet den zuvor eingegebenen numerischen Modifikator oder geht standardmäßig zur ersten Zeile. Der Cursor kann am 'start' (Beginn), 'end' (Ende) oder 'fnb' (erstes nicht-leeres Zeichen) positioniert werden. Im VI-Modus wird die Operation Klammernsuche ausgeführt, um zu zeigen, wie VI diesen Befehl überschreibt.

source: Return arg info sequence for goto-column command.
de: Info-Sequenz des Arguments zum Befehl Gehe-zu-Spalte zurücksenden.

source: Execute most recently recorded keyboard macro. If register is None then the user is asked to enter a letter a-z for the register where the macro is filed. Otherwise, register 'a' is used by default.
de: Ausführen des zuletzt aufgenommenen Tastatur-Makros. Wenn das Register auf 'None' eingestellt ist, dann wird der Benutzer gebeten einen Buchstaben (a-z) für das Register einzugeben, in dem das Makro gespeichert ist. Ansonsten wird standardmässig Register 'a' verwendet.

source: Attempt to auto-justify the paragraph around the current start of selection
de: Versuch, den Paragraphen um den aktuellen Beginn der Auswahl automatisch auszurichten

source: Join together all lines in given selection (replace newlines with the given delimiter (single space by default)
de: Alle Zeilen in der gegebenen Auswahl zusammenfügen (neue Zeilen mit dem gegebenen Abgrenzer ersetzen (standardmäßig ein Leerzeichen)

source: Join together specified number of lines after current line (replace newlines with the given delimiter (single space by default)
de: Bestimmte Zeilenanzahl nach der aktuellen Zeile zusammenfügen (neue Zeilen mit dem gegebenen Abgrenzer ersetzen (standardmäßig ein Leerzeichen)
