Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_guimgr.po
Languages: de, ru

source: Hide Toolbox
de: Werkzeugkasten ausblenden
ru: Скрыть панель инструментов

source: Use Above and Below Splits
ru: Использовать разделение верх низ

source: Use Side by Side Splits
ru: Использовать боковое разделение

source: Place Tabs at Bottom
de: Reiter unten platzieren
ru: Поместить вкладки внизу

source: Place Tabs at Top
de: Reiter oben platzieren
ru: Поместить вкладки вверху

source: Place Tabs at Right
de: Reiter rechts platzieren
ru: Поместить вкладки справа

source: Place Tabs at Left
de: Reiter links platzieren
ru: Поместить вкладки слева

source: The window title (blank for internal default)
de: Der Fenstertitel (leer um den Standard-Titel zu benutzen)
ru: Заголовок окна (пустой для внутреннего значения по умолчанию)

source: Set Window Title...
de: Fenstertitel setzen...
ru: Установить заголовок окна ...

source: Keep Window on Top
de: Fenster im Vordergrund halten
ru: Держать окно поверх

source: _Continue Working
de: _Arbeit fortsetzen
ru: _Продолжить Работу

source: Wing requires a restart to reinitialize its display to match the current display preferences. You may either quit now or continue working without all the preferences applied.
de: Wing erfordert einen Neustart zur Neuformatierung der Anzeige, damit diese mit den aktuellen Einstellungen übereinstimmt. Sie können jetzt entweder beenden oder ohne die Anwendung aller Einstellungen weiterarbeiten.
ru: Wing требует перезагрузки для повторной инициализации своего дисплея в соответствии с текущими настройками отображения. Вы можете либо выйти, либо продолжить работу без всех примененных настроек.

source: Restart for Display Changes
de: Neustarten, um Änderungen anzuzeigen
ru: Перезапуск для отображения изменений

source: _Enable Auto-Editing
de: Auto-Bearbeitung _aktivieren
ru: _Включить авторедактирование

source: Please select your preferred editor behaviors. Hover over the fields for additional documentation.
ru: Выберите предпочтительное поведение редактора. Наведите курсор на поля для дополнительной документации.

source: You can alter these settings later in Preferences or by using the Edit > Keyboard Personality menu.
ru: Вы можете изменить эти настройки позже в настройках или с помощью меню Edit > Keyboard Personality.

source: Use Wing _Defaults
de: Wing _Standards verwenden
ru: Использовать Wing _Умолчания

source: Use _These Settings
de: _Diese Einstellung verwenden
ru: Использовать _Эти настройки

source: Select Initial Preferences
ru: Выберите начальные настройки

source: Configuring window %i...
de: Konfiguriere Fenster %i...
ru: Настройка окна %i...

source: %s: Undefined key sequence
de: %s: Undefinierte Tastenfolge
ru: %s: неопределенная последовательность клавиш

source: Unavailable commands: %s
de: Nicht verfügbare Befehle: %s
ru: Недоступные команды: %s

source: Failed to save portion of editor state for %s
de: Das Speichern von Teilen des Editor-Zustandes für %s ist fehlgeschlagen
ru: Не удалось сохранить часть состояния редактора для %s

source: Failed to restore portions of editor state for %s:
de: Das Wiederherstellen von Teilen des Editor-Zustandes für %s ist fehlgeschlagen:
ru: Не удалось восстановить части состояния редактора для %s:

source: [not unique]
de: [nicht eindeutig]
ru: [не уникально]

source: [no match]
de: [keine Übereinstimmung]
ru: [не совпадает]

source: Repeat:
de: Wiederholen:
ru: Повтор:

source: Count:
de: Anzahl:
ru: Количество:

source: general
de: Allgemein
ru: общие сведения

source: debugger
ru: отладчик

source: editor
ru: редактор

source: search
de: Suchen
ru: поиск

source: project
de: Projekt
ru: проект

source: analysis
de: Analyse
ru: анализ

source: scripts
de: Skripte
ru: скрипты

source: transient
de: vorübergehend
ru: временный

source: All
de: Alle
ru: Все

source: General
de: Allgemein
ru: Общие

source: Debugger
ru: Отладчик

source: Editor
ru: Ркдактор

source: Search Progress
de: Suchfortschritt
ru: Ход поиска

source: Project Manager
de: Projektmanager
ru: Менеджер проекта

source: Source Analysis
de: Source-Analyse
ru: Анализ исходных текстов

source: Version Control
de: Versionsverwaltung
ru: Контроль версий

source: Scripts
de: Skripte
ru: Скрипты

source: Messages
de: Nachrichten
ru: Сообщения

source: Wing Sub-System Messages
de: Wing Untersystem-Nachrichten
ru: Сообщения подсистемы Wing

source: Error
de: Fehler
ru: Ошибка

source: Messages visual state
de: Visueller Zustand der Nachrichten
ru: Визуальное состояние сообщений

source: Show Messages:
de: Nachrichten zeigen:
ru: Показать сообщения:

source: Failed to save portions of visual state for editor %s:
de: Das Speichern von Teilen des visuellen Zustandes für den Editor %s ist fehlgeschlagen:
ru: Не удалось сохранить часть визуального состояния для редактора %s:

source: Switch between open files
de: Zwischen geöffneten Dateien wechseln
ru: Переключение между открытыми файлами

source: This editor is locked and will not be used to open other files. Click the lock icon to change modes.
ru: Переключение между открытыми файлами

source: This file is sticky and will remain open until closed. Click the stick pin icon to change modes.
ru: Этот файл закреплен и будет оставаться открытым до закрытия. Нажмите на значок булавки, чтобы изменить режимы.

source: This file is non-sticky and will auto-close when hidden. Click the stick pin icon to change modes.
ru: Этот файл не закреплен и будет автоматически закрываться при скрытии. Нажмите на значок булавки, чтобы изменить режимы.

source: Right-click for menu of recently visited documents.
de: Rechter Mausklick für Menü der zuletzt besuchten Dokumente.
ru: Right-click для меню недавно просмотренных документов.

source: Configure...
de: Konfigurieren...
ru: Настроить...

source: Next visit in history (%s)
ru: Следующий визит в историю (%s)

source: Next visit in history
ru: Следующий визит в историю

source: Previous visit in history (%s)
ru: Предыдущий визит в истории (%s)

source: Previous visit in history
ru: Предыдущий визит в истории

source: Diff/Merge session options
de: Vergleichen/Zusammenführen-Sitzung Optionen
ru: Diff/Merge параметры

source: Navigate to bookmarks in this file
de: Zu Lesezeichen in dieser Datei navigieren
ru: Переход к закладкам в этом файле

source: Close Document
de: Dokument schließen
ru: Закрыть документ

source: Document View Options
de: Optionen der Dokumentenansicht
ru: Параметры Просмотра Документа

source: General failure getting multi-editor visual state
de: Allgemeiner Fehler beim Abrufen des visuellen Zustandes des Multi-Editors
ru: Общий сбой в multi-editor visual state

source: Current editor file
de: Aktuelle Editordatei
ru: Текущий файл редактора

source: General failure setting multi-editor visual state
de: Allgemeiner Fehler beim Setzen des visuellen Zustandes des Multi-Editors
ru: Общий сбой при установке multi-editor visual state

source: File open failed
de: Datei öffnen gescheitert
ru: Ошибка открытия файла

source: Move %s to New Window
de: %s in ein neues Fenster verschieben
ru: Переместить %s в новое окно

source: Close %s
de: %s schließen
ru: Закрыть %s

source: Close Others
de: Andere schließen
ru: Закрыть Другие

source: Close All
de: Alle schließen
ru: Закрыть Все

source: Copy File Path
de: Datei-Pfad kopieren
ru: Копировать путь к файлу

source: Show in Explorer
de: Im Explorer anzeigen
ru: Показать в проводнике

source: Show in Finder
de: Im Finder zeigen
ru: Показать в поисковике

source: Show Directory
de: Verzeichnis anzeigen
ru: Показать каталог

source: Show in Project
de: Im Projekt zeigen
ru: Показать в проекте

source: Split Top and Bottom
de: Oben und unten teilen
ru: Split верх и низ

source: Join all Splits
de: Alle Teile verbinden
ru: Объединить все разбиения

source: Show All Files in All Splits
ru: Показать все файлы во всех сплитах

source: Hide Notebook Tabs
de: Notizbuch-Reiter ausblenden
ru: Скрыть Вкладки

source: Show Notebook Tabs
de: Notizbuch-Reiter anzeigen
ru: Показать Вкладки

source: Keep Tabs Alphabetized
ru: Держать Вкладки В Алфавитном Порядке

source: Add New Tabs on Left
ru: Добавить новые вкладки слева

source: Sort Symbol Menus Alphabetically
de: Symbol-Menüs alphabetisch sortieren
ru: Сортировать Меню Символов В Алфавитном Порядке

source: Sort Symbol Menus in File Order
de: Symbol-Menüs in Dateireihenfolge sortieren
ru: Сортировка символьных меню в порядке файлов

source: General failure getting paned editor state
de: Allgemeiner Fehler beim Abrufen des geteilten Editor-Zustandes
ru: Общий сбой состояния редактора с панелями

source: Currently open editor files
de: Gegenwärtig geöffnete Editor-Dateien
ru: В данный момент открыты файлы редактора

source: General failure setting paned editor state
de: Allgemeiner Fehler beim Setzen des geteilten Editor-Zustandes
ru: Общие ошибки настройки состояния редактора с панелями

source: Could not read key map
de: Tastaturbelegung kann nicht gelesen werden
ru: Не удалось прочитать карту ключей

source: The key map file '%s' could not be found or is not readable. Attempting to fall back to internal defaults. Please restore the missing file or change the User Interface / Advanced / Key Map File preference.
de: Die Short-Cut-Datei %s wurde nicht gefunden oder ist nicht lesbar. Es wird versucht, die Werte auf interne Voreinstellungen zurückzusetzen. Bitte stellen Sie die fehlende Datei wieder her oder ändern Sie die Einstellung Benutzeroberfläche / Fortgeschritten / Short-Cut-Datei.
ru: Файл сопоставления ключей '%s' не найден или не читается. Возврат к внутренним значениям по умолчанию. Пожалуйста, восстановите отсутствующий файл или измените настройки User Interface / Advanced / Key Map File.

source: Combined Toolbox and Editor Windows
de: Kombinierte Werkzeugkasten- und Editor-Fenster
ru: Комбинированные панели инструментов и редактора

source: Separate Toolbox Windows
de: Getrennte Werkzeugkasten-Fenster
ru: Отдельные окна инструментов

source: Defines location of the keymap override file. Use None for default according to configured editor personality. See the Wing Manual for details on building your keymap override file -- in general this is used only in development or debugging keymaps; use the keymap-override preference instead for better tracking across Wing versions.
de: Bestimmt den Ort der Datei, welche die Tastenkombinationen überschreibt. Verwenden Sie 'None' für die Standardeinstellung entsprechend der konfigurierten Editor-Individualität. Bitte lesen Sie im Wing Benutzerhandbuch nach, das Einzelheiten zum Erstellen der Datei zum Überschreiben der Tastenkombinationen detailliert beschreibt. Im Allgemeinen wird dies nur in der Entwicklung oder beim Debuggen von Tastenkombinationen verwendet. Verwenden Sie die Einstellung 'Tastenkombinationen überschreiben', um es besser in den Wing Versionen verfolgen zu können.
ru: Определяет расположение файла переопределения раскладки. Используйте None для настройки по умолчанию в соответствии с настройками редактора. Подробные сведения о создании файла переопределения клавиатуры см. В руководстве Wing Manual. Обычно это используется только при разработке или отладке раскладок; используйте вместо этого keymap-override для лучшего отслеживания версий Wing.

source: Override with selected:
de: Gewählte verwenden:
ru: Переопределить с выбранным:

source: Use Default for Personality
de: Standard für Individualität verwenden
ru: Использовать по умолчанию для персонализации

source: Override key bindings in the keymap. To enter the key, place focus on the entry area and type the key combination desired. The command is one of those documented in the user manual's Command Reference, or the name of any user scripts that have been loaded into the IDE. Leave the command name blank to remove the default binding for a key (this is useful when adding multi-key bindings that conflict with a default).
ru: Переопределите привязки клавиш в раскладке. Чтобы ввести ключ, поместите фокус на область ввода и введите желаемую комбинацию клавиш. Команда является одной из тех, которые описаны в Руководстве по Command Reference или имени любых пользовательских скриптов, загруженных в среду IDE. Оставьте имя команды пустым, чтобы удалить привязку для ключа по умолчанию (это полезно при добавлении привязок с несколькими ключами, которые конфликтуют со значением по умолчанию).

source: Key
de: Taste
ru: Ключ

source: Command
de: Befehl
ru: Команда

source: Rectangle to use for the IDE work area on screen. All windows open within this area. Format is (x, y, width, height), or use None for full screen.
de: Rechteck, das für den IDE Arbeitsbereich auf dem Bildschirm verwendet wird. Alle Fenster öffnen sich in diesem Bereich. Das Format ist (x, y, Breite, Höhe) oder verwenden Sie None für den Vollbildschirm.
ru: Прямоугольник, используемый для рабочей области IDE на экране. Все окна открываются в этой области. Формат (x, y, ширина, высота), или использовать нет для полноэкранного.

source: Full Screen
de: Vollbildschirm
ru: Полноэкранный

source: Height
de: Höhe
ru: Высота

source: This Rectangle:
de: Dieses Rechteck:
ru: Этот прямоугольник:

source: Width
de: Breite
ru: Ширина

source: Whether toolbar is shown in any window.
de: Ob die Werkzeugleiste in irgendeinem Fenster gezeigt wird.
ru: Отображается ли панель в любом окне.

source: Auto-Size
de: Auto-Größe
ru: Авторазмер

source: Tiny (Text Height)
de: Sehr Klein (Texthöhe)
ru: Крошечный (Высота Текста)

source: Small
de: Klein
ru: Маленький

source: Medium
de: Mittel
ru: Средний

source: Large
de: Groß
ru: Большой

source: Extra Large
de: Extragroß
ru: Очень большой

source: System Default
de: Systemstandard
ru: Системный по умолчанию

source: Sets size of the toolbar icons. By default, adjusts according to available space.
ru: Задает размер значков панели инструментов. По умолчанию корректируется в соответствии с доступным пространством.

source: Adjust for Size
ru: Отрегулировать размер

source: Icon Only
de: Nur Symbol
ru: Только Значок

source: Text Only
de: Nur Text
ru: Только текст

source: Icon and Text Below
de: Symbol und Text nach unten
ru: Значок и снизу текст

source: Icon and Text to Side
de: Symbol und Text zur Seite
ru: Значок и текст сбоку

source: Select style of toolbar icons to use. By default, adjusts according to available space.
ru: Выберите стиль значков панелей инструментов для использования. По умолчанию - корректируется в соответствии с доступным пространством.

source: Primary color for icons
ru: Основной цвет значков

source: Secondary color for icons
ru: Вторичный цвет значков

source: Tertiary color for icons
ru: 3-й цвет для значков

source: Quaternary color for icons
ru: 4-й цвет для значков

source: Quinary color for icons
ru: 5-й Цвет для значков

source: Senary color for icons
ru: 6-й Цвет для значков

source: Controls whether or not tooltips containing help are shown when the mouse hovers over areas of the user interface.
de: Kontrolliert ob Werkzeug-Tipps, die Hilfe-Informationen beinhalten, angezeigt werden, wenn der Nutzer die Maus über Bereiche der Benutzeroberfläche bewegt.
ru: Определяет, отображаются ли подсказки, содержащие справку, при наведении указателя мыши на области пользовательского интерфейса.

source: The base font and size to use for the user interface's menus and labels
de: Die Basis-Schriftart und -größe, die für die Menüs und Beschriftungen der Benutzeroberfläche verwendet werden
ru: Базовый шрифт и размер, используемый для меню и меток пользовательского интерфейса

source: Use Default
de: Standard verwenden
ru: Использовать По Умолчанию

source: Use Selected Font/Size:
de: Ausgewählte Schriftart/-größe verwenden:
ru: Использовать выбранный шрифт/размер:

source: Controls whether project files are opened as project or as text when opened from the File menu. This does not affect opening from the Project menu.
de: Kontrolliert, ob Projektdateien als Projekt oder als Text geöffnet werden, wenn sie vom Menü Datei geöffnet werden. Dies beeinflußt nicht das Öffnen über das Menü Projekt.
ru: Определяет, будут ли файлы проекта открыты как проект или как текст при открытии из меню Файл. Это не влияет на открытие из меню проект.

source: Maximum number of items to display in the Recent menus.
de: Maximale Anzahl der Einträge, die in Letzte Menüs angezeigt werden.
ru: Максимальное число элементов, отображаемых в последних меню.

source: Base Name Only
de: Nur Basisname
ru: Только Базовое Имя

source: Prepend Relative Path
de: Relativen Pfad voranstellen
ru: Prepend Относительный Путь

source: Append Relative Path
de: Relativen Pfad anhängen
ru: Добавить Относительный Путь

source: Prepend Full Path
de: Vollen Pfad voranstellen
ru: Prepend Полный Путь

source: Append Full Path
de: Vollen Pfad anhängen
ru: Добавить Полный Путь

source: Format used for titles of source files: Use Base Name Only to display just the file name, Prepend Relative Path to use partial relative path from the project file location or configured Project Home Directory, Append Relative Path to instead append the relative path after the file namePrepend Full Path to use full path, or Append Full Path to instead append the fullpath after the file name.
ru: Формат, используемый для заголовков исходных файлов: Используйте только Базовое Имя, чтобы отобразить только имя файла, Prepend Относительный Путь, чтобы использовать частичный относительный путь из расположения файла проекта или настроенного домашнего каталога проекта, Добавьте Относительный Путь, чтобы добавить относительный путь после имени файла предваряющий полный путь для использования полного пути, или Добавить Полный Путь, чтобы добавить FullPath после имени файла.

source: Show the remote host name in all basename-only filenames used in titles.
ru: Показывать имя удаленного хоста во всех именах только для базового имени, используемых в заголовках.

source: Maximum size of files that Wing will try to open, in MB.
ru: Максимальный размер файлов, которые Wing попытается открыть, в MB.

source: Enable to always show the full path of a file name in the tooltips shown from the editor tabs and file selection menus. When disabled, the configured Source Title Style is used instead.
ru: Включить, чтобы всегда показывать полный путь к имени файла во всплывающих подсказках, отображаемых на вкладках редактора и в меню выбора файла. Если этот параметр отключен, вместо него используется настроенный Стиль Заголовка Источника.

source: Mime Type
de: Mime-Typ
ru: Mime тип

source: Display Commands
de: Bildschirmbefehle
ru: Команды Отображения

source: Protocol
de: Protokoll
ru: Протокол

source: Controls whether or not all edited files are saved without asking before a debug run, before starting unit tests, or before a file or build process is executed.
ru: Определяет, сохраняются ли все отредактированные файлы без запроса перед запуском отладки, перед запуском модульных тестов или до выполнения файла или процесса построения.

source: Controls whether or not Wing ignores files that were not saved before starting debug or that have changed since they were loaded by the debug process. Wing normally will warn of unsynchronized files since breakpoints may not be reached and stepping through the files may not work properly if lines have moved. Checking this option turns off these warnings.
ru: Контролирует, игнорирует ли Wing файлы, которые не были сохранены до начала отладки или которые были изменены с момента их загрузки процессом отладки. Обычно Wing предупреждает о несинхронизированных файлах, так как точки останова могут быть не достигнуты, а переходы по файлам могут не работать должным образом, если линии перемещаются. Проверка этой опции отключает эти предупреждения.

source: Controls whether or not to set the foreground lock timeout on Windows, where normally Wing will be unable to bring source windows to front whenever the debug process has windows in the foreground. When this preference is true, the system-wide value that prevents background applications from raising windows is cleared whenever Wing is running. This means that other apps will also be able to raise windows without these restrictions while Wing is running. Set the preference to false to avoid this, but be prepared for windows to fail to raise in some instances. Note: If Wing is terminated abnormally or from the task manager, the changed value will persist until the user logs out.
ru: Контролирует, следует ли устанавливать тайм-аут блокировки переднего плана в Windows, где обычно Wing не сможет выводить исходные окна на фронт, когда в процессе отладки есть окна на переднем плане. Когда это предпочтение верно, общесистемное значение, которое предотвращает создание фоновых приложений от окон, очищается всякий раз, когда выполняется Wing. Это означает, что другие приложения также смогут поднимать окна без этих ограничений во время работы Wing. Установите для параметра предпочтение false, чтобы избежать этого, но будьте готовы к тому, что окна не будут всплывать в некоторых случаях. Примечание. Если Wing прекращено аварийно или из диспетчера задач, измененное значение будет сохраняться до тех пор, пока пользователь не выйдет из системы.

source: Sets the timeout in seconds to use for typing, after which keys pressed are considered a separate group of characters. This is used for typing-to-select on lists and in other GUI areas. Before the timeout subsequent keys are added to previous ones to refine the selection during keyboard navigation.
de: Stellt die für die Tastatureingabe verwendete Zeitabschaltung in Sekunden ein, nach der die betätigten Tasten als eine separate Gruppe von Zeichen betrachtet werden. Dies wird für Auswahlmöglichkeiten mit der Tastatur auf Listen oder in anderen GUI Bereichen verwendet. Vor der Zeitabschaltung werden die nachfolgenden Tasten zu den vorherigen hinzugefügt, um die Auswahl während der Tastaturnavigation zu verbessern.
ru: Задает тайм-аут в секундах для ввода текста, после чего нажимаемые клавиши считаются отдельной группой символов. Используется для ввода текста в раскрывающихся списках и в других областях графического интерфейса. Перед таймаутом последующие клавиши добавляются к предыдущим, чтобы уточнить выбор во время навигации по клавиатуре.

source: The color used to indicate the current text selection on editable text.
de: Die Farbe, die verwendet wird, um die aktuelle Textauswahl des zu bearbeitenden Textes anzuzeigen.
ru: Цвет, используемый для обозначения текущего выделения текста в редактируемом тексте.

source: Controls whether or not the Wing Tips tool is shown automatically at startup of the IDE.
de: Kontolliert, ob das Wing Tipps-Werkzeug automatisch beim Start des IDE angezeigt wird.
ru: Определяет, отображается ли инструмент "подсказки Wing" автоматически при запуске среды IDE.

source: Controls whether or not Wing shows tabs for switching between editors. When false, a popup menu is used instead.
ru: Контролирует наличие или отсутствие отображения вкладок Wing при переключении между редакторами. Значении false означает, что вместо этого используется всплывающее меню.

source: File Order
de: Datei-Reihenfolge
ru: Порядок файлов

source: Alphabetical Order
de: Alphabetische Reihenfolge
ru: Алфавитный порядок

source: Control preferred order in source index displays such as the editor browse menus. Either sort in the order found in the file or alphabetical order.
ru: Управление порядком отображения исходного индекса, например меню просмотра редактора. Сортировка в порядке, указанном в файле, или в алфавитном порядке.

source: Whether to show all open editors in a window in every split.
ru: Показывать все открытые редакторы в окне каждого сплита.

source: Whether to keep tabs in alphabetical order.
ru: Следует ли держать вкладки в алфавитном порядке.

source: Whether to add new tabs on the left side instead on the right.
ru: Следует ли добавлять новые вкладки с левой стороны, а не справа.
