Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_debug_client_cmdmanager.po
Languages: fr, ru

source: Commands that control the debugger and current debug process, if any.
fr: Commandes qui contrôlent le débogueur et le processus de débogage actuel, si existant.
ru: Команды, управляющие отладчиком и текущим процессом отладки, если таковые имеются.

source: Always stop on exceptions, even if they are handled by the code
fr: Toujours s'arrêter sur les exceptions, même si elles sont gérées par le code
ru: Всегда прерывать выполнение на исключениях, даже если они обрабатываются кодом

source: Never stop on exceptions, even if they are unhandled in the code
fr: Ne jamais s'arrêter sur les exceptions, même si elles ne sont gérées par le code
ru: Никогда не прерывать выполнение на исключениях, даже если они не обрабатываются в коде

source: Stop only on exceptions that are not handled by the code
fr: S'arrêter seulement sur les exceptions qui ne sont pas gérées par le code
ru: Прерывать выполнение только на исключениях, которые не обрабатываются кодом

source: Stop only on exceptions when they are about to be printed
fr: S'arrêter seulement sur les exceptions lorsqu'elles vont être imprimées
ru: Останавливаться только на исключениях после печати

source: Clear list of exceptions being ignored during debugging
fr: Vider la liste des exceptions ignorées durant le débogage
ru: Очистить список исключений, игнорируемых во время отладки

source: Execute the build command defined in the project, if any
fr: Exécute la commande de construction définie dans le projet, si existante
ru: Выполните команду сборки, определенную в проекте, если таковая

source: Attach to an already-running debug process
fr: Se rattacher à un processus de débogage déjà en exécution
ru: Присоединить к уже запущенному процессу отладки

source: Detach from the debug process and let it run
fr: Détacher du processus de débogage et le laisser s'exécuter
ru: Отсоедините процесс отладки и пусть он работает

source: Detach from all debug processes and let them run
fr: Détacher de tous les processus de débogage et le laisser s'exécuter
ru: Отсоедините все отладочные процессы и дайте им работать

source: Step into current execution point, or start debugging at first line
fr: Un pas en profondeur dans le point d'exécution actuel, ou commencer le débogage à la première ligne
ru: Шаг в текущую точку выполнения или запуск отладки в первой строке

source: Step over current instruction
fr: Un pas au delà de l’instruction actuelle
ru: Шаг через текущую инструкцию

source: Step over current line
fr: Un pas au delà de la ligne actuelle
ru: Шаг через текущую линию

source: Step over current statement
ru: Шаг через текущее выражение

source: Step over current block
fr: Un pas au delà de la ligne actuelle
ru: Шаг через текущий блок

source: Step out of the current function or method
fr: Un pas en dehors de la fonction ou méthode actuelle
ru: Шаг из текущей функции или метода

source: Already at Innermost Frame
ru: Уже в самой внутренней структуре

source: To Step Out to Here, first select a stack frame other than the innermost stack frame.
ru: Чтобы выйти отсюда, сначала выберите кадр стека, отличный от самого внутреннего кадра стека.

source: Move program counter to caret
fr: Déplacer le compteur du programme au curseur
ru: Переместить счетчик программы на каретку

source: Move program counter to click location
fr: Déplacer le compteur du programme à l’emplacement du clic
ru: Переместить счетчик программ в положение click

source: Start debugging the current file (rather than the main entry point)
fr: Commencer le débogage du fichier actuel (plutôt que le point d'entrée principal)
ru: Начните отладку текущего файла (вместо основной точки входа)

source: Show the debug run arguments and environment configuration dialog for the main entry point or current file
ru: Показать аргументы отладки и диалог настройки среды для главной точки входа или текущего файла

source: Start or continue debugging to next breakpoint or exception
fr: Commencer ou continuer le débogage jusqu'au prochain point d'arrêt ou exception
ru: Запустить или продолжить отладку до следующей точки останова или исключения

source: (press Alt to continue all paused debug processes)
fr: (appuyer sur Alt pour continuer tous les process de débogage en pause)
ru: (нажмите Alt, чтобы продолжить все приостановленные процессы отладки)

source: Continue all paused debug processes
fr: Continuer tous les processus de débogage en pause
ru: Продолжить все приостановленные процессы отладки

source: Start a new debug process running
ru: Запуск нового процесса отладки

source: Display the launch config manager
fr: Affiche le gestionnaire de lancement de configurations
ru: Отобразить диспетчер конфигурации запуска

source: Create a new launch configuration with the given name if it does not already exist, and then open the launch configuration attribute dialog.
ru: Создайте новую конфигурацию запуска с заданным именем, если она еще не существует, а затем откройте диалог атрибута конфигурации запуска.

source: Create Launch Configuration
fr: Créer un lancement de configuration
ru: Создать конфигурацию запуска

source: Name of the new launch configuration
fr: Nom du nouveau lancement de configuration
ru: Имя новой конфигурации запуска

source: Name
fr: Nom
ru: Имя

source: Display the named entry point manager
fr: Affiche le gestionnaire de points d'entrée nommés
ru: Отображение диспетчера именованных точек входа

source: Create a new named entry point if it does not already exist, and then open the named entry point attribute dialog.
ru: Создайте новую именованную точку входа, если она еще не существует, а затем откройте диалоговое окно с именем атрибута точки входа.

source: Name of the entry point
fr: Nom du point d'entrée
ru: Название точки входа

source: Create Named Entry Point
fr: Créer un point d'entrée nommé
ru: Создать именованную точку входа

source: Debug the named entry point
fr: Déboguer le point d'entrée nommé
ru: Отладка именованной точки входа

source: Execute (without debugging) the named entry point
fr: Exécuter (sans déboguer) le point d'entrée nommé
ru: Выполнить (без отладки) именованную точку входа

source: Display the remote host configuration manager
fr: Afficher le gestionnaire de configurations d’hôte distant
ru: Отобразить диспетчер конфигурации удаленного хоста

source: Create a new remote host configuration and open the remote host attribute dialog.
ru: Создайте новую конфигурацию удаленного хоста и откройте диалоговое окно атрибута удаленного хоста.

source: Terminate current debug session
fr: Terminer la session de débogage en cours
ru: Завершить текущий сеанс отладки

source: (press Alt to terminate all debug processes)
fr: (appuyer sur Alt pour terminer tous les process de débogage)
ru: (нажмите Alt, чтобы завершить все процессы отладки)

source: Terminate all debug processes
fr: Terminer tous les processus de débogage
ru: Завершить все процессы отладки

source: Pause debug at current program counter
fr: Pause du débogage au compteur actuel du programme
ru: Пауза отладки на текущем счетчике программы

source: (press Alt to pause all debug processes)
fr: (presser Alt pour mettre en pause tous les processus de débogage)
ru: (нажмите Alt, чтобы приостановить все процессы отладки)

source: Pause all free-running debug processes at the current program counter
fr: Pause de tous les débogages libres en cours au compteur actuel du programme
ru: Приостановить все процессы отладки на текущем счетчике программы

source: Stop and restart debugging
fr: Arrêter et redémarrer le débogage
ru: Остановить и перезапустить отладку

source: (press Alt to restart all debug processes)
fr: (presser Alt pour redémarrer tous les processus de débogage)
ru: (нажмите Alt, чтобы перезапустить все процессы отладки)

source: Stop and restart all debug processes that were launched from the IDE
fr: Stopper et redémarrer tous les processus de débogage qui étaient lancés depuis l’IDE
ru: Остановите и перезапустите все процессы отладки, запущенные из среды IDE

source: Re-run the latest debug session that was launched from the IDE
fr: Re-lancer la dernière session de débogage qui a été lancée depuis l’IDE
ru: Повторно запустите последний сеанс отладки, который был запущен из среды IDE

source: Run to current cursor position
fr: Lancer jusqu'à la position actuelle du curseur
ru: Выполнить до текущего положения курсора

source: Debug to the line at the current mouse click location
fr: Déboguer jusqu'à la ligne de l'emplacement actuel du clic de souris
ru: Отладка строки в текущем местоположении click мыши

source: Debug to Clicked
fr: Déboguer jusqu'au clic
ru: Отладка до щелчка

source: Move up the current debug stack
fr: Remonter la pile de débogage actuelle
ru: Перемещение вверх по текущему стеку отладки

source: Move down the current debug stack
fr: Descendre la pile de débogage actuelle
ru: Перемещение вниз по текущему стеку отладки

source: Show the position (thread and stack frame) where the debugger originally stopped
fr: Afficher la position (tâche et élément de pile) où le débogueur s'est arrêté
ru: Показать позицию (поток и кадр стека), в которой отладчик был остановлен

source: Set a new regular breakpoint on current line
fr: Établir un nouveau point d'arrêt régulier sur la ligne actuelle
ru: Установка новой обычной точки останова в текущей строке

source: Set a new regular breakpoint at the current mouse click location
fr: Établir un nouveau point d'arrêt régulier à l'emplacement actuel du clic de souris
ru: Установка новой обычной точки останова в текущем местоположении щелчка мышью

source: Toggle breakpoint at current line (creates new regular bp when one is created)
fr: Basculement d'un point d'arrêt sur la ligne actuelle (crée un nouveau point d'arrêt régulier s'il est créé)
ru: Переключить точку останова на текущую линию (создает новую обычную bp при создании)

source: Set a new conditional breakpoint on current line
fr: Établir un point d'arrêt conditionnel sur la ligne actuelle
ru: Установка новой условной точки останова для текущей строки

source: Set a new conditional breakpoint at the current mouse click location
fr: Établir un nouveau point d'arrêt conditionnel à l'emplacement actuel du clic de souris
ru: Установка новой условной точки останова в текущем местоположении щелчка мыши

source: Set a new temporary breakpoint on current line
fr: Établir un nouveau point d'arrêt temporaire sur la ligne actuelle
ru: Установка новой временной точки останова для текущей строки

source: Set a new temporary breakpoint at the current mouse click location
fr: Établir un nouveau point d'arrêt à l'emplacement actuel du curseur de souris
ru: Установка новой временной точки останова в текущем местоположении щелчка мыши

source: Ignore the breakpoint on current line for N iterations
fr: Ignorer le point d'arrêt sur la ligne actuelle pendant N itérations
ru: Игнорировать точку останова в текущей строке для N итераций

source: Ignore the breakpoint at the current mouse click location for N iterations
fr: Ignorer le point d'arrêt à l'emplacement actuel du clic de souris pendant N itérations
ru: Игнорировать точку останова в текущем местоположении щелчка мыши для N итераций

source: Edit condition for the breakpoint on current line
fr: Éditer une condition pour le point d'arrêt sur la ligne actuelle
ru: Изменить условие для точки останова в текущей строке

source: Edit condition for the breakpoint at the current mouse click location
fr: Éditer une condition pour le point d'arrêt à l'emplacement actuel du clic de souris
ru: Изменить условие для точки останова в текущем местоположении щелчка мыши

source: Toggle whether breakpoint on current line is enabled or disabled
fr: Basculer même si un point d'arrêt sur la ligne actuelle est activé ou désactivé
ru: Переключение между включением или отключением точки останова в текущей строке

source: Enable the breakpoint on the current line
fr: Activer le point d'arrêt sur la ligne actuelle
ru: Включить точку останова в текущей строке

source: Enable the breakpoint at current click location
fr: Activer le point d'arrêt à l'emplacement actuel du clic
ru: Включить точку останова в текущем местоположении щелчка

source: Disable the breakpoint on current line
fr: Désactiver le point d'arrêt sur la ligne actuelle
ru: Отключить точку останова в текущей строке

source: Disable the breakpoint at current click location
fr: Désactiver le point d'arrêt à l'emplacement actuel du clic
ru: Отключить точку останова в текущем местоположении щелчка мыши

source: Set a disabled breakpoint on the current line
fr: Etablir un point d'arrêt désactivé sur la ligne actuelle
ru: Установка отключенной точки останова на текущей строке

source: Enable all breakpoints
fr: Activer tous les points d'arrêts
ru: Включить все точки останова

source: Disable all breakpoints
fr: Désactiver tous les points d'arrêts
ru: Отключить все точки останова

source: Clear the breakpoint on the current line
fr: Effacer le point d'arrêt sur la ligne actuelle
ru: Очистить точку останова на текущей строке

source: Clear the breakpoint at current click location
fr: Effacer le point d'arrêt à l'emplacement actuel du clic
ru: Очистить точку останова в текущем местоположении щелчка

source: Clear all breakpoints
fr: Effacer tous les points d'arrêts
ru: Очистить все точки останова

source: Watch selected variable using a direct object reference to track it
fr: Surveiller la variable sélectionnée en utilisant une référence directe à l'objet pour le traquer
ru: Отслеживать выбранную переменную с помощью прямой ссылки на объект

source: Watch selected variable using a reference to the value's parent and the key slot for the value
fr: Surveiller la variable sélectionée en utilisant une référence à la valeur parente et à la clé du slot pour la valeur
ru: Отслеживать выбранную переменную с помощью ссылки на родительское значение и ключевой слот для значения

source: Watch selected value using the symbolic path to it
fr: Surveiller la valeur sélectionée en utilisant un chemin symbolique à elle
ru: Отслеживать выбранное значение, используя символический путь к нему

source: Watch selected value relative to a module looked up by name in sys.modules
fr: Surveiller la valeur sélectionée relative à un module par son nom dans sys.modules
ru: Отслеживать выбранное значение относительно имени модуля в sys.modules

source: Add a new expression to the watch list
fr: Ajouter une nouvelle expression à la liste à surveiller
ru: Добавить новое выражение в список Отслеживания

source: Force refetch of a value from server
fr: Forcer la récupération (refetch) d’une valeur depuis le serveur
ru: Принудительное получение значения с сервера

source: Clear stored variable errors so they get refetched
fr: Effacer les erreurs de variable stockées pour les récupérer à nouveau
ru: Очистить историю переменных ошибок для возможного перевыбора

source: Expand whole selected variables display subtree deeper
fr: Développer l'affichage des variables sélectionnées dans l'arborescence
ru: Развернуть всю структуру выбранных переменных

source: Collapse whole selected variables display subtree one more level
fr: Masquer l'affichage des variables sélectionées d'un niveau supplémentaire dans l'arborescence
ru: Свернуть всю структуру выбранных переменных на один уровень

source: Utility to get bp status info
fr: Utilitaire d'obtention d'informations sur les statuts d'un point d'arrêt
ru: Утилита информации о состоянии точки останова

source: Returns most current created shell view or None if there isn't any.
fr: Retourne la vue créée du shell la plus actuelle ou None s'il n'y en a pas.
ru: Возвращает самое последнее созданное представление оболочки или None, если его нет.

source: Returns most current created ipy shell view or None if there isn't any.
ru: Возвращает актуальный вид оболочки ipy или None, если его нет.

source: Returns most current created debug probe view or None if there isn't any.
fr: Retourne la vue du débogueur avec sonde la plus actuelle créée ou None s'il n'y en a pas.
ru: Возвращает актуальное значение Отладочного зонда или None, если его нет.

source: Restart python shell, optionally showing the Python Shell tool and/or placing keyboard focus on it. Prompts the user first when prompt is True or when prompt is 'pref' and the user has not asked to bypass the prompt.
ru: Перезапустить оболочку Python, опционально показывая инструмент оболочки Python и/или устанавливая на него фокус клавиатуры. Запрашивает сначала пользователя, когда запрос имеет значение True, или когда запрос является 'pref', и пользователь не попросил пропустить запрос.

source: Restart Python Shell?
fr: Redémarrer le Shell Python ?
ru: Перезапустить оболочку Python?

source: Are you sure you want to restart the Python Shell? This clears the shell to blank and restarts the associated Python instance.
fr: Êtes-vous sûr de vouloir redémarrer le Shell Python ? Cela efface le shell entièrement et redémarre l’instance Python associée.
ru: Вы действительно хотите перезапустить оболочку Python? Это полностью очистит окно оболочки и перезапустит связанный экземпляр Python.

source: _Restart Python Shell
fr: Redémarrer le Shell Python
ru: Перезапуск Оболочки Python

source: _Cancel
fr: Annuler
ru: Отмена

source: _Don't prompt before restart
fr: Ne pas demander avant de redémarrer
ru: Не запрашивать перед перезагрузкой

source: Restart python shell.
fr: Redémarrer le shell python.
ru: Перезапустите оболочку python.

source: Kill python shell process.
fr: Tuer le processus du shell Python.
ru: Убить процесс оболочки python.

source: Toggle the active range in the Python Shell: The active range is cleared if already set, or otherwise set using the current editor selection.
ru: Переключение активного диапазона в оболочке Python: активный диапазон очищается, если уже задан, или иным образом устанавливается с помощью текущего выбора редактора.

source: Evaluate the active range in the Python Shell, if any is set
fr: Évaluer la sélection active dans le Shell Python, si existante
ru: Оцените активный диапазон в оболочке Python, если он установлен

source: Show the active range set in the Python Shell in the editor.
ru: Показывать активный диапазон, заданный в оболочке Python в редакторе.

source: Turn on additional logging for diagnosing problems with the debugger
ru: Включение дополнительного ведения журнала для диагностики неполадок в отладчике

source: Turn off additional logging for diagnosing problems with the debugger
ru: Отключение ведения дополнительного журнала диагностики проблем с отладчиком

source: Return the shell that has the focus or None.
fr: Retourne le shell qui a le focus ou None.
ru: Возврат оболочки, которая имеет фокус или нет.

source: Copy text from shell, including all prompts
fr: Copier le text depuis le shell, incluant toutes les invites
ru: Копировать текст из оболочки, включая все подсказки

source: Interupt debugger execution; equivalent to ctrl-c on command line
ru: Прерываем выполнение отладки; эквивалентное сочетание клавиш Ctrl-C в командной строке

source: pos %s-%s
ru: поз %s-%s

source: , line
fr: , ligne
ru: , ряд

source: Restart python shell.
fr: Redémarrer le shell python.
ru: Перезапустите оболочку python.

source: Clear python shell.
fr: Effacer le shell python.
ru: Очистить оболочку python.

source: Toggle the active range in the Python Shell: The active range is cleared if already set, or otherwise set using the current editor selection.
ru: Переключить активный диапазон в оболочке Python: активный диапазон очищается, если он уже установлен или иным образом установлен с использованием текущего выбора редактора.

source: Show the active range set in the IPython tool in the editor.
ru: Отображение активного набора диапазонов в инструменте IPython в редакторе.

source: Connect to an existing kernel specified by the file. The kill current arg specifies if a yes/no dialog it displayed before the current session is abandoned and has 3 value logic that applies only if something has been executed since the session was created or connected: - if true, the current session is killed or disconnected - if false, it's not killed - if None, a yes/no dialog is displayed
ru: Подключитесь к существующему ядру, указанному в файле. Аргумент kill arg указывает, открывается ли диалоговое окно yes/no перед текущим сеансом и имеет 3 значения логики, которые применяются только в том случае, если что-то было выполнено с момента создания или подключения сеанса: -Если true, текущий сеанс будет убит или отключен -Если false, он не будет убит -Если None, отображается диалоговое окно "да/нет"

source: Connect to Existing IPython Kernel
fr: Connecter au noyau IPython existant
ru: Подключение к существующему IPython ядру

source: Disconnect from current session
fr: Déconnecter de la session actuelle
ru: Отключение от текущего сеанса

source: Kill current session
fr: Tuer la session actuelle
ru: Убить текущую сессию

source: The filename for kernel
fr: Le nom de fichier pour le kernel
ru: Имя файла для ядра

source: Kernel Filename
fr: Nom de fichier du kernel
ru: Имя Файла Ядра

source: Cannot Interrupt IPython Kernel::
fr: Ne peut pas interrompre le noyau IPython::
ru: Не удается прервать IPython Kernel::

source: Commands for the debugger's Watch tool (Wing Pro only). These are available only when the watch tool has key board focus.
fr: Commandes pour l'outil Surveillance du débogueur (Wing Professionnel uniquement). Elles sont disponibles seulement lorsque l'outil de surveillance a son focus sur les touches du clavier.
ru: Команды для инструмента Отслеживания отладки (только для Wing Pro). Они доступны только в том случае, если инструмент Отслеживания имеет фокус клавиатуры.

source: Clear selected entry from the watch list
fr: Effacer l'entrée sélectionée de la liste surveillée
ru: Очистить выбранную запись из списка Отслеживания

source: Clear all entries from the watch list
fr: Effacer toutes les entrées de la liste surveillée
ru: Очистить все записи из списка Отслеживания

source: Final Exception:
fr: Exception finale :
