Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_debug_client.po
Languages: ru

source: Determines the network interface on which the debugger listens for connections. This can be a symbolic name, an IP address, or left unspecified to indicate that the debugger should listen on all valid network interfaces on the machine. Note that when a debug session is launched from within the IDE (with the Run button), it always connects from the loopback interface (127.0.0.1)
ru: Определяет сетевой интерфейс, на котором отладчик прослушивает подключения. Это может быть символьное имя, IP-адрес или не указаное значение, указывающее, что отладчик должен прослушивать все допустимые сетевые интерфейсы на компьютере. Обратите внимание, что при запуске сеанса отладки из среды IDE (с помощью кнопки Run), он всегда соединяется с интерфейсом loopback (127.0.0.1)

source: All valid interfaces
ru: Все допустимые интерфейсы

source: This interface
ru: Этот интерфейс

source: Determines the TCP/IP port on which the IDE will listen for the connection from the debug process. This needs to be unique for each developer working on a given host. The debug process, if launched from outside of the IDE, needs to be told the value specified here using kWingHostPort inside wingdbstub.py or by WINGDB_HOSTPORT environment variable before importing wingdbstub in the debug process.
ru: Определяет порт TCP / IP, на котором IDE будет прослушивать соединение из процесса отладки. Оно должно быть уникальным для каждого разработчика, работающего на данном хосте. Для процесса отладки, если он запущен извне IDE, необходимо указать значение, указанное здесь, с помощью команды kWingHostPort внутри wingdbstub.py или переменной среды WINGDB_HOSTPORT перед импортом wingdbstub в процесс отладки.

source: List of host/port combinations that should be included by default in the attach request list shown with Attach to Process in the Debug menu, in addition to those that are registered at runtime. These are used primarily with manual remote debug configuration, and are not necessary when debug is controlled by a remote host configuration. This value corresponds with kAttachPort configured in wingdbstub.py or by WINGDB_ATTACHPORT environment variable before importing wingdbstub in the debug process.
ru: Список комбинаций хостов и портов, которые должны быть включены по умолчанию в список запросов на подключение, показанный с помощью Attach to Process в меню Debug, в дополнение к тем, которые зарегистрированы во время выполнения. Они используются в основном с ручной конфигурацией удаленного отладки и не нужны, если отладка контролируется конфигурацией удаленного хоста. Это значение соответствует kAttachPort, настроенному в файле wingdbstub.py или WINGDB_ATTACHPORT, перед импортом wingdbstub в процесс отладки.

source: IP Address
ru: IP Адрес

source: Enable or disable terminating debug processes that were launched from outside of the IDE. When disabled, Wing just detaches from the process, leaving it running.
ru: Включить или отключить завершение процессов отладки, которые были запущены извне интегрированной среды разработки. При отключении, Wing просто отсоединяется от процесса, оставив его работать.

source: Controls the amount of time that the IDE will wait for the debug process to respond before it gives up. This protects the IDE from freezing up if your program running within the debug process crashes or becomes unavailable. It must also be taken into account when network connections are slow or if sending large data values (see the Huge List Threshold and Hug String Threshold preferences).
ru: Управляет временем, в течение которого среда IDE будет ожидать, пока процесс отладки ответит перед отправкой. Это защищает IDE от зависания, если программа, выполняющаяся в процессе отладки, аварийно завершает работу или становится недоступной. Он также должен учитываться при медленном подключении к сети или при отправке больших значений данных (см. параметры пороговый уровень Huge List Threshold и пороговое значение строки Hug String Threshold ).

source: Defines variable/key names for which values are never shown by the debugger.
ru: Определяет имена переменная/ключ, значения которых никогда не отображаются отладчиком.

source: Defines the character length threshold under which a value will always be shown on a single line, even if the value is a complex type like a list or dict.
ru: Определяет порог длины символа, при котором значение всегда будет отображаться в одной строке, даже если это сложный тип, например, list или dict.

source: Defines the length over which a string is considered too large to fetch for display in the debugger. If this is set too large, the debugger will time out (see the Network Timeout preference).
ru: Определяет длину, по которой строка считается слишком большой для извлечения и отображения в отладчике. Если это слишком велико, отладчик отключится (см. свойство сетевой тайм-аут Network Timeout preference).

source: Set this to true to have the debug server use the __members__ attribute to try to interpret otherwise opaque data values. This is a preference because some extension modules contain bugs that result in crashing if this attribute is accessed. Note that __members__ has been deprecated since Python version 2.2.
ru: Установите для этого значение true, чтобы сервер отладки использовал атрибут __members__, чтобы попытаться интерпретировать другие непрозрачные значения данных. Это предпочтение, потому что некоторые модули расширения содержат ошибки, которые приводят к сбою, если к этому атрибуту обращаются. Обратите внимание, что __members__ устарел с версии 2.2 Python.

source: Number of seconds to wait before the debugger will stop in its own code after a pause request is received and no other Python code is reached.
ru: Количество секунд ожидания до того, как отладчик остановится в своем собственном коде после получения запроса на паузу и не будет достигнут другой код Python.

source: Sets the tracking style used when a value is double clicked in order to watch it. Values may be tracked by symbolic name, by object reference and attribute by name, and by direct object reference.
ru: Устанавливает стиль отслеживания, используемый при двойном щелчке значения, чтобы посмотреть его. Значения могут отслеживаться символьным именем, ссылкой на объект и атрибутом по имени, а также с помощью ссылки на прямые объекты.

source: Symbolic name
ru: Символьное имя

source: Parent reference + name
ru: Родительская ссылка + имя

source: Direct object reference
ru: Прямая ссылка на объект

source: Search Registry for Python
ru: Поиск реестра для Python

source: Search PATH for 'python'
ru: Поиск PATH для 'python'

source: Sets the default Python Executable to use for debugging and source code analysis. This can be overridden on a project by project basis in Project Properties.
ru: Устанавливает исполняемый файл Python по умолчанию для использования, отладки и анализа исходного кода. Можно переопределить в свойствах проекта.

source: Specify:
ru: Определить:

source: Select the display style for integer values.
ru: Выберите стиль отображения для целочисленных значений.

source: Decimal
ru: 10-чный

source: Hex
ru: 16-чный

source: Octal
ru: 8-чный

source: Controls whether or not time out, huge value, and error handling value errors are displayed by the debugger the first time they are encountered in each run of Wing.
ru: Определяет, является ли тайм-аут, огромным значением и значения обработки ошибок отображаются отладчиком при первом их обнаружении в каждом запуске Wing.

source: The color of the text highlight used for the run position during debugging
ru: Цвет подсветки текста, используемого для позиции выполнения во время отладки

source: Select transparency (0-160) of the text highlight used for the run position during debugging
ru: Выберите прозрачность (0-160) для выделения текста, используемого для положения run во время отладки

source: Opaque
ru: Непрозрачный

source: Alpha:
ru: Альфа:

source: This is used to obtain verbose information about debugger internals in cases where you are having problems getting debugging working. The resulting log file can be emailed to support@wingware.com along with your bug report for interpretation. Logging can be disabled, or sent to stderr, stdout, or a file. When enabled, the debugger will run more slowly.
ru: Используется для получения подробных сведений о внутренних отладчиках в случаях, когда возникают проблемы при отладке работы. Результирующий лог-файл может быть отправлен на support@wingware.com вместе с отчетом об ошибке для интерпретации. Ведение журнала может быть отключено или отправлено в stderr, stdout или файл. Если этот параметр включен, отладчик будет работать медленнее.

source: No logging
ru: Без регистрации

source: Log to sys.stderr
ru: Вход в систему sys.stderr

source: Log to sys.stdout
ru: Вход в систему sys.stdout

source: Log to file:
ru: Вход в файл:

source: This is used to turn on very verbose and detailed logging from the debugger. This should only be enabled at the request of Wingware Technical Support and will drastically slow down the debugger.
ru: Используется для включения ведения очень подробного журнала для отладчика. Должно быть включено только по просьбе технической поддержки Wingware и будет резко замедлять отладчик.

source: This is used to obtain verbose information about the Python Shell internals in cases where you are having problems getting it working. The resulting log file can be emailed to support@wingware.com along with your bug report for interpretation. Logging can be disabled, or sent to stderr, stdout, or a file. When enabled, the Python Shell will run more slowly.
ru: Это используется для получения подробной информации о внутренних компонентах Python в случаях, когда у вас возникают проблемы с ее работой. Полученный файл журнала можно отправить по электронной почте на адрес support@wingware.com вместе с отчетом об ошибке для интерпретации. Ведение журнала может быть отключено или отправлено на stderr, stdout или файл. Когда включено, Python Shell будет работать медленнее.

source: This is used to turn on very verbose and detailed logging from the Python Shell internals. This should only be enabled at the request of Wingware Technical Support and will drastically slow down the Python Shell.
ru: Используется для включения очень подробного ведения журнала из внутренних компонентов Python. Должно быть включено только по запросу технической поддержки Wingware и значительно замедлит работу оболочки Python.

source: Selects whether to use the integrated Debug I/O tool for debug process input/output or an external DOS Command prompt window when running. on Windows. Use an external window if your debug process depends on details of the command prompt environment for cursor movement, color text, etc.
ru: Выбор использования встроенного средства DebugI/O для процесса отладки input/output или внешнего окна DOS командной строки при запуске в Windows. Используйте внешнее окно, если процесс отладки зависит от деталей командной строки, для перемещения курсора, цветового текста и т. д.

source: Selects whether to use the integrated Debug I/O tool for debug process input/output or an external terminal window. Use an external window if your debug process depends on details of the command prompt environment for cursor movement, color text, etc.
ru: Выбор использования встроенного средства отладки ввода/вывода для процесса отладки входных/выходных данных или внешнего окна терминала. Используйте внешнее окно, если процесс отладки зависит от деталей командной строки, для перемещения курсора, цветового текста и т. д.

source: Determines whether to leave up the console after normal program exit, or to close the console right away in all cases. This is only relevant when running with an external native console instead of using the integrated Debug I/O tool.
ru: Определяет, следует ли оставлять консоль после выхода из обычной программы или сразу же закрыть консоль во всех случаях. Это актуально только при работе с внешней встроенной консолью вместо использования встроенного средства Debug I/O .

source: Enables line wrapping in the integrated Debug I/O tool.
ru: Включает перенос строк в интегрированном инструменте ввода-вывода Debug I/O.

source: Enables line wrapping in the Python Shell.
ru: Включает перенос строк в оболочке Python.

source: Enable to filter shell history traversal when something is entered prior to starting traversal. When enabled, Wing will only show history items starting with the text between the start of the current item and the caret.
ru: Включите фильтрацию обхода журнала оболочки, когда что-то вводится до начала обхода. Если включено, Wing будет показывать только элементы истории, начиная с текста между началом текущего элемента и концом строки.

source: Auto-restart the Python Shell before a file is evaluated within it. When this is disabled, be aware that previously defined symbols will linger in the Python Shell environment.
ru: Авто-перезапуск оболочки Python перед тем, как файл будет оцениваться внутри неё. Если отключено, имейте в виду, что ранее определенные символы будут задерживаться в среде оболочки Python.

source: Evaluate whole lines from editor rather than the exact selection, when a selection from the editor is sent to the Python Shell tool.
ru: Оцените целые строки из редактора, а не точный выбор, когда выбор из редактора отправляется в инструмент Python Shell.

source: Set to False so that shells will act modal in the same way as editors when working with a modal key bindings such as that for VI. When True, the shells always act as if in Insert mode.
ru: Установите значение False, чтобы оболочки работали модально так же, как и редакторы при работе с привязками модальных клавиш, например, для VI. Когда True, оболочки всегда действуют как в режиме Вставки.

source: The number of lines after which the Python Shell will just print a summary rather than the actual lines of code pasted, dragged, or other transferred to the shell.
ru: Количество строк, после которых оболочка Python будет просто печатать сводку, а не фактические строки кода, вставленные, перетаскиваемые или другие, перенесенные в оболочку.

source: Whether to always execute immediately after text is pasted into a shell. Note that if the number of lines exceed the pasted line threshold, the lines are immediately executed.
ru: Следует ли всегда выполнять код сразу после вставки текста в оболочку. Обратите внимание, что если количество строк превышает пороговое значение, код выполняются немедленно.

source: Used internally to show information about exception handling to new users. Once turned off, it is never turned on again
ru: Используется для отображения информации об обработке исключений для новых пользователей. Когда он выключен, он никогда не включается снова

source: Enable to automatically clear the Debug I/O tool each time a new debug session is started
ru: Включить автоматическую очистку инструмента Debug I/O каждый раз, когда запускается новый сеанс отладки

source: Never Auto-Show
ru: Никогда Авто-Шоу

source: Auto-Show on First Output
ru: Автоматическое отображение на первом выходе

source: Always Auto-Show on Output
ru: Всегда автотображение на выходе

source: Controls whether and when to automatically show the Debug I/O tool when it receives output.
ru: Определяет, следует ли автоматически отображать средство отладки ввода-вывода при получении выходных данных.

source: Names of builtin exceptions to never report, even if the exception is not handled. This list takes precedence over the Always Report preference and the Report Exceptions preference when it is set to a value other than Always Immediately.
ru: Имена встроенных исключений никогда не сообщать, даже если исключение не обрабатывается. Этот список имеет приоритет над предпочтением «Всегда отчет» и предпочтением «Исключения отчетов», если для него установлено значение, отличное от «Всегда немедленно».

source: Names of builtin exceptions to (nearly) always report. These exceptions are not reported only if they are explicitly caught by the specific subclass in the same frame in which they are raised.
ru: Имена встроенных исключений (почти) всегда сообщаются. Эти исключения не сообщаются только в том случае, если они явно перехвачены конкретным подклассом в том же фрейме, в котором они были подняты.

source: Disabled
ru: Отключено

source: Symbols Only
ru: Только Символы

source: All (Use with Caution!)
ru: Все (используйте с осторожностью!)

source: Controls whether debug values are shown when the mouse hovers over a selection in the editor. This may be disabled, enabled for symbols (like x.y.z) only, or enabled for all selections including function or methods calls. WARNING: Enabling evaluation of any selection may result in function or method calls that have side effects such as altering the program state or even making unintended database or disk accesses!
ru: Управляет отображением отладочных значений при наведении указателя мыши на выделение в редакторе. Это может быть отключено, включено только для символов (например, x.y.z) или включено для всех выборов, включая вызовы функций или методов. ПРЕДУПРЕЖДЕНИЕ: Включение оценки любого выбора может привести к вызову функций или методов, которые имеют побочные эффекты, такие как изменение состояния программы или даже непреднамеренной доступ к базе данных или диску!

source: Enable to display debug data values for any symbol on the editor when the mouse cursor hovers over it.
ru: Позволяет отображать значения отладочной информации для любого символа в редакторе, когда курсор мыши на него наводится.

source: Set to introspect live Python runtimes for information displayed in autocompletion, the Source Assistant, and debug data value tooltips. Runtimes introspected include the Python Shell and live debug processes stopped at an exception or breakpoint.
ru: Установите для интроспекции реального времени исполнения Python для информации, отображаемой в подсказках автозаполнения, Source Assistant и всплывающих подсказок. Внедренные Runtimes включают оболочку Python и текущие процессы отладки, остановленные в исключении или точке останова.

source: Set to show property values in the debug data views. This should be used with caution. It enables invocation of the fget() method on the property, which in some code bases can execute unwanted code, make unexpected changes to runtime state, hang on lengthy computations, trigger thread deadlocks, or crash on buggy user code while debug data is being displayed in the IDE.
ru: Установите для отображения значений свойств в представлениях отладочной информации. Следует использовать с осторожностью. Позволяет вызвать метод fget() в свойстве, который в некоторых базовых кодах может выполнять нежелательный код, непредсказуемые изменения состояния выполнения, зависание на длинных вычислениях, триггер замещения потоков или сбой при работе с ошибкой кода пользователя, в то время как данные отладки отображается в среде IDE.

source: Enable to allow Python code and other dynamic calls to be invoked while inspecting data in the debugger, for display in any part of the IDE's user interface. This should be used with caution because it can cause the debug process to execute unwanted code, make unexpected changes to runtime state, hang on lengthy computations, deadlock threads, or crash in buggy code.
ru: Включить возможность вызова кода Python и других динамических вызовов при проверке данных в отладчике для отображения в любой части интерфейса пользователя IDE. Это следует использовать с осторожностью, поскольку может привести к тому, что процесс отладки будет выполнять нежелательный код, внесет непредвиденные изменения в состояние выполнения, зависает на длинных вычислениях, потоках взаимоблокировки или сбой в buggy-коде.

source: Allow __repr__ methods implemented in Python to be invoked. Disable this if the __repr__ methods take too long to complete or fail due to other bugs.
ru: Разрешить методы __repr__, реализованные в Python для вызова. Отключите это, если методы __repr__ занимают слишком много времени для завершения или сбоя из-за других ошибок.

source: Whether to inspect base classes for class attributes. Disable this to work around crashing in packages such as openerp and odoo.
ru: Нужно ли проверять базовые классы для атрибутов класса. Отключите это, чтобы вызвать сбой в пакетах, таких как openerp и odoo.

source: Enable to maintain a history of Debug I/O, up to the number configured in the Files > Max Recent Items preference.
ru: Включить поддержку истории Debug I/O, до номера, настроенного в настройках Files> Max Recent Items.

source: Enable to include child processes in the process selector popup.
ru: Включить дочерние процессы во всплывающем окне выбора процесса.

source: Console default (%s)
ru: Консоль по умолчанию (%s)

source: Encoding of input/output in the Debug I/O panel
ru: Кодирование ввода/вывода на панели Debug I/O

source: Always
ru: Всегда

source: Only if Single-Threaded
ru: Только если Однопоточный

source: Never
ru: Никогда

source: Controls when the debugger periodically flushes I/O sent to sys.stdout and sys.stderr. Doing so may deadlock in some code. Not doing so may not display text that has been output without newline.
ru: Управляет, когда отладчик периодически сбрасывает ввод-вывод, отправляемый в sys.stdout и sys.поток stderr. Это может привести к блокировке некоторого кода. При этом не может отображаться текст, выводимый без новой строки.

source: Use default stdin / stdout encoding
ru: Использовать стандартную кодировку stdin / stdout

source: Encoding of input/output in the integrated Python Shell
ru: Кодирование ввода / вывода в интегрированной оболочке Python

source: Enable to display a dialog when the Python Shell state no longer matches the configured Python Executable and/or Python Path.
ru: Включить отображение диалогового окна, когда состояние оболочки Python больше не соответствует настроенному Python Executable и/или Python Path.

source: Enable to set current directory in the Python Shell to the directory of the active editor.
ru: Включите установку текущего каталога в оболочке Python в каталог активного редактора.

source: Selects the file to use for storing and retrieving shared launch configurations. By default the file 'launch' in the user settings directory is used.
ru: Выбирает файл для хранения и получения общих конфигураций запуска. По умолчанию используется файл «launch» в каталоге настроек пользователя.

source: Default
ru: Умолчание

source: File:
ru: Файл:

source: Enable to indicate projects files in the the debug stack, in the stack selector, Stack Data, and Exception tools.
ru: Включить, чтобы указать файлы проектов в стеке отладки, в селекторе стека, средствах Stack Data и Exception.

source: Prompt for Action
ru: Приглашение к действию

source: Cancel Debug
ru: Отменить отладку

source: Debug Anyway
ru: Отладка в любом случае

source: Controls whether to start debugging if the defined build process fails
ru: Определяет, следует ли запускать отладку при сбое определенного процесса построения

source: Leave Other Processes Running
ru: Оставить другие процессы запущенными

source: Kill Entire Process Group
ru: Убить всю группу процессов

source: Prompt For Action When a Process is Killed
ru: Запрашивать действие при завершении процесса

source: How to terminate debug when a parent process or child process is terminated. A process group includes any all parent and child processes, up to the initially launched process, including also grand-children and any other descendent process.
ru: Как завершить отладку при завершении родительского процесса или дочернего процесса. Группа процессов включает все родительские и дочерние процессы, вплоть до изначально запущенных процессов, в том числе внуков и других потомков процесса.
