Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit.po
Languages: de, fr, ru

source: Enable this to process input line edits locally, so that the line is executed only after Enter is pressed; disable it to work in unbuffered character mode, which sends each typed character to the sub-process as it comes in. Note: Disabling this may not work for some processes; only a _very_ limited subset of tty emulation is supported. Using command line flags to disable color and other features in the sub-process may help.
fr: Activer ceci pour éditer les lignes d'entrées localement, ainsi la ligne est exécutée après qu'Entrée soit pressé ; le désactiver pour travailler en mode de caractère sans mémoire tampon, qui envoit chaque caractère tapé au sous-processus comme il vient. Note : Désactiver ceci peut ne pas fonctionner pour certains processus ; seulement un nombre __très__ limité de sous-ensembles d'émulation tty est supporté. Utiliser les drapeaux de ligne de commande pour désactiver les couleurs et autres caractéristiques dans le sous-processus peut aider.
ru: Включите эту функцию для локальной обработки изменений входной строки, чтобы строка выполнялась только после нажатия клавиши Enter; отключите ее для работы в режиме без добавления символа, который отправляет каждый введенный символ подпроцессу по мере его поступления. Примечание: Отключение этого может не работать для некоторых процессов; поддерживается только _very_ limited подмножество эмуляции tty. Может помочь использование флагов командной строки для отключения цвета и других функций в подпроцессе.

source: Auto-save Files Before Execution
de: Vor dem Ausführen automatisch speichern
fr: Auto-enregistrement des fichiers avant exécution

source: Enable this to auto-save all open files before starting execution of the command.
fr: Permet l'auto-enregistrement de tous les fichiers ouverts avant le lancement de la commande d'exécution.
ru: Включите эту опцию для автоматического сохранения всех открытых файлов перед началом выполнения команды.

source: Key Binding
de: Tastenzuordnung
fr: Raccourcis clavier
ru: Привязка клавиш

source: Press the desired key sequence to bind to this command.
fr: Presser la séquence de touches désirée pour la relier à cette commande.
ru: Нажмите нужную последовательность клавиш, чтобы выполнить привязку к этой команде.

source: Set this to automatically show the OS Commands tool when the command is executed.
fr: Affiche automatiquement l'outil commandes de l’OS quand la commande est exécutée.
ru: Установите это, чтобы автоматически показывать инструмент «Команды ОС» при выполнении команды.

source: I/O Encoding
de: I/O Kodierung
fr: Encodage d'E/S
ru: I/O Кодировка

source: Use this to specify the encoding of text sent to and from the sub-process.
fr: Utiliser ceci pour spécifier l'encodage du texte envoyé vers et depuis les sous-processus.
ru: Используйте для указания кодировки текста, отправленного в подпроцесс и из него.

source: Command Line
de: Kommandozeile
fr: Ligne de commande
ru: Командная строка

source: The PYTHONPATH to set when running this command. The path separator is "%s". If unspecified, the PYTHONPATH Wing inherits at startup is used. $(ENV) formatted variables may be used to insert values from the environment and special variables.
fr: Le PYTHONPATH à affecter lorsqu'il exécute cette commande. Le séparateur de chemin est "%s". Si non spécifié, le PYTHON PATH que Wing hérite au démarrage est utilisé. Les variables formattées $(ENV) peuvent être utilisées pour insérer des valeurs depuis l'environnement et des variables spéciales.
ru: PYTHONPATH для установки при выполнении этой команды. Сепаратором пути является "%s". Если не указано, используется наследование PYTHONPATH Wing при запуске. $(ENV) форматированные переменные могут использоваться для вставки значений из среды и специальных переменных.

source: Environment variables to set before running this command. Entries are in "name=value" format, one per line. Use "name=" (without a value) to unset and remove an inherited environment value. If unspecified, the environment Wing inherits at startup is used.
fr: Variables d'environnement à affecter avant de lancer cette commande. Les entrées sont dans le format "name=value", une par ligne. Utiliser "name=" (sans aucune valeur) pour désaffecter et retirer une valeur d'environnement héritée. Si non-spécifié, l'environnement Wing hérité au démarrage est utilisé.
ru: Переменные среды, которые нужно задать перед выполнением этой команды. Записи в формате "имя = значение", по одному на строку. Используйте "name=" (без значения), чтобы отменить и удалить унаследованное значение среды. Если не указано, используется среда Wing, наследуемая при запуске.

source: Remote
fr: Distant
ru: Удаленный

source: Named Entry Point: %s
de: Benannter Einsprungspunkt: %s
fr: Point d'entrée nommé : %s
ru: Именованная Точка Входа: %s

source: Entry Point
de: Einsprungspunkt
fr: Point d'entrée
ru: Точка входа

source: The named entry point to launch
de: Der zu startende benannte Einsprungspunkt
fr: Le point d'entrée nommé à lancer
ru: Именованная точка входа для запуска

source: No File Name
de: Kein Dateiname
fr: Pas de nom de fichier
ru: Нет имени файла

source: Please select a file before configuring the environment
fr: Veuillez sélectionner un fichier avant de configurer l'environnement
ru: Пожалуйста, выберите файл перед настройкой среды

source: Python File
de: Python-Datei
fr: Fichier Python
ru: Файл Python

source: The Python file to run within the default launch configuration specified in its File Properties
fr: Le fichier Python à lancer avec le lancement de configuration spécifié par défaut dans ces propriétés de fichier
ru: Файл Python для запуска в конфигурации запуска по умолчанию, указанной в свойствах файла

source: OS Command Properties: %s
fr: Propriétés des commandes de l’OS : %s
ru: Свойства Команды ОС: %s

source: Test Execution: %s
de: Testausführung: %s
fr: Exécution du test : %s
ru: Выполнение теста: %s

source: Definition
fr: Définition
ru: Определение

source: Environment
de: Umgebung
fr: Environnement
ru: Окружение

source: Initial directory '%s' does not exist
de: Startverzeichnis '%s' existiert nicht
fr: Le répertoire initial '%s' n'existe pas
ru: Исходный каталог '%s' не существует

source: Initial directory '%s' is not a directory
de: Startverzeichnis '%s' ist kein Verzeichnis
fr: Le répertoire initial '%s' n'est pas un répertoire
ru: Исходный каталог '%s' не является каталогом

source: No Python file was selected
de: Es wurde keine Python-Datei ausgewählt
fr: Aucun fichier Python n'a été sélectionné
ru: Файл Python не выбран

source: The file '%s' does not exist
de: Die Datei '%s' existiert nicht
fr: Le fichier '%s' n'existe pas
ru: Файл '%s' не существует

source: The file '%s' is a directory
de: Die Datei '%s' ist ein Verzeichnis
fr: Le fichier '%s' n'est pas un répertoire
ru: Файл '%s' является каталогом

source: The file '%s' is not a Python file
de: Die Datei '%s' ist keine Python-Datei
fr: Le fichier '%s' n'est pas un fichier Python
ru: Файл '%s' не является файлом Python

source: PYTHONPATH entry '%s' does not exist
de: PYTHONPATH Eintrag '%s' existiert nicht
fr: l’entrée PYTHONPATH ‘%s’ n’existe pas
ru: Запись PYTHONPATH '%s' не существует

source: PYTHONPATH entry '%s' is not a directory
de: PYTHONPATH Eintrag '%s' ist kein Verzeichnis
fr: l’entrée PYTHONPATH ‘%s’ n’est pas un répertoire
ru: Запись PYTHONPATH '%s' не является каталогом

source: Env entry %s is invalid
fr: L’entrée Env %s est invalide
ru: Запись Env %s является недействительной

source: The command line is empty
de: Die Kommandozeile ist leer
fr: La ligne de commande est vide
ru: Командная строка пуста

source: Save Session
de: Sitzung speichern
fr: Enregistrement de la session
ru: Сохранить сеанс

source: Choose file to which to save the session:
de: Datei auswählen, in welcher die Sitzung gespeichert werden soll:
fr: Choisir le fichier d'enregistrement de la session :
ru: Выберите файл для сохранения сеанса:

source: Execute current command
de: Aktuelles Kommando ausführen
fr: Exécuter la commande courante
ru: Выполнить текущую команду

source: Terminate current command
de: Aktuelles Kommando abbrechen
fr: Terminer la commande courante
ru: Завершить текущую команду

source: Create new command
de: Neues Kommando erstellen
fr: Créer une nouvelle commande
ru: Создать новую команду

source: Edit current command
de: Aktuelles Kommando bearbeiten
fr: Éditer la commande courante
ru: Изменить текущую команду

source: Delete current command
de: Aktuelles Kommando löschen
fr: Supprimer la commande courante
ru: Удалить текущую команду

source: Execute
de: Ausführen
fr: Exécuter
ru: Выполнить

source: Terminate
de: Abbrechen
fr: Terminer
ru: Прекратить

source: Create
de: Erstellen
fr: Créer
ru: Создать

source: OS Commands state
fr: État des commandes de l’OS
ru: Состояние Команд ОС

source: This command is used as a build command in this project. If you delete it, the build command will also be deleted. Are you sure you want to delete it?
fr: Cette commande est utilisée comme une commande de construction dans ce projet. Si vous la supprimer, la commande de construction sera aussi supprimée. Êtes-vous sûr de vouloir la supprimer ?
ru: Эта команда используется в качестве команды сборки в этом проекте. Если удалить её, команда build также будет удалена. Вы уверены, что хотите удалить её?

source: Delete Command?
de: Befehl löschen?
fr: Supprimer la commande ?
ru: Удалить команду?

source: Are you sure you want to delete command %s?
de: Sind Sie sicher, dass Sie den Befehl '%s löschen wollen?
fr: Êtes-vous sûr de vouloir supprimer la commande %s ?
ru: Вы уверены, что хотите удалить команду %s?

source: _Delete Command
de: Kommando _entfernen
fr: _Supprimer la commande
ru: Удалить команду

source: Command
de: Kommando
fr: Commande
ru: Команда

source: _Terminate %s
de: %s a_bbrechen
fr: _Terminer %s
ru: Прервать %s

source: _Restart %s
de: %s _neu starten
fr: _Redémarrer %s
ru: Перезапуск %s

source: _Execute %s
de: %s _ausführen
fr: _Exécuter %s
ru: Выполнить %s

source: _New: Command Line...
de: _Neu: Kommandozeile...
fr: _Nouveau : ligne de commande...
ru: Новое: Командная Строка...

source: _New: Python File...
de: _Neu: Python-Datei...
fr: _Nouveau : Fichier Python...
ru: Новое: Файл Python...

source: _New: Named Entry Point...
de: _Neu: Benannter Einsprungspunkt...
fr: _Nouveau : point d'entrée nommé...
ru: Новое: Именованная точка входа...

source: E_dit %s...
de: %s _bearbeiten...
fr: É_diter %s...
ru: Редактировать %s...

source: Re_move %s
de: %s _entfernen
fr: Re_tirer %s
ru: Удалить %s

source: _Hide Toolbox
de: Werkzeugkasten _ausblenden
fr: Masquer la boite à outils
ru: Скрыть панель инструментов

source: _Show Toolbox
de: Werkzeugkasten _einblenden
fr: _Afficher la boite à outils
ru: Показать панель инструментов

source: _Clear Console
de: Konsole _leeren
fr: _Effacer la console
ru: Очистить консоль

source: A_uto-clear Consoles
de: Konsolen a_utomatisch leeren
fr: Auto-effacement des consoles
ru: Автоочистка консолей

source: Automatically clear past history from a console when a process is started/restarted
fr: Effacer automatiquement l'historique d'une console lorsqu'un processus est démarré/redémarré
ru: Автоматическое удаление истории из консоли при запуске/перезапуске процесса

source: Python Prompt after Execution
de: Python Eingabeaufforderung nach der Ausführung
fr: Invite de commande Python après exécution
ru: Запрос Python после выполнения

source: When executing Python files, remain at the Python prompt after the file has finished executing, rather than terminating Python. This is the same as the -i command line option for Python.
fr: Lors de l'exécution de fichiers Python, rester à l'invite de Python après que le fichier ait finit d'être exécuté, plutôt que terminer Python. C'est comme l'option de ligne de commande -i pour Python.
ru: При выполнении файлов Python оставайтесь в приглашении Python после завершения файла, а не завершая Python. Это то же самое, что и параметр командной строки -i для Python.

source: Wrap Long Lines
de: Lange Zeilen umbrechen
fr: Retour à la ligne automatique des longues lignes
ru: Перенос Длинных строк

source: Wrap long output lines to fit in available display area.
de: Lange Ausgabezeilen umbrechen, damit diese in den Anzeigebereich passen.
fr: Retour à la ligne automatique des longues lignes de sortie pour s'adapter à la zone d'affichage disponible.
ru: Перенос длинных выходные строки, чтобы они поместились в доступной области отображения.

source: Show OS Commands Documentation
fr: Afficher la documentation des commandes de l’OS
ru: Показать документацию по Командам ОС

source: Process terminated with an exit code of %s
de: Prozess mit Exit-Code %s beendet
fr: Processus terminé avec un code de sortie de %s
ru: Процесс завершается с кодом выхода из %s

source: Process failed to start
de: Start des Prozesses fehlgeschlagen
fr: Échec du démarrage du processus
ru: Не удалось запустить процесс

source: New: Command Line...
de: Neu: Kommandozeile...
fr: Nouveau : ligne de commande...
ru: Новое: Командная Строка...

source: New: Python File...
de: Neu: Python-Datei...
fr: Nouveau : Fichier Python...
ru: Новое: Файл Python...

source: New: Named Entry Point...
de: Neu: Benannter Einsprungspunkt...
fr: Nouveau : point d'entrée nommé...
ru: Новое: Именованная точка входа...

source: C_opy
de: _Kopieren
fr: C_opier
ru: Копировать

source: _Paste
de: _Einfügen
fr: _Coller
ru: Вставить

source: C_lear Console
de: Konsole _leeren
fr: E_ffacer la console
ru: Очистить Консоль

source: Send Ctrl-_C (SIGINT)
de: Strg-_C senden (SIGINT)
fr: Envoyer Ctrl-_C (SIGINT)
ru: Передать Ctrl-C (SIGINT)

source: Send Ctrl-_D (EOF)
de: Strg-_D senden (EOF)
fr: Envoyer Ctrl-_D (EOF)
ru: Передать Ctrl-D (EOF)

source: Send Ctrl-_Z (SIGSTOP)
de: Strg-_Z senden (SIGSTOP)
fr: Envoyer Ctrl-_Z (SIGSTOP)
ru: Передать Ctrl-Z (SIGSTOP)

source: _Save a Copy...
de: _Als Kopie speichern...
fr: _Enregistrer une copie...
ru: Сохранить копию...

source: OS Commands
de: Betriebssystem Befehle
fr: Commandes de l’OS
ru: Команды ОС

source: Operating System Commands
de: Betriebssystem Befehle
fr: Commandes du système d'exploitation
ru: Команды операционной системы

source: Symbol
fr: Symbole
ru: Символ

source: Invoking
de: Aufrufen
fr: Appel
ru: Вызов

source: Python Keyword
de: Python-Schlüsselwort
fr: Mot-clé Python
ru: Ключевое слово Python

source: Completion
de: Beendigung
fr: Complétion
ru: Завершение

source: Defining
de: Definieren
fr: Définir
ru: Определяющий

source: Not Python code
de: Kein Python-Code
fr: Pas du code Python
ru: Не код Python

source: No selected file
de: Keine Datei ausgewählt
fr: Pas de fichier sélectionné
ru: Нет выбранного файла

source: No selected value
de: Kein Wert ausgewählt
fr: Pas de valeur sélectionnée
ru: Не выбранное значение

source: No symbol at cursor
de: Kein Symbol am Cursor
fr: Pas de symbole au curseur
ru: Нет символа в курсоре

source: Introspection disabled
fr: Introspection désactivée
ru: Интроспекция отключена

source: Invalid source code
de: Ungültiger Source-Code
fr: Code source invalide
ru: Недопустимый исходный код

source: Cannot determine type
de: Typ konnte nicht ermittelt werden
fr: Impossible de déterminer le type
ru: Невозможно определить тип

source: Likely type
de: Wahrscheinliche Art
fr: Type vraisemblable
ru: Вероятный Тип

source: Runtime type
de: Laufzeitart
fr: Type d'exécution
ru: Тип среды выполнения

source: <i>or</i>
de: <i>oder</i>
fr: <i> ou </i>

source: <i>Returns:</i> %s
de: <i>Rückgabe:</i> %s
fr: <i> Retourne : </i> %s
ru: <i>Возвращает:</i> %s

source: Go to %s, line %s
de: Gehe zu %s, Zeile %s
fr: Aller à %s, ligne %s
ru: перейти к %s, строке %s

source: Source Symbol Point of Definition Information
de: Informationen des Definitionspunktes des Source-Symbols
fr: Information de défintion des symboles source
ru: Исходный символ точки определения информации

source: Rewrapped
fr: Replié
ru: Переупаковка

source: Plain Text
de: Normaler Text
fr: Texte plein
ru: Обычный Текст

source: a {}{} instance
fr: une instance {}{}

source: of
fr: de

source: attribute
fr: attribut

source: Copy Text to Clipboard
de: Text in die Zwischenablage kopieren
fr: Copier le texte dans le presse-papier
ru: Копировать текст в буфер обмена

source: Copy HTML to Clipboard
de: HTML in die Zwischenablage kopieren
fr: Copier le HTML dans le presse-papier
ru: Копировать HTML в буфер обмена

source: Use PEP 287 for docstrings
de: PEP 287 für docstrings benutzen
fr: Utiliser PEP 287 pour les docstrings
ru: Используйте PEP 287 для docstrings

source: Show PEP 287 parse errors
de: PEP 287 Fehler anzeigen
fr: Afficher les erreurs d’analyse PEP 287
ru: Показать анализ ошибки PEP 287

source: Always show docstrings
de: Docstrings immer anzeigen
fr: Toujours afficher les docstrings
ru: Всегда показывают комментарии

source: Show docstring type and validity
de: Docstring Typ und Gültigkeit anzeigen
fr: Afficher le type et la validité du docstring
ru: Показать тип и срок действия docstring

source: Smaller Font
de: Kleinere Schriftart
fr: Police plus petite
ru: Уменьшенный шрифт

source: Larger Font
de: Größere Schriftart
fr: Police plus grande
ru: Увеличенный шрифт

source: Show Source Assistant Documentation
de: Dokumentation des Source-Assistenten anzeigen
fr: Afficher la documentation de l'assistant source
ru: Показать Документацию Помощника Источника

source: No Active Editor
de: Kein aktiver Editor
fr: Pas d'éditeur actif
ru: Нет Активного Редактора

source: Could not paste the selected snippet because there is no active editor
fr: N'a pas pu coller le bout de code sélectionné car il n'y a pas d'éditeur actif
ru: Не удалось вставить выбранный фрагмент, так как нет активного редактора

source: Snippets
de: Schnipsel
fr: Bouts de code
ru: Фрагменты

source: Snippet Manager
de: Schnipsel-Manager
fr: Gestionnaire de bouts de code
ru: Менеджер Фрагментов

source: Snippet Name
de: Schnipsel-Name
fr: Nom du bout de code
ru: Имя Фрагмента

source: Mime Type
de: Mime-Typ
fr: Type Mime

source: File Extension
de: Datei-Erweiterung
fr: Extension de fichier
ru: Расширение файла

source: Add Snippet
de: Schnipsel hinzufügen
fr: Ajouter un bout de code
ru: Добавить Фрагмент

source: Assign Snippet Key Binding
fr: Assigner un raccourci clavier à un bout de code
ru: Назначить Привязку Ключа Фрагмента Кода

source: Snippet manager state
de: Zustand des Schnipsel-Managers
fr: État du gestionnaire de bouts de code
ru: Состояние диспетчера фрагментов

source: Context
de: Kontext
fr: Contexte
ru: Контекст

source: Mime type: %s
de: Mime-Typ: %s
fr: Type Mime : %s

source: Remove all snippets of type %s?
de: Alle Schnipsel vom Typ '%s' entfernen?
fr: Enlever tous les bouts de code de type %s ?
ru: Удалить все фрагменты типа %s?

source: The directory %s contains some snippets. Are you sure you want to move all of these snippets to the trash?
fr: Le répertoire %s contient des bouts de code. Êtes-vous sûr de vouloir déplacer tous ses bouts de code vers la corbeille ?
ru: Каталог %s содержит некоторые фрагменты. Вы уверены, что хотите переместить все эти фрагменты в корзину?

source: File Type Exists::The file type '%s' already exists. Please rename or remove it first.
de: Dateityp existiert::Der Dateityp '%s' existiert bereits. Bitte erst umbenennen oder entfernen.
fr: Type de fichier existant::Le type de fichier '%s' existe déjà. Veuillez d'abord le renommer ou le retirer.
ru: Тип файла существует :: Тип файла '%s' уже существует. Сначала переименуйте или удалите его.

source: Delete Existing Snippets?
de: Vorhandene Schnipsel löschen?
fr: Supprimer les bouts de code existants ?
ru: Удалить существующие фрагменты?

source: Are you sure you want to delete your existing snippets and restore factory defaults? Any changes you have made to snippets and any new snippets you have added will be lost.
fr: Êtes-vous sûr de vouloir supprimer tous les bouts de code existants et restaurer les paramètres d’origine ? Tout changement que vous avez faits à des bouts de code et tout nouveau bout de code que vous avez ajouté seront perdus.
ru: Вы действительно хотите удалить существующие фрагменты и восстановить заводские настройки по умолчанию? Любые изменения, внесенные вами в фрагменты и любые новые фрагменты, которые вы добавили, будут потеряны.

source: Could not read default snippet %s
de: Konnte Standard-Schnipsel %s nicht lesen
fr: N’a pas pu lire le bout de code par défaut %s
ru: Не удалось прочитать фрагмент по умолчанию %s

source: Snippets Failed to Copy
de: Schnipsel die nicht kopierten werden konnten
fr: Échec de copie des bouts de code
ru: Не удалось скопировать фрагменты

source: Snippet already exists
de: Schnipsel existiert bereits
fr: Bout de code déjà existant
ru: Фрагмент уже существует

source: The snippet '%s' already exists in %s. Do you want to open the existing file?
de: Der Schnipsel '%s' ist bereits in Datei %s vorhanden. Wollen Sie die vorhandene Datei öffnen?
fr: Le bout de code '%s' existe déjà dans %s. Voulez vous ouvrir le fichier existant ?
ru: Фрагмент '%s' уже существует в %s. Вы хотите открыть существующий файл?

source: Remove Disk File?
de: Datei auf Festplatte löschen?
fr: Enlever le fichier du disque ?
ru: Удалить Файл С Диска?

source: Are you sure you want to move the snippet '%s' in %s to the trash?
de: Wollen Sie den Schnipsel '%s' in %s wirklich in den Papierkorb verschieben?
fr: Êtes-vous sûr de vouloir déplacer le bout de code '%s' dans %s vers la corbeille ?
ru: Вы уверены, что хотите переместить фрагмент '%s' в %s в корзину?

source: _Remove File
de: Datei entfernen
fr: _Enlever le fichier
ru: удалить файл

source: Existing Snippet::A snippet named '%s' already exists in context %s. Please remove or rename it first.
de: Vorhandener Schnipsel::Ein Schnipsel mit dem Namen '%s' existiert bereits im Kontext %s. Bitte erst entfernen oder umbenennen.
fr: Bout de code existant::Un bout de code nommé '%s' existe déjà dans le contexte %s. Veuillez d'abord le retirer ou le renommer.
ru: Существующий фрагмент:: фрагмент с именем '%s' уже существует в контексте %s. Сначала удалите или переименуйте его.

source: Paste '%s' Into Current Editor
de: '%s' in den aktuellen Editor einfügen
fr: Coller '%s' dans l'éditeur courant
ru: Вставить '%s' в текущий редактор

source: Paste '%s' Into New File
de: '%s' in neue Datei einfügen
fr: Coller '%s' dans un nouveau fichier
ru: Вставьте '%s' в новый файл

source: Add New Snippet...
de: Neuen Schnipsel hinzufügen...
fr: Ajouter un nouveau bout de code...
ru: Добавить Новый Фрагмент...

source: Edit Snippet '%s'
de: Schnipsel '%s' bearbeiten
fr: Éditer le bout de code '%s'
ru: Редактировать фрагмент '%s'

source: Rename Snippet '%s'...
de: Schnipsel '%s' umbennen...
fr: Renommer le bout de code '%s'...
ru: Переименовать фрагмент '%s'...

source: Duplicate Snippet '%s'...
de: Schnipsel '%s' klonen...
fr: Dupliquer le bout de code '%s'...
ru: Дубликат Фрагмента '%s'...

source: Remove Snippet '%s'
de: Schnipsel '%s' entfernen...
fr: Enlever le bout de code '%s'
ru: Удалить Фрагмент '%s'

source: Change Snippet '%s' Context
de: Kontext des Schnipsel '%s' ändern
fr: Changer le contexte du bout de code '%s'
ru: Изменить Контекст Фрагмента Кода '%s'

source: Copy Snippet '%s' to Context
de: Schnipsel '%s' zum Kontext kopieren
fr: Copier le bout de code '%s' vers le contexte
ru: Скопируйте фрагмент '%s' в контексте

source: Assign Key Binding to '%s'...
fr: Assigner un raccourci clavier à '%s'...
ru: Назначьте привязку ключа '%s'...

source: Clear Key Binding for '%s'
fr: Effacer le raccourci clavier pour '%s'
ru: Очистить привязку клавиш для '%s'

source: Show Snippets Documentation
de: Dokumentation der Schnipsel anzeigen
fr: Afficher la documentation des bouts de code
ru: Показать Документацию По Фрагментам
