Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_process.po
Languages: de, ru

source: License missing required %s
de: Der Lizenz fehlt der erforderliche Wert %s
ru: Отсутствует лицензия %s

source: Failed to package host information
de: Das Packen der Host-Informationen ist fehlgeschlagen
ru: Не удалось упаковать информацию хоста

source: Contains invalid characters: %s
de: Enthält ungültige Zeichen: %s
ru: Содержит недопустимые символы: %s

source: Wrong length (should contain 20 non-hyphen characters)
de: Falsche Länge (sollte 20 Zeichen enthalten, ohne Bindestriche)
ru: Неправильная длина (должна содержать 20 символов без дефиса)

source: Invalid first character: Should be one of %s
de: Erstes Zeichen ist ungültig: Sollte eines von %s sein
ru: Недопустимый первый символ: должен быть одним из %s

source: an unknown product
de: ein unbekanntes Produkt
ru: неизвестный продукт

source: Your license is for %s, but you are currently running %s. Please download the correct product from https://wingware.com/downloads or upgrade your license at https://wingware.com/store/upgrade
de: Ihre Lizenz ist für %s, Sie benutzen momentan aber %s. Bitte laden Sie das korrekte Produkt von https://wingware.com/downloads herunter oder erweitern Sie Ihre Lizenz unter https://wingware.com/store/upgrade
ru: Лицензия предназначена для %s, но в настоящее время выполняется %s. Пожалуйста, загрузите правильный продукт с https://wingware.com/downloads или обновите лицензию https://wingware.com/store/upgrade

source: Request code should start with R
de: Anforderungscode sollte mit R beginnen
ru: Код запроса должен начинаться с R

source: Invalid second character: Should be one of %s
de: Zweites Zeichen ist ungültig: Sollte eines von %s sein
ru: Недопустимый второй символ: должен быть одним из %s

source: Invalid third character: Should be one of %s
de: Drittes Zeichen ist ungültig: Sollte eines von %s sein
ru: Недопустимый третий символ: должен быть одним из %s

source: Invalid prefix: Should be '%s'
de: Ungültiger Präfix: Sollte '%s' sein
ru: Недопустимый префикс: Должен быть '%s'

source: License is valid.
de: Lizenz ist gültig.
ru: Лицензия действительна.

source: License file not found or could not be read.
de: Lizenzdatei wurde nicht gefunden oder konnte nicht gelesen werden.
ru: Файл лицензии не найден или не может быть прочитан.

source: Activation key not valid for this license:
de: Aktivierungsschlüssel ist für diese Lizenz nicht gültig:
ru: Ключ активации не действителен для данной лицензии:

source: The license has expired.
de: Die Lizenz ist abgelaufen.
ru: Срок действия лицензии истек.

source: The maximum number of users for this license has been reached.
de: Die maximale Anzahl der Benutzer für diese Lizenz ist erreicht.
ru: Достигнуто максимальное количество пользователей для этой лицензии.

source: License OS does not match current OS.
de: Betriebssystem der Lizenz stimmt nicht mit dem aktuellem Betriebssystem überein.
ru: Лицензия ОС не соответствует текущей ОС.

source: License does not match this product or product level.
de: Lizenz passt nicht zu diesem Produkt oder Produktlevel.
ru: Лицензия не соответствует данному продукту или уровню продукта.

source: License does not match this host's identity.
de: Lizenz passt nicht zur Identität dieses Hosts.
ru: Лицензия не совпадает с идентификатором этого хоста.

source: An internal error occurred:
de: Es ist ein interner Fehler aufgetreten:
ru: Произошла внутренняя ошибка:

source: Unknown error
de: Unbekannter Fehler
ru: Неизвестная ошибка

source: Other users are:
de: Andere Nutzer sind:
ru: Другие пользователи:

source: (%s) on host %s (%s) process id %s
de: (%s) auf Host %s (%s) Prozess-ID %s
ru: (%s) на хосте %s (%s) процесс id %s

source: No other users at this time.
de: Zur Zeit sind keine anderen Nutzer vorhanden.
ru: Других пользователей на данный момент нет.

source: Current OS '%s' is not supported
de: Aktuelles Betriebssystem '%s' wird nicht unterstützt
ru: Текущая ОС '%s' не поддерживается

source: License OS '%s' does not match current OS '%s'
de: Betriebssystem der Lizenz '%s' stimmt nicht mit dem aktuellen Betriebssystem '%s' überein.
ru: Лицензия ОС '%s' не соответствует текущей ОС '%s'

source: expired
de: abgelaufen
ru: истекший

source: Missing a required line %s
de: Fehlen einer geforderten Zeile %s

source: Invalid license activation
de: Ungültige Lizenzaktivierung
ru: Недействительная активация лицензии

source: unlimited
de: unbegrenzt
ru: неограниченный

source: Invalid date or termdays in file
de: Ungültiges Datum oder Laufzeittage in der Datei
ru: Недействительная дата или срок в файле

source: days left
de: verbleibende Tage
ru: осталось дней

source: _Accept
de: _Akzeptieren
ru: Принимать

source: _Decline
de: A_blehnen
ru: Снижение

source: Unable to read End User License Agreement from %s. Please check your Wing installation.
de: Endnutzer-Lizenzvereinbarung aus %s kann nicht gelesen werden. Bitte überprüfen Sie Ihre Wing Installation.
ru: Невозможно прочитать лицензионное соглашение конечного пользователя из %s. Пожалуйста проверите вашу установку Wing .

source: _Exit Wing
de: Wing b_eenden
ru: Выход Wing

source: Unable to read EULA
de: EULA kann nicht gelesen werden
ru: Невозможно прочитать EULA

source: License product '%s' is not a valid product code.
de: Lizenzprodukt '%s' ist kein gültiger Produktcode.
ru: Лицензионный продукт '%s' не является допустимым кодом продукта.

source: License is for Wing %s and cannot be used with Wing %s
de: Lizenz ist für Wing %s und kann nicht mit Wing %s verwendet werden
ru: Лицензия для Wing %s и не может использоваться с Wing %s

source: License is for version %s: An upgrade is needed to run %s
de: Lizenz ist für Version %s: Ein Upgrade ist erforderlich, um %s auszuführen
ru: Лицензия для версии %s: для запуска %s требуется обновление

source: No valid license file was found. The following errors occurred:
de: Es wurde keine gültige Lizenzdatei gefunden. Die folgenden Fehler sind aufgetreten:
ru: Действительный файл лицензии не найден. Произошли следующие ошибки:

source: Wing Pro Trial: %i Days Left
de: Wing Pro Testversion: %i Tage verbleiben
ru: Wing Pro Trial: %i Осталось дней

source: If you are ready, please purchase a license at %s.
de: Wenn Sie bereit sind, können Sie eine Lizenz unter %s erwerben.
ru: Если вы готовы, приобретите лицензию в %s.

source: Thanks for using Wing Pro!
de: Danke, dass Sie Wing Pro verwenden!
ru: Благодарим за использование Wing Pro!

source: _Purchase License
de: Lizenz _erwerben
ru: Приобрести лицензию

source: This annual license will expire in %s days.
de: Diese Jahreslizenz läuft in %s Tagen ab.
ru: Эта годовая лицензия истекает в %s дней.

source: You can renew at https://wingware.com/store/upgrade/license-ids=%s.
de: Sie können diese unter https://wingware.com/store/upgrade/license-ids=%s erneuern.
ru: Вы можете продлить на https://wingware.com/store/upgrade/license-ids=%s.

source: If you have already renewed, Wing failed to auto-activate the renewal and will try again later.
de: Falls Sie schon verlängert haben, dann konnte Wing die Verlängerung nicht automatisch aktivieren und wird es später erneut versuchen.

source: _Renew License
de: Lizenz _erneuern
ru: Продлить Лицензию

source: The free license you are using will expire in %s days.
de: Die von Ihnen benutzte freie Lizenz läuft in %s Tagen ab.
ru: Бесплатная лицензия, которую вы используете, истекает через %s дней.

source: If you still qualify for a free license, you may reapply at https://wingware.com/store/free.
de: Falls Sie weiterhin für eine freie Lizenz qualifiziert sind, dann können Sie diese unter https://wingware.com/store/free beantragen.
ru: Если вы все еще имеете право на бесплатную лицензию, вы можете подать заявку на https://wingware.com/store/free.

source: Otherwise, please purchase a license at %s
de: Ansonsten erwerben Sie bitte eine Lizenz unter %s
ru: В противном случае приобретите лицензию в %s

source: The trial license you are using will expire in %s days.
de: Die von Ihnen benutzte Testlizenz läuft in %s Tagen ab.
ru: Срок действия используемой пробной лицензии истекает через %s дней.

source: Otherwise, you can extend your trial twice for a total evaluation period of 30 days. For a longer trial please email support@wingware.com.
de: Ansonsten können Sie Ihre Testversion zweimal für einen Testzeitraum von insgesamt 30 Tagen verlängern. Für einen längeren Test senden Sie bitte eine E-Mail an support@wingware.com.
ru: В противном случае вы можете продлить пробную версию дважды на 30 дней. Для более длительных испытаний, пожалуйста, напишите support@wingware.com.

source: _Continue Working
de: Arbeit _fortsetzen
ru: Продолжить работу

source: Expired Trial
de: Abgelaufene Testversion
ru: Истек срок действия пробной версии

source: The free trial period for Wing has ended. Please purchase a license from %s
de: Der kostenlose Testzeitraum von Wing ist abgelaufen. Bitte erwerben Sie eine Lizenz von %s
ru: Бесплатный пробный период для Wing закончился. Приобретите лицензию у %s

source: No Valid License
de: Keine gültige Lizenz
ru: Нет действующей лицензии

source: Wing could not obtain a license for your Steam user ID. Please try again or email sales@wingware.com for help. If you do not own a license, please purchase one from %s
de: Wing kann keine Lizenz für Ihre Steam Benutzer ID beziehen. Bitte versuchen Sie es erneut oder senden Sie eine E-Mail an sales@wingware.com, um Hilfe zu erhalten. Falls Sie noch keine Lizenz besitzen, so erwerben Sie bitte eine von %s
ru: Wing не смог получить лицензию для вашего идентификатора пользователя Steam. Повторите попытку или напишите по адресу sales@wingware.com. Если у вас нет лицензии, пожалуйста, приобретите ее у %s

source: _Show Store
de: _Shop anzeigen
ru: Показать магазин

source: Just _Quit
de: Nur _Beenden
ru: Просто Покинуть

source: Unable to create the required directory %s because the disk is read-only or a file of the same name already exists.
de: Das erforderliche Verzeichnis %s kann nicht erstellt werden, weil die Festplatte nur lesbar ist oder eine Datei mit dem gleichen Namen bereits existiert.
ru: Не удалось создать необходимый каталог %s, так как диск доступен только для чтения или файл с тем же именем уже существует.

source: Failed to use activated license
de: Die Verwendung der aktivierten Lizenz ist fehlgeschlagen
ru: Не удалось использовать активированную лицензию

source: The following errors occurred while copying the license activation file into place:
de: Die folgenden Fehler sind beim Kopieren der Lizenzaktivierungsdatei aufgetreten:
ru: При копировании файла активации лицензии произошли следующие ошибки:

source: The following exception occurred while copying the license activation file into place:
de: Die folgende Ausnahme ist beim Kopieren der Lizenzaktivierungsdatei aufgetreten:
ru: При копировании файла активации лицензии произошло следующее исключение:

source: Trial License Generated
de: Probelizenz wurde erzeugt
ru: Созданная пробная лицензия

source: Your 10-day trial license has been created and activated. If this is your first trial, you will be able to extend the license term twice for up to 30 days. Thanks for trying Wing!
de: Ihre 10-tägige Probelizenz wurde erstellt und aktiviert. Wenn dies Ihre erste Probelizenz ist, können Sie die Laufzeit der Lizenz zweimal auf insgesamt 30 Tage verlängern. Danke, dass Sie Wing testen!
ru: Ваша 10-дневная пробная лицензия была создана и активирована. Если это ваша первая пробная версия, вы сможете продлить срок действия лицензии дважды до 30 дней. Спасибо, что попробовали Wing!

source: License Activated
de: Lizenz aktiviert
ru: Лицензия активирована

source: License activation succeeded. Your license is valid for another %s days. Thanks for using Wing Pro!
de: Lizenz erfolgreich aktiviert. Ihre Lizenz ist für weitere %s Tage gültig. Danke, dass Sie Wing Pro verwenden!
ru: Активация лицензии прошла успешно. Ваша лицензия действительна в течение следующих %s дней. Благодарим за использование Wing Pro!

source: License activation succeeded. Thanks for using Wing Pro!
de: Lizenz erfolgreich aktiviert. Danke, dass Sie Wing Pro verwenden!
ru: Активация лицензии прошла успешно. Благодарим за использование Wing Pro!

source: Unexpected License Activation Error
de: Unerwarteter Fehler bei der Lizenzaktivierung
ru: Неожиданная ошибка активации лицензии

source: A validated license was corrupted during copying. Please send email to support@wingware.com
de: Eine validierte Lizenz wurde beim Kopieren beschädigt. Bitte senden Sie eine E-Mail an support@wingware.com
ru: Во время копирования подтвержденная лицензия была повреждена. Пожалуйста, отправьте письмо по адресу support@wingware.com

source: Con_tinue
de: For_tsetzen
ru: Продолжать

source: _Cancel
de: Abbre_chen
ru: Отмена

source: Purchase License
de: Lizenz erwerben
ru: Приобрести лицензию

source: Trial licenses can be obtained directly from Wing and last for 10 days. When the license expires, you can renew it twice for a total of 30 days. Please email support@wingware.com if you need more time than that.
de: Probelizenzen können direkt aus Wing bezogen werden und sind 10 Tage lang gültig. Wenn die Lizenz abläuft, können Sie diese bis zu zweimal für insgesamt 30 Tage erneuern. Bitte schreiben Sie eine E-Mail an support@wingware.com schicken, wenn Sie noch weitere Zeit benötigen.
ru: Пробные лицензии могут быть получены непосредственно из Wing и длиться в течение 10 дней. По истечении срока действия лицензии ее можно продлить дважды на 30 дней. Пожалуйста, напишите support@wingware.com если Вам нужно больше времени.

source: Obtain or extend a trial license
de: Eine Probelizenz erwerben oder verlängern
ru: Получение или продление пробной лицензии

source: Permanent and annual licenses can be purchased from wingware.com
de: Dauerhafte und Jahreslizenzen können Sie von wingware.com erwerben
ru: Постоянные и ежегодные лицензии можно приобрести у wingware.com

source: Purchase a license
de: Eine Lizenz erwerben
ru: Приобрести лицензию

source: Wing requires that you activate each license before using it. If you run out of activations, please email your license to sales@wingware.com.
de: Wing erfordert, dass Sie jede Lizenz vor der Verwendung aktivieren. Wenn Sie keine Aktivierungen mehr haben kontaktieren Sie uns bitte unter Nennung Ihrer Lizenz unter sales@wingware.com.
ru: Wing требует, чтобы вы активировали каждую лицензию перед ее использованием. Если у вас закончились активации, отправьте свою лицензию по электронной почте sales@wingware.com.

source: Activate your pre-loaded license:
de: Vorinstallierte Lizenz aktivieren:
ru: Активация предварительно загруженной лицензии:

source: Activate a purchased license. Enter license id:
de: Aktivieren einer erworbenen Lizenz. Geben Sie die Lizenz-ID ein:
ru: Активация приобретенной лицензии. Введите лицензионный код:

source: You can try Wing for a short period of time without any license. At the end of the allocated time, this dialog will reappear and you will be given the option to start a trial, purchase a license, or quit Wing after saving changes.
de: Sie können Wing für eine kurze Zeit ohne Lizenz ausprobieren. Nach Ablauf der zugewiesenen Zeit wird dieser Dialog erneut erscheinen und Sie haben dann die Möglichkeit, einen Test zu starten, eine Lizenz zu erwerben oder Wing nach dem Speichern von Änderungen zu beenden.
ru: Вы можете попробовать Wing в течение короткого периода времени без каких-либо лицензий. В конце выделенного времени это диалоговое окно снова появится, и вам будет предоставлена ​​возможность начать пробную версию, приобрести лицензию или выйти из Wing после сохранения изменений.

source: 10 minute emergency session
de: 10 Minuten Notfallsitzung
ru: 10-минутный аварийный сеанс

source: You have used up the time period during which Wing will run without any license. You must now start a 30-day trial, purchase a license, or quit after saving changes.
de: Sie haben den Zeitraum aufgebraucht in dem Wing ohne eine Lizenz ausgeführt wird. Sie müssen jetzt eine 30-Tage Testversion starten, eine Lizenz erwerben oder Wing nach dem Speichern von Änderungen beenden.
ru: Вы использовали период времени, в течение которого Wing мог работать без лицензии. Теперь вы должны начать использовать 30-дневную пробную версию, приобрести лицензию или выйти после сохранения изменений.

source: Exit after saving changes
de: Beenden, nachdem Änderungen gesichert wurden
ru: Выход после сохранения изменений

source: Choose your preferred method of license activation:
de: Wählen Sie Ihre bevorzugte Methode der Lizenzaktivierung:
ru: Выберите предпочтительный способ активации лицензии:

source: This is the easiest way to activate your license. Wing sends your license and your request code to our server to complete the activation process.
de: Dies ist der einfachste Weg zur Aktivierung Ihrer Lizenz. Wing sendet Ihre Lizenz und Ihren Anforderungscode an unseren Server um den Aktivierungsprozess zu vollenden.
ru: Это самый простой способ активации вашей лицензии. Wing отправляет вашу лицензию и ваш код запроса на наш сервер, чтобы завершить процесс активации.

source: Configure Proxy...
de: Proxy konfigurieren...
ru: Настройка Прокси...

source: Recommended: Connect Wing directly to wingware.com
de: Empfohlen: Wing direkt zu wingware.com verbinden
ru: Рекомендуем: Подключить Wing прямо к wingware.com

source: If your machine does not have a network connection that can access port 80 (http) on wingware.com, you will need to activate your license manually by entering your license id and request code on a machine that does have network access. If you cannot browse the web at all, email the information to us at support@wingware.com and we will email you the activation code.
de: Falls Ihre Maschine keine direkte Netzwerkverbindung hat, um über Port 80 (http) auf wingware.com zuzugreifen, dann müssen Sie Ihre Lizenz manuell aktivieren, indem Sie Ihre Lizenz-ID und den Anforderungscode auf einer Maschine, die Netzwerkzugriff hat, eingeben. Wenn Sie überhaupt keine Möglichkeit haben, auf das Internet zuzugreifen, dann senden Sie uns die Informationen per E-Mail an support@wingware.com und wir werden Ihnen den Aktivierungscode per E-Mail zusenden.
ru: Если на вашем устройстве нет сетевого подключения, которое может обращаться к порту 80 (http) на сайте wingware.com, вам необходимо активировать свою лицензию вручную, введя идентификатор лицензии и код запроса на компьютере, имеющем доступ к сети. Если вы вообще не можете просматривать веб-страницы, напишите нам информацию по адресу support@wingware.com, и мы отправим вам код активации.

source: Optional user identity to use for lost license recovery:
de: Optionale Benutzer-Identität für die Wiederherstellung verlorener Lizenzen:
ru: Необязательный идентификатор пользователя для восстановления утерянной лицензии:

source: Licensed user
de: Lizenzierter Nutzer
ru: Лицензированный пользователь

source: Phone
de: Telefon
ru: Телефон

source: To change to another license, you may now:
de: Um zu einer anderen Lizenz zu wechseln, können Sie jetzt:
ru: Теперь вы можете перейти на другую лицензию:

source: Change License
de: Lizenz wechseln

source: Wing is running without a valid license. You may now:
de: Wing wird ohne gültige Lizenz ausgeführt. Sie können jetzt:
ru: Wing работает без действующей лицензии. Теперь вы можете:

source: Your trial license has been created. To activate it you can:
de: Ihre Probelizenz wurde erstellt. Um sie zu aktivieren, können Sie:
ru: Ваша пробная лицензия была создана. Чтобы активировать её, вы можете:

source: Activate Trial License
de: Probelizenz aktivieren
ru: Активировать пробную лицензию

source: Please choose your preferred method of license activation:
de: Bitte wählen Sie Ihre bevorzugte Methode der Lizenzaktivierung:
ru: Выберите предпочтительный способ активации лицензии:

source: Activate License
de: Lizenz aktivieren
ru: Активировать лицензию

source: Or: Activate manually at https://wingware.com/activate. You will need your license id %s and request code %s. Then enter the provided activation key here:
de: Oder: Aktivieren Sie manuell unter https://wingware.com/activate. Sie benötigen Ihre Lizenz-ID %s und den Anforderungscode %s. Geben Sie dann den bereitgestellten Aktivierungsschlüssel hier ein:
ru: Или: активировать вручную https://wingware.com/activate. Вам понадобится ваш ID лицензии %s и код запроса на %s. Введите ключ активации здесь:

source: Opening Browser
de: Browser wird geöffnet
ru: Открытие браузера

source: Click OK to open https://wingware.com/store in a web browser. Once you have purchased a license, return here to activate it.
de: Klicken Sie auf Ok, um https://wingware.com/store in einem Web-Browser zu öffnen. Nachdem Sie Ihre Lizenz erworben haben, kehren Sie hierher zurück, um sie zu aktivieren.
ru: Нажмите OK, чтобы открыть https://wingware.com/store в веб-браузере. После того, как Вы приобрели лицензию, вернитесь сюда, чтобы активировать ее.

source: You cannot enter a trial license id here
de: Sie können hier keine Probelizenz-ID eingeben
ru: Здесь нельзя ввести идентификатор пробной лицензии

source: Invalid license id: %s. Please check and correct it. Errors found were: %s
de: Ungültige Lizenz-ID: %s. Bitte überprüfen Sie dies und korrigieren es. Die folgenden Fehler wurden gefunden: %s
ru: Неверный идентификатор лицензии: %s. Пожалуйста, проверьте и исправьте его. Были обнаружены ошибки: %s

source: Invalid License ID
de: Ungültige Lizenz-ID
ru: Недопустимый ID лицензии

source: Invalid activation key: %s. Please check and correct it. Errors found were: %s
de: Ungültiger Aktivierungsschlüssel: %s. Bitte überprüfen Sie dies und korrigieren es. Die folgenden Fehler wurden gefunden: %s
ru: Неверный ключ активации: %s. Пожалуйста, проверьте и исправьте его. Были обнаружены ошибки: %с

source: Invalid activation key: %s. Please check and correct it.
de: Ungültiger Aktivierungsschlüssel: %s. Bitte überprüfen Sie dies und korrigieren es.
ru: Неверный ключ активации: %s. Пожалуйста, проверьте и исправьте его.

source: Validation errors were: %s
de: Validierungsfehler waren: %s
ru: Ошибки проверки: %s

source: Activating
de: Aktivieren
ru: Активация

source: Submitting activation request. Please wait
de: Aktivierungsanfrage wird eingereicht. Bitte warten
ru: Отправка запроса активации. Пожалуйста, подождите

source: Connecting to wingware.com
de: Verbinde zu wingware.com
ru: Подключение к wingware.com

source: Preparing activation
de: Aktivierung wird vorbereitet
ru: Подготовка активации

source: Waiting for Reply
de: Warten auf Antwort
ru: Ожидание ответа

source: Reading Reply
de: Antwort wird gelesen
ru: Чтение ответа

source: Could not obtain activation key
de: Aktivierungsschlüssel konnte nicht erhalten werden
ru: Не удалось получить ключ активации

source: Validating Activation Key
de: Aktivierungsschlüssel wird validiert
ru: Проверка ключа активации

source: Internal activation error: %s. Please report this to support@wingware.com.
de: Interner Aktivierungsfehler: %s. Bitte berichten Sie dies an support@wingware.com.
ru: Внутренняя ошибка активации: %s. Пожалуйста, сообщите об этом support@wingware.com.

source: Writing Activation File
de: Aktivierungsdatei wird geschrieben
ru: Запись файла активации

source: Invalid license
de: Ungültige Lizenz
ru: Недействительная лицензия

source: The license code you provided is invalid for this product
de: Der von Ihnen bereitgestellte Lizenzcode ist für dieses Produkt nicht gültig
ru: Предоставленный вами код лицензии недействителен для данного продукта

source: Validating License
de: Lizenz wird validiert
ru: Проверка лицензии
