Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_versioncontrol.po
Languages: fr

source: List of recent locations
fr: Liste des emplacements récents

source: Whether to display unregistered files in status displays
fr: S’il faut afficher les fichiers non enregistrés dans les affichages de statuts

source: Use Preference Settings
fr: Utiliser les paramètres des préférences

source: Disable
fr: Désactiver

source: Enable and Configure Here
fr: Activer et Configurer Ici

source: Configures VCS systems for this project
fr: Configure les systèmes VCS pour ce projet

source: Extra arguments to pass to every command.
fr: Extra arguments à passer à chaque commande.

source: Configure...
fr: Configurer...

source: CVS Update
fr: Mise à jour CVS

source: CVS Executable
fr: Exécutable CVS

source: Extra Global Arguments
fr: Arguments extra globaux

source: Checkout working copy
fr: Vérifie la copie en cours de travail

source: Checkout
fr: Vérification

source: Missing module
fr: Module manquant

source: The module name must be specified
fr: Le nom du module doit être spécifié

source: Use --porcelain output for git status
fr: Utiliser la sortie —porcelain pour les status git

source: _Project Status
fr: Statuts du projet

source: C_ommit Project
fr: Committer le projet

source: S_witch Branch
fr: Changer de branche

source: Pus_h Branch Changes
fr: Pousser les modifications de branche

source: P_ull Branch Changes
fr: Tirer les modifications de branche

source: _Fetch Repository Changes
fr: Récupérer les modifications du dépôt

source: _Add
fr: _Ajouter

source: _Remove
fr: Enleve_r

source: %s Executable
fr: Exécutable %s

source: Use --porcelain
fr: Utiliser --porcelain

source: Failed to run git command
fr: Échec pour lancer la commande git

source: Could not find git working directory
fr: N'a pas pu trouver le répertoire de travail git

source: Pull from repository
fr: Tirer du dépôt

source: Pull from
fr: Tirer de

source: _Pull
fr: Tirer

source: Branch name
fr: Nom de la branche

source: Push branch to repository
fr: Pousser la branche dans le dépôt

source: Push to
fr: Pousser vers

source: _Push
fr: _Pousser

source: Fetch changes from repository
fr: Récupérer les modifications depuis le dépôt

source: Fetch from
fr: Récupérer depuis

source: _Fetch
fr: Récupérer

source: Don't find unregistered files when scanning for file status. This can substantially reduce the time to scan large repositories.
fr: Ne trouve pas de fichiers non enregistrés lors du scan des statuts de fichier. Cela peut substantiellement réduire le temps de scanner de larges dépôts.

source: _Annotate
fr: _Annoter

source: _Commit Project
fr: _Committer le projet

source: P_ull Changes
fr: Tirer les modifications

source: Up_date
fr: Mettre à jour

source: Pu_sh Changes
fr: Pousser les modifications

source: Remo_ve
fr: Enle_ver

source: Don't Find Unregistered Files
fr: Ne trouve pas les fichiers non enregistrés

source: Pull All Changes
fr: Tirer toutes les modifications

source: Pull From
fr: Tirer De

source: Pull
fr: Tirer

source: Update
fr: Mettre à jour

source: Push all changes
fr: Pousser toutes les modifications

source: Cannot find single hg working directory root
fr: N'a pas pu trouvé une seule racine de répertoire travaillant avec hg

source: Perforce Sync
fr: Synchronisation Perforce

source: Perforce Executable
fr: Exécutable Perforce

source: Executable command to run svn
fr: Commande exécutable pour lancer svn

source: SVN Update
fr: Mise à jour SVN

source: SVN Executable
fr: Exécutable SVN

source: SVN Admin Executable
fr: Exécutable d'administration SVN

source: Tools
fr: Outils

source: Window
fr: Fenêtre

source: Help
fr: Aide

source: Auto-refresh %s Status
fr: Auto-rafraichissement des statuts %s

source: No %s %s
fr: Non %s %s

source: %(identifier)s does not support a %(name)s command. The files were %(past_tense)s on disk, but new files and directories were not added and version control history was not copied.
fr: %(identifier)s ne supportent pas une commande %(name)s. Les fichiers étaient %(past_tense)s sur le disque, mais les nouveaux fichiers et répertoires n'étaient pas ajoutés et l'historique du contrôle de version n'était pas copié.

source: Failed to inspect remote files
fr: Échec d'inspection des fichiers distants

source: Enable the integrated version control system.
fr: Activer le système de contrôle des versions intégré.

source: Save without prompting before running version control commands.
fr: Enregistrer sans demander avant de lancer les commandes de contrôle de version.

source: Maximum number of completed commands to store in the version control tool.
fr: Nombre maximum de commandes complétées à enregistrer dans l'outil de contrôle de version.

source: Watch disk for version control changes and refresh the Project view and Project Status accordingly.
fr: Surveille le disque pour des modifications de contrôle de version et rafraichit la vue projet et les statuts du projet en conséquence.

source: Track file add, remove, and rename operations made with Wing's Project view into the version control repository.
fr: Retrouver les opérations d'ajout, retrait et renommage de fichier faites avec la vue de projet Wing dans le dépôt de contrôle de version.

source: Log all commands to ide.log in the user settings directory.
fr: Logue toutes les commandes dans ide.log dans le répertoire des préférences utilisateur.

source: Always Active
fr: Toujours actif

source: Active if used by project directories
fr: Actif si utilisé dans les répertoires projets

source: Not active
fr: Inactif

source: Active
fr: Actif

source: [command terminated]
fr: [commande terminée]

source: Executable command to run %s
fr: Commande exécutable pour lancer %s

source: When %s version control support is active
fr: Quand le support du contrôle de version %s est actif

source: History of remote locations
fr: Historique des emplacements à distance

source: Cannot commit because the commit message is empty
fr: Ne peut pas committer car le message de commit est vide

source: Save without _prompting
fr: Enregistrer sans demander

source: Commit selected files
fr: Commiter les fichiers sélectionnés

source: Commit all project files
fr: Commiter tous les fichiers projet

source: Show differences between files in working directory and last committed version
fr: Afficher les différences entre les fichiers dans le répertoire de travail et la dernière version commitée

source: View status for entire project
fr: Voir les status pour le projet entier

source: View status of the selected files in the working directory
fr: Voir les statuts des fichiers sélectionnés dans le répertoire de travail

source: Discard Changes in Files?
fr: Annuler les modifications dans les fichiers ?

source: Are you sure you want to discard your changes to %s and revert to the current state on this branch in %s?
fr: Êtes-vous sûr de vouloir abandonner vos modifications de %s et revenir à l'état actuel sur cette branche dans %s ?

source: Add the files to %(label)s
fr: Ajouter les fichiers au(x) %(label)s

source: Remove files
fr: Enlever les fichiers

source: Remove Files?
fr: Enlever les fichiers ?

source: Are you sure you want to remove the following? %s
fr: Êtes-vous sûr de vouloir retirer les suivants ? %s

source: Ou_tput
fr: Sortie

source: Cance_l
fr: Annu_ler

source: Run Again
fr: Lancer de nouveau

source: Failed to run: %s</span>
fr: Échec pour démarrer : %s</span>

source: Goto Source
fr: Aller à la source

source: Copy
fr: Copier

source: Select All
fr: Tout sélectionner

source: _Copy
fr: _Copier

source: Select _All
fr: Tout sélectionner

source: Failed to find source
fr: Échec pour trouver la source

source: Failed to find filename in diff output
fr: Échec pour trouver le nom de fichier dans les sorties des différences

source: Hide Unregistered
fr: Masquer les non enregistrés

source: Show Unregistered
fr: Afficher les non enregistrés

source: View as List
fr: Voir comme une liste

source: View as Tree
fr: Voir comme une arborescence

source: No modified files
fr: Aucun fichier modifié

source: No %s files in project
fr: Pas de fichiers %s dans le projet

source: _Output
fr: Sortie

source: Status
fr: Statuts

source: Auto-refresh
fr: Auto-rafraichissement

source: Refresh
fr: Rafraichir

source: Project Status
fr: Statuts du projet

source: Running status
fr: Statuts d'exécution

source: _Diffs
fr: _Différences

source: _Files
fr: _Fichiers

source: Nothing to commit
fr: Rien à committer

source: Committing
fr: En cours de commit

source: Commit succeeded
fr: Commit réussi

source: Commit failed
fr: Commit échoué

source: Command completed: Output displayed in scratch editor.
fr: Commande accomplie : La sortie est affichée dans un éditeur improvisé.

source: _Locations
fr: Emplacements

source: Repository
fr: Dépôt

source: Working directory
fr: Répertoire de travail

source: Missing locations
fr: Emplacements manquants

source: Both the repository and the working directory must be specified
fr: Le dépôt et le répertoire de travail doivent être spécifiés

source: _Switch Branch
fr: Changer de branche

source: Both the working directory and the branch must be specified
fr: Le répertoire de travail et la branche doivent être spécifiés

source: Configure %s
fr: Configurer %s

source: Display Documentation
fr: Afficher la documentation

source: Show Scope
fr: Afficher la portée

source: Hide Scope
fr: Masquer la portée

source: Show Console
fr: Afficher la console

source: Hide Console
fr: Masquer la console
