Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_scripting.po
Languages: de, fr

source: %s.contexts callable failed
de: %s.contexts Callable gescheitert
fr: Les appels de %s.contexts ont échoués

source: %scontexts must be list or tuple
de: %scontexts muss vom Typ List oder Tuple sein
fr: %scontexts doivent être des listes ou des tuples

source: %scontexts: Unknown context %s
de: %scontexts: Unbekannter Kontext %s
fr: %scontexts : contexte inconnu %s

source: Script Input Error::Scripts cannot read from stdin
de: Skript Eingabefehler::Skripte können nicht von stdin lesen
fr: Erreur d'entrée du script::Les scripts ne peuvent pas lire depuis stdin

source: Loading script directory %s
de: Skriptverzeichnis %s wird geladen
fr: Chargement du répertoire de scripts %s

source: Failed to (re)load script module %s from %s:
de: (Neu)laden von %s aus %s ist fehlgeschlagen:
fr: Échec du (re)chargement du module de script %s depuis %s :

source: Skipping directory %s (not a package)
de: Verzeichnis %s wird übersprungen (kein Paket)
fr: Saute le répertoire %s (pas un paquet)

source: Failed to find module %s in %s
de: Modul %s in %s konnte nicht gefunden werden
fr: Échec pour trouver le module %s dans %s

source: Failed to load %s from %s:
de: Laden von %s aus %s fehlgeschlagen:
fr: Échec du chargement de %s depuis %s :

source: Skipping module %s from %s (_ignore_scripts is set)
de: Überspringe Modul %s aus %s (_ignore_scripts gesetzt)
fr: Saute le module %s de %s (_ignore_scripts est établi)

source: _Enable All Plugins
de: Alle Erweiterungen _aktivieren
fr: Activer tous les plugins

source: _Disable All Plugins
de: Alle Erweiterungen _deaktivieren
fr: Désactiver tous les plugins

source: _Enable Selected Plugins:
de: Ausge_wählte Erweiterungen aktivieren:
fr: Activer les plugins sélectionnés :

source: _Close
de: _Schließen
fr: Fermer

source: Manage Plugins
de: Erweiterungen verwalten
fr: Gérer les plugins
