Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_debug_client.po
Languages: ru

source: Breakpoints for a file
ru: Точки останова для файла

source: Exceptions ignored for a file
ru: Исключения, игнорируемые для файла

source: History list of commands in Python Shell
ru: Журнал команд в оболочке Python

source: History list of expressions used in the evaluator
ru: Журнал выражений, использованных в вычислителе

source: History list of expressions
ru: Журнал выражений

source: Command line arguments to use when executing or debugging. Arguments can optionally be delimited by "s or 's. Use \" to add " to an argument and \\" to add \" to an argument. Environment variable references may also be used. A \ that does not precede a ", ', or $ adds a \ to an argument.
ru: Аргументы командной строки для использования при выполнении или отладке. Аргументы могут быть необязательно разделены символом "s или 's. Используйте \" to add " к аргументу и \\" to add \" к аргументу. Ссылки на переменные среды также могут быть использованы. A \ который не предшествует ", ', или $ добавляет аргумент \ to.

source: Used internally to save recently used run arguments
ru: Используется внутренне для сохранения недавно использованных аргументов запуска

source: Whether to show dialog before running file. This may be overridden with the Debugger > Advanced > Auto-show Run Args Dialog preference.
ru: Показывать диалог перед запуском файла. Это может быть отменено с помощью параметра Отладчик> Дополнительно> Автозапуск Запустить Диалоговое Окно Аргументы .

source: Breakpoint Insert Failed
ru: Ошибка Вставки Точки Останова

source: Failed to insert breakpoint:
ru: Не удалось вставить точку останова:

source: Breakpoint Moved
ru: Точка Останова Перемещена

source: Wing moved your breakpoint to a line that will be reached by Python. Not all physical lines of your code are executed by the interpreter, and statements like 'pass' are ignored in most contexts.
ru: Wing сдвинул свою точку останова на строку, которая будет доступна интерпретатору Python. Не все физические строки кода выполняются интерпретатором, и в большинстве случаев операторы типа 'pass' игнорируются.

source: _Don't show this again
ru: Не показывать это снова

source: No response from TrackBreaks: Setting server side ID opportunistically during UpdateChangedBPs
ru: Нет ответа от TrackBreaks: Установленный ID на стороне сервера приспособился к обстоятельствам во время UpdateChangedBPs

source: TrackBreaks Failed
ru: TrackBreaks Не Удались

source: Call Stack
ru: Стек вызовов

source: Debug Process Call Stack
ru: Стек Вызовов Процесса Отладки

source: Stack Frames
ru: Кадры стека

source: <thread is running>
ru: <поток запущен>

source: pos %s-%s
ru: поз %s-%s

source: line %s
ru: строка %s

source: Failed to select stack frame
ru: Не удалось выбрать кадр стека

source: Could not display selected stack frame
ru: Не удалось отобразить выбранный кадр стека

source: Copy Stack to Clipboard
ru: Копировать Стек в буфер обмена

source: Hide Code Line
ru: Скрыть Строку Кода

source: Show Code Line Appended
ru: Показать Код Присоединенной Строки

source: Show Code Line Below
ru: Показать Строку Кода Ниже

source: Indicate Project Files
ru: Указать Файлы Проекта

source: Show Call Stack Documentation
ru: Показать Документацию Стека Вызовов

source: Breakpoint Mgr
ru: Точка останова Mgr

source: Cannot ignore breakpoint '%s' times
ru: Невозможно игнорировать точкe останова '%s' время

source: Invalid Value
ru: Неверное значение

source: _Cancel
ru: Отмена

source: Conditional Breakpoint
ru: Условная Точка Останова

source: Enter new breakpoint condition:
ru: Введите новое условие точки останова:

source: Ignore Breakpoint
ru: Игнорировать Точку Останова

source: Enter number of hits to ignore:
ru: Введите количество обращений для игнорирования:

source: Could not attach
ru: Не удалось подключить

source: Could not attach to host %s, port %s:
ru: Не удалось подключиться к узлу %s, порт %s:

source: The remote process is not accepting connections, or is not running. This may be caused by a missing or incorrect wingdebugpw file. The wingdebugpw file in the IDE's user settings directory (%s) must match the wingdebugpw file that is being read by the debug process (see kPWFilePath in wingdbstub.py).
ru: Удаленный процесс не принимает подключения или не выполняется. Это может быть вызвано отсутствующим или неправильным файлом wingdebugpw. Файл wingdebugpw в каталоге пользовательских настроек интегрированной среды разработки (%s) должны соответствовать файлу wingdebugpw, который читается в процессе отладки (см. kPWFilePath в wingdbstub.py).

source: Both host and port must be filled in
ru: Как хост, так и порт должны быть заполнены

source: Invalid Entry
ru: Неверный Ввод

source: Invalid (non-numeric) port number
ru: Недействительный (нечисловой) номер порта

source: Select a process to attach to:
ru: Выберите процесс для присоединения:

source: Description
ru: Описание

source: Attach
ru: Присоединить

source: Cancel
ru: Отмена

source: Attach to Debug Process
ru: Присоединение к процессу отладки

source: Breakpoints
ru: Контрольные точки

source: Debug Breakpoint Manager
ru: Отладка Диспетчера Точек Останова

source: Breakpoint Manager
ru: Диспетчер Точек Останова

source: Breakpoint manager state
ru: Состояние диспетчера точек останова

source: Condition
ru: Состояние

source: Ignores
ru: Игнор-ть

source: Location
ru: Положение

source: Temporary
ru: Временно

source: Enabled
ru: Вкл

source: Ignores Left
ru: Игнор-ть Слева

source: %s, line %i
ru: %s, строка %i

source: Show Breakpoint
ru: Показать Точку Останова

source: Remove Breakpoint
ru: Удалить Точку Останова

source: Remove All Breakpoints
ru: Удалить Все Точки Останова

source: Disable _All Breakpoints
ru: Отключить Все Точки Останова

source: Enable _All Breakpoints
ru: Включить Все Точки Останова

source: Show Breakpoints Documentation
ru: Показать Документацию По Точкам Останова

source: Save Files First
ru: Сначала Сохраните Файлы

source: New
ru: Новый

source: Edit
ru: Правка

source: Delete
ru: Удалить

source: _Show Docs...
ru: Показать документы...

source: _Close
ru: Закрыть

source: Shared
ru: Общий

source: _New...
ru: Новый...

source: D_uplicate...
ru: Дублировать...

source: _Edit...
ru: Правка...

source: _Delete...
ru: Удалить...

source: General
ru: Общий

source: Identifier
ru: Идентификатор

source: You must specify an Identifier
ru: Необходимо указать Идентификатор

source: Options
ru: Опции

source: Python Executable
ru: Исполняемый файл Python

source: File Mappings
ru: Сопоставление файлов

source: Name
ru: Название

source: Debug
ru: Отладка

source: Cannot execute: no debug process
ru: Не удается выполнить: нет процесса отладки

source: Cannot execute: debug process is busy
ru: Не удается выполнить: процесс отладки занят

source: Waiting for keyboard input
ru: Ожидается ввод с клавиатуры

source: Executing command. Please wait for result.
ru: Выполнение команды. Пожалуйста дождитесь результата.

source: Debugging recursively (R=%i). Use arrow keys for history.
ru: Отладка рекурсивно (R=%i). Используйте клавиши со стрелками для истории.

source: Commands run in current frame with debug enabled. Use arrow keys for history.
ru: Команды выполняются в текущем фрейме с включенной отладкой. Используйте клавиши со стрелками для истории.

source: Commands run in current frame without debug. Use arrow keys for history.
ru: Команды выполняются в текущем фрейме без отладки. Используйте клавиши со стрелками для истории.

source: Commands execute in current stack frame. Use arrow keys for history.
ru: Команды выполняются в текущем кадре стека. Используйте клавиши со стрелками для истории.

source: Cannot execute: debug program is connecting
ru: Не удается выполнить: программа отладки подключается

source: Cannot execute: debugger not ready or exiting
ru: Не удается выполнить: отладчик не готов или вышел

source: Cannot execute: unknown or invalid debug mode
ru: Не удается выполнить: неизвестный или недопустимый режим отладки

source: Command Line for Probing Paused Debug Process Data
ru: Командная строка для Обнаружения приостановленных данных процесса отладки

source: _Clear
ru: Очистить

source: _Save a Copy...
ru: Сохранить копию...

source: _Wrap Lines
ru: Перенос строки

source: _Pretty Print
ru: Хорошая Печать

source: _Enable Auto-completion
ru: Включить автозавершение

source: _Filter History by Entered Prefix
ru: История фильтров по введенному префиксу

source: Evaluate Only W_hole Lines
ru: Анализировать Только Целые Линии

source: Enable _Debugging
ru: Включить Отладку

source: Enable Recursi_ve Prompt
ru: Включить Recursive Prompt

source: Could not find definition of '%s'
ru: Не удалось найти определение '%s'

source: Kill current IPython session?
ru: Убить текущую сессию IPython?

source: Disconnect from current IPython session?
ru: Отключиться от текущей сессии IPython?

source: debugging is disabled, use Options menu to start debugging
ru: отладка отключена, используйте меню «Параметры», чтобы начать отладку

source: debugger is active
ru: отладчик активен

source: code is stopped in debugger, use the debug tools to work with it
ru: код остановлен в отладчике, используйте инструменты отладки для работы с ним

source: Could not start IPython
ru: Не удалось запустить IPython

source: Cannot execute: use Options -> Restart Shell to launch shell
ru: Не удается выполнить: используйте «Параметры» -> «Перезапустить оболочку», чтобы запустить оболочку

source: Cannot execute: waiting for shell to restart
ru: Не удается выполнить: ожидание перезагрузки оболочки

source: busy
ru: занят

source: IPython: kernel is {}; {}
ru: IPython: ядро {}; {}

source: Cannot interrupt because kernel is not connected
ru: Не удается прервать, так как ядро не подключено

source: Cannot interrupt because kernel was not launched by this process
ru: Не удается прервать, так как ядро не было запущено этим процессом

source: Evaluate _line %i from %s
ru: Анализ строки %i из %s

source: Evaluate _lines %i-%i from %s
ru: Анализ строк %i-%i из %s

source: Evaluate _selection on line %i in %s
ru: Анализ выбора в строке %i в %s

source: Evaluate _selection on lines %i-%i in %s
ru: Анализ выбора в строках %i-%i в %s

source: Evaluate _Selection
ru: Анализ Выбора

source: _Restart Shell
ru: Перезапуск Оболочки

source: _Connect to Existing Kernel...
ru: Подключение к существующему ядру...

source: Sa_ve a Copy...
ru: Сохрани копию...

source: Send _Interrupt
ru: Отправить прерывание

source: _Debug
ru: Отладка

source: _Evaluate %s
ru: Анализ %s

source: Enable Auto-_completion
ru: Включить автозавершение

source: _Filter history by entered prefix
ru: История фильтров по введенному префиксу

source: _Auto-restart when Evaluate File
ru: Авто-перезапуск при анализе файла

source: _Launch Configuration
ru: Конфигурация запуска

source: _Prompt on Stale Environment
ru: Подсказка по устаревшей среде

source: Show IPython _Documentation
ru: Показать документацию IPython

source: Untitled
ru: Без названия

source: Launch %s
ru: Запуск %s

source: Untitled Launch Config
ru: Неозаглавленная Конфигурация Запуска

source: Create Launch Configuration
ru: Создать Конфигурацию Запуска

source: Create a new launch configuration
ru: Создание новой конфигурации запуска

source: Duplicate Launch Configuration
ru: Дублировать Конфигурацию Запуска

source: Duplicate the selected launch configuration
ru: Дублировать выбранную конфигурацию запуска

source: Edit Launch Configuration
ru: Изменить конфигурацию запуска

source: Edit the selected launch configuration
ru: Править выбранную конфигурацию запуска

source: Delete Launch Configuration
ru: Удалить Конфигурацию Запуска

source: Delete the selected launch configuration
ru: Удалить выбранную конфигурацию запуска

source: Show _Docs...
ru: Показать Документы...

source: Manage Launch Configurations
ru: Управление Конфигурациями Запуска

source: Use Duplicate Launch Configuration Name?
ru: Использовать Дубликат Имени Конфигурации Запуска?

source: That launch configuration already exists. Are you sure you want to create two launch configurations named '%s'?
ru: Эта конфигурация запуска уже существует. Вы уверены, что хотите создать две конфигурации запуска с именем '%s'?

source: Named Entry Point:
ru: Именованная Точка Входа:

source: File:
ru: Файл:

source: This launch configuration is used by the following, which will revert to using project-wide settings if the launch configuration is removed:
ru: Эта конфигурация запуска используется таким образом, что вернется к использованию параметров проекта в случае удаления конфигурации запуска:

source: Delete Launch Configuration?
ru: Удалить конфигурацию запуска?

source: Are you sure you want to delete launch configuration '%s'? This cannot be undone.
ru: Вы действительно хотите удалить конфигурацию запуска '%s'? Это не может быть отменено.

source: Launch Configuration: %s
ru: Конфигурация запуска: %s

source: Python Executable '%s' is a full path, which may not work if this launch configuration is shared to other machines or OSes. You may want to use an environment variable reference such as ${ENV} as the first part of the path or use the project setting and configure the project on each machine or OS.
ru: Исполняемый файл Python '%s' - это полный путь, который может не работать, если эта конфигурация запуска используется другими компьютерами или ОС. Можно использовать ссылку на переменную среды, например ${ENV}, в качестве первой части пути или использовать параметр проекта и настроить проект на каждой машине или ОС.

source: Remote Host '%s' is missing a configuration in this project. This launch configuration will not work until one is added.
ru: В этом проекте отсутствует конфигурация удаленного узла '%s'. Эта конфигурация запуска не будет работать, пока не будет добавлена.

source: Python Path entry '%s' is a partial path -- We recommend using full paths to avoid problems locating source files for analysis and debugging. If this launch configuration will be shared to other machines or OSes, use an environment variable reference such as ${WING:PROJECT_DIR} as the first part of the entry.
ru: Запись пути Python '%s' является частичным путем -- мы рекомендуем использовать полные пути, чтобы избежать проблем с поиском исходных файлов для анализа и отладки. Если эта конфигурация запуска будет совместно использоваться другими компьютерами или ОС, используйте ссылку на переменную среды, такую как ${WING:PROJECT_DIR}, в качестве первой части записи.

source: If you must use a partial path, be sure to set Initial Directory under the Python tab.
ru: Если необходимо использовать частичный путь, обязательно задайте начальный каталог на вкладке Python.

source: Python Path entry '%s' is also a partial path
ru: Запись пути Python '%s' также является частичным путем

source: Python Path entry '%s' is a full path which may not work when this launch configuration is shared to another machine or OS. Use an environment variable reference such as ${WING:PROJECT_DIR} as the first part of the path.
ru: Запись пути Python '% s' - полный путь, который может не работать, поскольку эта конфигурация запуска ведет на другой компьютер или ОС. Используйте ссылку в переменной окружения, такую ​​как ${WING: PROJECT_DIR} в качестве первой часть пути.

source: Python Path entry '%s' is also a full path
ru: Запись пути Python '%s' также полный путь

source: Python Path entry '%s' does not exist
ru: Запись пути Python '%s' не существует

source: Python Path entry '%s' is not a directory
ru: Запись пути Python '%s' не является каталогом

source: Build command '%s' could not be found by id or title
ru: Команда сборки '%s' не удалось найти по id или заголовку

source: Environment
ru: Окружение

source: Command line arguments to use when executing or debugging with this launch configuration. Arguments can optionally be delimited by "s or 's. Use \" to add " to an argument and \\" to add \" to an argument. Environment variable references may also be used. A \ that does not precede a ", ', or $ adds a \ to an argument.
ru: Аргументы командной строки для использования при выполнении или отладке с этой конфигурацией запуска. Аргументы могут быть дополнительно разделены "s или 's'. Используйте \"для добавления " к аргументу и \\" для добавления \" к аргументу. Также могут использоваться ссылки на переменные среды. A \, который не предшествует значению ", ' или $, добавляет a \ в аргумент.

source: Environment variables to set before running this command. Entries are in "name=value" format, one per line. Use "name=" (without a value) to unset and remove an inherited environment value. If unspecified, the environment Wing inherits at startup is used.
ru: Переменные среды, которые нужно задать перед выполнением этой команды. Записи в формате "name=value", по одному на строку. Используйте" name= " (без значения), чтобы отменить и удалить унаследованное значение среды. Если не указано, используется среда Wing, наследуемая при запуске.

source: The PYTHONPATH to set when using this launch configuration. The path separator is "%s". The default uses the PYTHONPATH Wing inherited at startup. Otherwise, the specified path is added to Python's sys.path. $(ENV) formatted variables may be used to insert values from the environment or special variables such as $(WING:PROJECT_DIR) for the project directory.
ru: PYTHONPATH требуется установить при использовании этой конфигурации запуска. Сегмент пути - '%s'. По умолчанию используется PYTHONPATH Wing, унаследованный при запуске. В противном случае указанный путь добавляется к sys.path Python. Форматированные переменные $(ENV) могут использоваться для вставки значений из среды или специальных переменных, таких как $(WING: PROJECT_DIR) для каталога проекта.

source: Arguments to pass to the Python interpreter when debugging. The default is to use the value selected in Project Properties, or -u for unbuffered output. Prompts for keyboard input may not appear without the -u option.
ru: Аргументы для передачи интерпретатору Python при отладке. По умолчанию используется значение, выбранное в свойствах проекта, или -u для небуферизованного вывода. Запросы на ввод с клавиатуры могут не отображаться без опции -u.

source: Command to execute before launching. If the launch configuration is shared to other projects, machines, or OSes the command must be given a title and a like-titled command must be created in each project or on each machine.
ru: Команда для выполнения перед запуском. Если конфигурация запуска используется совместно с другими проектами, машинами или операционными системами, команде необходимо присвоить заголовок и создать команду с таким же названием в каждом проекте или на каждом компьютере.

source: Remote
ru: Удаленный

source: The name of the launch configuration
ru: Имя конфигурации запуска

source: Unbuffered (-u)
ru: Небуферизованный (-u)

source: Create a new named entry point
ru: Создать новую именованную точку входа

source: Duplicate the selected named entry point
ru: Дублировать выбранную именованную точку входа

source: Edit the selected named entry point
ru: Править выбранную именованную точку входа

source: Delete the selected named entry point
ru: Удалить выбранную именованную точку входа

source: _Execute
ru: Выполнять

source: Debug Key Binding
ru: Привязка Ключа Отладки

source: Execute Key Binding
ru: Выполнить привязку клавиш

source: Right click on the list for additional operations
ru: Щелкните правой кнопкой мыши по списку дополнительных операций

source: Manage Named Entry Points
ru: Управление именованными точками ввода

source: Overwrite Existing Named Entry Point?
ru: Перезаписать существующую именованную точку входа?

source: That named entry point already exists. Are you sure you want to overwrite the existing named entry point '%s'?
ru: Эта именованная точка входа уже существует. Вы уверены, что хотите перезаписать существующую именованную точку входа '%s'?

source: Confirm Named Entry Point Deletion
ru: Подтверждение Удаления Именованной Точки Входа

source: Are you sure you want to delete named entry point '%s'?
ru: Вы уверены, что хотите удалить именованную точку входа '%s'?

source: Cannot Debug
ru: Не Удается Выполнить Отладку

source: Cannot debug the named entry point. The maximum number of debug processes is already running.
ru: Не удается отладить именованную точку входа. Максимальное число процессов отладки уже запущено.

source: _Set Debug Key Binding...
ru: Установить Привязку Ключа Отладки...

source: Set E_xecute Key Binding...
ru: Установить Привязку Ключа Выполнения...

source: Named Entry Point: %s
ru: Именованная Точка Входа: %s

source: Data
ru: Данные

source: The Python file to launch
ru: Файл Python для запуска

source: The launch environment to use. Either the project environment with specified run arguments, or a selected launch configuration.
ru: Используемая среда запуска. Либо среда проекта с указанными аргументами запуска, либо выбранная конфигурация запуска.

source: Whether to show this dialog before launching this entry point
ru: Нужно ли показывать это диалоговое окно перед запуском точки входа

source: You must specify a file to launch.
ru: Необходимо указать файл для запуска.

source: The selected file does not exist.
ru: Выбранный файл не существует.

source: The selected file is not a Python file. Use the OS Commands tool to launch non-Python files.
ru: Выбранный файл не является файлом Python. Используйте инструмент Команды ОС для запуска файлов, отличных от Python.

source: (from project properties)
ru: (из свойств проекта)

source: The selected launch configuration no longer exists.
ru: Выбранная конфигурация запуска больше не существует.

source: The selected file is stored on remote host '%s' but the selected launch configuration %s is for a host '%s'
ru: Выбранный файл будет храниться на удаленном хосте '%s', но выбранная конфигурации запуска %s предназначена для хоста '%s'

source: The selected file is stored on remote host '%s' but the selected launch configuration %s is for localhost
ru: The selected file is stored on remote host but the selected launch configuration is for localhost Выбранный файл хранится на удаленном хосте '%s', но выбранная конфигурация запуска %s предназначена для localhost

source: The selected file is stored on localhost but the selected launch configuration %s is for a remote host '%s'
ru: Выбранный файл хранится на localhost, но выбранная конфигурация запуска %s предназначена для удаленного узла '%s'

source: The key binding assigned to initiate debug of the named entry point
ru: Привязка ключа, назначенная для инициирования отладки именованной точки входа

source: The key binding assigned to initiate execution (without debugger) of the named entry point
ru: Привязка ключа, назначенная для запуска выполнения (без отладчика) именованной точки входа

source: Key Binding
ru: Ключевое связывание

source: Modules
ru: Модули

source: Module-oriented Debug Data View (sys.modules)
ru: Модуль-ориентированный просмотр данных отладки (sys.modules)

source: _Options
ru: Опции

source: No Remote Hosts
ru: Нет Удаленных Хостов

source: No remote hosts have been configured. Do you want to add one now?
ru: Не настроены удаленные хосты. Вы хотите добавить его сейчас?

source: No Shared Remote Hosts
ru: Нет Общих Удаленных Узлов

source: No shared remote hosts have been configured. Do you want to add one now?
ru: Не настроены общие удаленные хосты. Вы хотите добавить его сейчас?

source: Configuring wingdbstub.py
ru: Настройка wingdbstub.py

source: Converting EOLs for remote host
ru: Преобразование EOLs для удаленного хоста

source: Installing remote agent:
ru: Установка удаленного агента:

source: Timed out
ru: Время вышло

source: Installing Remote Agent: %s
ru: Установка удаленного агента: %s

source: Please wait.
ru: Пожалуйста, подождите.
