Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_guimgr.po
Languages: de, ru

source: Project P_roperties...
de: Projekt_eigenschaften...
ru: Свойства проекта...

source: _Start / Continue
de: _Starten / Fortsetzen
ru: Начать / продолжить

source: Debug _To Cursor
de: Bis zum _Cursor debuggen
ru: Отладка до курсора

source: Debug Current _File
de: Aktuelle _Datei debuggen
ru: Отладка текущего файла

source: _Attach to Process...
de: An P_rozess anhängen...
ru: _Присоединить к процессу...

source: Det_ach from Process
de: Vom P_rozess abtrennen
ru: Отключение от процесса

source: P_ause
ru: Пауза

source: S_top Debugging
de: Debuggen _stoppen
ru: Остановить отладку

source: Restart Debu_gging
de: Debuggen _neu starten
ru: Перезапустить отладку

source: Step _Into
de: _In Funktion
ru: Шаг _Into

source: Step Over _Instruction
de: Springe über _Funktion
ru: Шаг Over _Instruction

source: Step _Over Statement
de: Springe über _Anweisung
ru: Шаг _Over Statement

source: Step Over _Block
de: Springe über _Block
ru: Шаг Over _Block

source: Step _Over
de: Ü_ber Funktion
ru: Шаг _Over

source: Step O_ut
de: _Aus Funktion
ru: Шаг O_ut

source: Step Out to He_re
de: Hier _herausspringen
ru: Шаг из этого места на выход

source: U_p Stack
de: Auf_wärts Stack
ru: Вверх по стеку

source: Dow_n Stack
de: A_bwärts Stack
ru: Вниз по стеку

source: S_how Original Position
de: Original Position anzeigen
ru: Показать исходную позицию

source: Add _Breakpoint
de: _Haltepunkt hinzufügen
ru: Добавить точку останова

source: Remove _Breakpoint
de: _Haltepunkt entfernen
ru: Удалить точку останова

source: Remo_ve All Breakpoints
de: Alle Haltepunkte _entfernen
ru: Удалить все точки останова

source: Brea_kpoint Options
de: Haltepunkt-_Optionen
ru: Параметры точки останова

source: Set _Temporary Breakpoint
de: _Temporären Haltepunkt setzen
ru: Установить временную точку останова

source: Set _Conditional Breakpoint...
de: _Bedingten Haltepunkt setzen...
ru: Установить условную точку останова...

source: Edit Breakpoint C_ondition...
de: Haltepunkt-B_edingungen bearbeiten...
ru: Изменить условие точки останова...

source: _Disable Breakpoint
de: Haltepunkt _deaktivieren
ru: _Отключить Точку Останова

source: _Enable Breakpoint
de: Haltepunkt _aktivieren
ru: _Включить Точку Останова

source: Disable _All Breakpoints
de: Alle _Haltepunkte deaktivieren
ru: Отключить все точки останова

source: Enable _All Breakpoints
de: Alle _Haltepunkte aktivieren
ru: Включить все точки останова

source: Set Breakpoint I_gnore Count...
de: I_gnorieranzahl für Haltepunkt setzen...
ru: Установить счетчик игнорирования точки останова...

source: Named Entry Point_s...
de: Benannte Einsprungs_punkte...
ru: Именованные точки входа...

source: E_xecute Current File
de: A_ktuelle Datei ausführen
ru: Выполнить текущий файл

source: Clear Ignored Exceptions
de: Ignorierte Exceptions löschen
ru: Очистить игнорируемые исключения

source: Clear Stored Value Errors
de: Ges_peichte Wertefehler löschen
ru: Очистить сохраненные значения ошибок

source: Debug Environment...
de: Debug-Umgebung...
ru: Среда отладки...

source: Run _All Tests
de: _Alle Tests starten
ru: Выполнить все тесты

source: Run Tests in Current _File
de: Tests in aktueller _Datei starten
ru: Выполненить тесты в текущем файле

source: Run Tests at _Cursor
de: Tests am Cursor starten
ru: Выполненить тесты под курсором

source: Run Fa_iled Tests
de: Fehlgeschlagene Tests nochmal starten
ru: Запуск неудачных тестов

source: Run T_ests Again
de: Tests nochmal starten
ru: Повторное выполнение тестов

source: _Abort Running Tests
de: Laufende Tests abbrechen
ru: _Прервать Выполнение Тестов

source: Debug _All Tests
de: Alle Tests debuggen
ru: Отладка всех тестов

source: Debug Tests in Current _File
de: Test in aktueller _Datei debuggen
ru: Отладка тестов в текущем файле

source: Debug Tests at _Cursor
de: Test am _Cursor debuggen
ru: Отладка тестов под курсоором

source: Debug Fa_iled Tests
de: Fehlgeschlagene Tests debuggen
ru: Отладка неудачных тестов

source: De_bug T_ests Again
de: Tests nochmal debuggen
ru: Повторная отладка тестов

source: Add Files from _Project...
de: Dateien vom _Projekt hinzufügen...
ru: Добавить файлы из проекта...

source: Add Single Fi_le...
de: _Einzelne Datei hinzufügen...
ru: Добавить один файл...

source: A_dd Current File
de: Ak_tuelle Datei hinzufügen
ru: Добавить текущий файл

source: _Save All Results...
de: Alle Ergebnisse speichern...
ru: Сохранить все результаты...

source: _Load Results...
de: Ergebnisse _laden...
ru: _Загрузить Результаты...

source: _Load Perspective
de: Perspektive _laden
ru: _Загрузить Перспективу

source: Enable Auto-Perspectives
de: Automatische Perspektiven aktivieren
ru: Включить Auto-Perspectives

source: Disable Auto-Perspectives
de: Automatische Perspektiven deaktivieren
ru: Отключить Auto-Perspectives

source: _Manage Perspectives...
de: Perspektiven verwalten...
ru: _Управление перспективами...

source: Restore Default T_ool Set
de: Standard-Wer_kzeugset wiederherstellen
ru: Восстановить набор инструментов по умолчанию

source: Start _Terminal
de: _Terminal starten
ru: Пуск Терминала

source: New _Document Window
de: Neues _Dokumentfenster
ru: Окно нового документа

source: New _Tool Window
de: Neues _Werkzeugfenster
ru: Новое окно инструмента

source: _Next Window
de: _Nächstes Fenster
ru: Следующее окно

source: Ne_xt Document
de: Nä_chstes Dokument
ru: Следующий документ

source: Pre_vious Document
de: _Vorheriges Dokument
ru: Предыдущий документ

source: _Most Recent Document
de: Le_tztes Dokument
ru: Последний документ

source: Move _Focus
de: _Fokus verschieben
ru: Переместить фокус

source: Next Visit in _History
ru: Следующий визит в историю

source: Previous Visit in H_istory
ru: Предыдущий визит в истории

source: Wing _Manual
de: Wing _Handbuch
ru: Wing _Руководство

source: Tut_orial
ru: У_чебник

source: _Quick Start Guide
de: Wing Schnellstart-_Anleitung
ru: Инструкция по началу работы

source: _Search Help
de: Hilfe durch_suchen
ru: Поиск в справке

source: Des_cribe Key...
de: Taste erklären...
ru: Описание ключа...

source: Wing _Tips...
de: Wing _Tipps...
ru: Wing _Подсказки...

source: Python _Website...
de: Python-_Webseite...
ru: Python вебсайт...

source: Ask Questions...
de: Fragen stellen...
ru: Задать вопросы...

source: Submit _Feedback...
de: _Feedback einreichen...
ru: Отправить отзыв...

source: Submit _Bug Report...
de: Fehler_bericht einreichen...
ru: Отправить отчет об ошибке...

source: Technica_l Support...
de: Te_chnischer Support...
ru: Техническая поддержка...

source: Check for _Updates...
de: Nach _Aktualisierungen suchen...
ru: Проверка наличия обновлений...

source: _About...
de: Ü_ber...
ru: _О программе...

source: _Edit
de: _Bearbeiten
ru: _Правка

source: _Source
de: _Quelltext
ru: _Источник

source: _Refactor
de: _Refaktorierung
ru: _Рефакторинг

source: _Tools
de: _Werkzeuge
ru: И_нструменты

source: _Help
de: _Hilfe
ru: _Помощь

source: Open...
de: Öffnen...
ru: Открыть...

source: Save
de: Speichern
ru: Сохранить

source: Save the active document
de: Das aktuelle Dokument speichern
ru: Сохранение активного документа

source: Save All
de: Alles Speichern
ru: Сохранить все

source: Cut
de: Ausschneiden
ru: Вырезать

source: Copy
de: Kopieren
ru: Копировать

source: Paste
de: Einfügen
ru: Вставить

source: Undo
de: Rückgängig
ru: Отменить

source: Redo
de: Wiederherstellen
ru: Повторить

source: Goto Definition
de: Gehe zur Definition
ru: Перейти к определению

source: Search
de: Suchen
ru: Поиск

source: Execute Toolbar Search
de: Werkzeugleisten-Suche durchführen
ru: Найти панель инструментов

source: Indent
de: Einrücken
ru: Абзац

source: Indent the selected region one level
de: Ausgewählte Region eine Stufe einrücken
ru: Отступ выбранной области один уровень

source: Dedent
de: Ausrücken
ru: Убрать абзац

source: Un-indent the selected region one level
de: Ausgewählte Region eine Stufe ausrücken
ru: Отменить отступ выделенной области на один уровень

source: Adjust selected region indent to match context, or one level higher if already matching
ru: Настройте отступ выбранной области в соответствии с контекстом или на один уровень выше, если он уже соответствует

source: Diff/Merge
de: Vergleichen/Zusammenführen
ru: Сравнение/Слияние

source: Difference/Merge
de: Vergleichen/Zusammenführen
ru: Разница/Слияние

source: Merge A->B
de: Zusammenführen A->B
ru: Слияние A-> B

source: Merge B->A
de: Zusammenführen B->A
ru: Слияние B-> A

source: Cancel Diff/Merge Session
de: Vergleichen/Zusammenführen-Sitzung abbrechen
ru: Отмена сеанса сравнения/слияния

source: Python Environment
de: Python Umgebung
ru: Среда Python

source: Project Properties
de: Projekteigenschaften
ru: Свойства проекта

source: Run
de: Ausführen
ru: Выполнить

source: Break
de: Haltepunkt
ru: Прервать

source: Debug
de: Debuggen
ru: Отладчик

source: Step Into
de: In Funktion
ru: Шаг в

source: Debug To Cursor
de: Bis zum Cursor debuggen
ru: Отладка до курсора

source: Stop
de: Stoppen
ru: Остановить

source: Restart
de: Neustart
ru: Перезапустить

source: Pause
de: Anhalten
ru: Пауза

source: Step Over
de: Über Funktion
ru: Шаг За

source: Step Out
de: Aus Funktion
ru: Выйти

source: Up Stack
de: Aufwärts Stack
ru: Вверх по стеку

source: Show Position
de: Position anzeigen
ru: Показать позицию

source: Down Stack
de: Abwärts Stack
ru: Вниз стека

source: Run Tests
de: Tests starten
ru: Запуск тестов

source: Abort Tests
de: Tests abbrechen
ru: Прервать тесты

source: Run All Tests
de: Alle Tests starten
ru: Выполнить все тесты

source: Debug Tests
de: Tests debuggen
ru: Отладочные тесты

source: Debug All Tests
de: Alle Tests debuggen
ru: Отладка всех тестов

source: Update
de: Aktualisieren
ru: Обновить

source: Commit
de: Absenden
ru: Фиксировать

source: View Diffs
de: Unterschiede anzeigen
ru: Просмотр различий

source: Status
ru: Статус

source: Create Bookmark
de: Lesezeichen erstellen
ru: Создать закладку

source: Goto Bookmark
de: Gehe zu Lesezeichen
ru: Перейти к закладке

source: Go to selected bookmark
de: Gehe zum ausgewählten Lesezeichen
ru: Перейти к выбранной закладке

source: Previous Bookmark
de: Vorheriges Lesezeichen
ru: Предыдущая закладка

source: Next Bookmark
de: Nächstes Lesezeichen
ru: Следующая закладка

source: Search in Files
de: In Dateien suchen
ru: Поиск в файлах

source: Pause Search
de: Suche pausieren
ru: Приостановить поиск

source: Previous Match
de: Vorheriger Treffer
ru: Предыдущее совпадение

source: Next Match
de: Nächster Treffer
ru: Следующее совпадение

source: Previous
de: Vorherige
ru: Предыдущий

source: Next
de: Nächste
ru: Следующий

source: Contents
de: Inhalt
ru: Оглавление

source: Close
de: Schließen
ru: Закрыть

source: Wing Tips
de: Wing Tipps
ru: Wing советы

source: Select from recently visited documents
de: Aus zuletzt besuchten Dokumenten auswählen
ru: Выбрать из недавно полученных документов

source: History
de: Historie
ru: История

source: Help
de: Hilfe
ru: Справка

source: Wing Help
de: Wing Hilfe
ru: Справка Wing

source: Could not find document section %s: Please report this error to bugs@wingware.com
de: Dokumentenabschnitt %s wurde nicht gefunden: Bitte melden Sie diesen Fehler an bugs@wingware.com
ru: Не удалось найти раздел документа %s: сообщите об этой ошибке bugs@wingware.com

source: Could not find document
de: Dokument wurde nicht gefunden
ru: Не удалось найти документ

source: Copy Text to Clipboard
de: Text in die Zwischenablage kopieren
ru: Копировать текст в буфер обмена

source: Copy HTML to Clipboard
de: HTML in die Zwischenablage kopieren
ru: Скопировать HTML в буфер обмена

source: Smaller Font
de: Kleinere Schriftart
ru: Мелкий шрифт

source: Larger Font
de: Größere Schriftart
ru: Крупный шрифт

source: Help view state
de: Zustand der Hilfeansicht
ru: Состояние просмотра справки

source: Wing: Submit Bug Report
de: Wing: Fehlerbericht einreichen
ru: Wing: Отправить Сообщение Об Ошибке

source: Wing: Please Send Feedback
de: Wing: Bitten senden Sie Feedback
ru: Wing: Пожалуйста, отправьте отзыв

source: _Do Later
de: _Später vornehmen
ru: _Выполнить Позже

source: _Submit Now
de: _Jetzt einreichen
ru: _Отправить сейчас

source: Configure Proxy...
de: Proxy konfigurieren...
ru: Настроить прокси...

source: Show this dialog on unexpected errors
de: Diesen Dialog bei unerwarteten Fehlern anzeigen
ru: Показывать это диалоговое окно при непредвиденных ошибках

source: Show this dialog when quitting
de: Diesen Dialog beim Beenden anzeigen
ru: Показывать этот диалог при выходе

source: Include error log: %s (%i KB)
de: Fehlerprotokoll aufnehmen: %s (%i KB)
ru: Включить журнал ошибок: %s (%i КБ)

source: Please provide as much information as possible about what caused the bug that you are reporting.
de: Bitte stellen Sie uns möglichst viele Informationen über die Ursache des Fehlers, den Sie berichten, bereit.
ru: Пожалуйста, предоставьте как можно больше информации о том, что вызвало ошибку, о которой вы сообщаете.

source: An unexpected error occurred. Please submit this bug report to us, with as much additional information as possible about what caused the problem. Sorry for this inconvenience -- submitting a report will help us to fix the problem sooner.
de: Ein unerwarteter Fehler ist aufgetreten. Bitte reichen Sie uns diesen Fehlerbericht ein und fügen Sie möglichst viele Informationen über die Ursache des Problems hinzu. Wir entschuldigen uns für die Unannehmlichkeiten. Das Einreichen eines Berichtes hilft uns, das Problem schneller zu beheben.
ru: Произошла непредвиденная ошибка. Отправьте нам этот отчет об ошибке, указав как можно больше дополнительной информации о том, что вызвало проблему. Извините за это неудобство -- отправка отчета поможет нам решить проблему быстрее.

source: Please tell us what you think! Your feedback drives our product development.
de: Bitte sagen Sie uns Ihre Meinung! Ihre Rückmeldung treibt unsere Produktentwicklung voran.
ru: Пожалуйста, сообщите нам, что вы думаете! Ваш отзыв поможет развитию нашего продукта.

source: You can also do this later from the Help menu.
de: Sie können dies auch später vom Hilfe-Menü aus durchführen.
ru: Вы также можете сделать это позже из меню Справка.

source: Submitting
de: Einreichen
ru: Представления

source: Submitting to wingware.com. Please wait
de: Einreichen bei wingware.com. Bitte warten
ru: Отправка в wingware.com. Подождите

source: Collecting Data
de: Erfassung von Daten
ru: Сбор данных

source: Nothing to Submit
de: Nichts zum Einreichen
ru: Нечего посылать

source: Nothing was entered in summary or detail.
de: In den Feldern Zusammenfassung oder Einzelheiten ist keine Eingabe vorhanden.
ru: Ничего не было указано в резюме или деталях.

source: Encoding Data
de: Daten werden verschlüsselt
ru: Кодирование данных

source: Creating Request
de: Anfrage wird erstellt
ru: Создаем запрос

source: Opening Connection
de: Verbindung wird eröffnet
ru: Открытие соединения

source: Reading Reply
de: Antwort wird gelesen
ru: Чтение ответа

source: Closing Connection
de: Verbindung wird geschlossen
ru: Закрытие соединения

source: Submit Error
de: Fehler einreichen
ru: Ошибка отправки

source: Received unexpected response. There may be a network problem: %s
de: Unerwartete Antwort wurde erhalten. Es kann ein Netzwerkproblem vorliegen: %s
ru: Получил неожиданный ответ. Возможны неполадки в сети: %s

source: Bug Report Submitted
de: Fehlerbericht wurde eingereicht
ru: Сообщение об ошибке отправлено

source: Feedback Submitted
de: Feedback wurde eingereicht
ru: Отзыв передан

source: Cancel Bug Report?
de: Fehler-Report abbrechen?
ru: Отменить отчет об ошибке?

source: Cancel Feedback?
de: Rückmeldung abbrechen?
ru: Отменить отзыв?

source: Are you sure you want to cancel? Any text you have entered will be lost.
ru: Вы уверены, что хотите отменить? Любой текст, который вы ввели, будут потеряны.

source: No Project
de: Kein Projekt
ru: Нет проекта

source: Add Directory to Project?
de: Verzeichnis zum Projekte hinzufügen?
ru: Добавить каталог в проект?

source: Would you like to add %s to your project?
de: Möchten Sie '%s' zu Ihrem Projekt hinzufügen?
ru: Хотите добавить %s в свой проект?

source: Add Directories to Project?
de: Verzeichnisse zum Projekte hinzufügen?
ru: Добавить каталоги в проект?

source: Please select directories to add to the project:
de: Bitte wählen Sie die Verzeichnisse, die zum Projekt hinzugefügt werden sollen:
ru: Выберите каталоги для добавления в проект:

source: Failed language change
de: Änderung der Sprache fehlgeschlagen
ru: Ошибка смены языка

source: Failed to remove %s -- the language cannot be changed until this file can be removed.
de: Das Entfernen von %s ist fehlgeschlagen -- Die Sprache kann erst geändert werden, wenn diese Datei entfernt wurde.
ru: Не удалось удалить %s -- язык не может быть изменен до тех пор, пока этот файл не будет удален.

source: Failed to write %s -- the language cannot be changed until this file can be written.
de: Das Speichern von %s ist fehlgeschlagen -- Die Sprache kann erst geändert werden, wenn diese Datei gespeichert wurde.
ru: Не удалось записать %s -- язык не может быть изменен до тех пор, пока этот файл не будет записан.

source: _Restart Now
de: Jetzt _neu starten
ru: _Перезагрузить сейчас

source: Cannot Open Remote File
de: Remote-Datei konnte nicht geöffnet werden
ru: Не удается открыть удаленный файл

source: This version of Wing cannot open remote files like %s
de: Diese Version von Wing kann keine Remote-Datei öffnen wie %s
ru: Эта версия Wing не может открывать удаленные файлы, такие как %s

source: Document Open Failed
de: Dokument öffnen gescheitert
ru: Не удалось открыть документ

source: Failed to open document '%s'
de: Öffnen des Dokumentes '%s' gescheitert
ru: Не удалось открыть документ '%s'

source: Could not show panel
de: Feld konnte nicht angezeigt werden
ru: Не удалось отобразить панель

source: Could not display requested panel of type '%s' (unknown panel type)
de: Angefordertes Feld des Typs '%s' konnte nicht angezeigt werden (unbekannter Feldtyp)
ru: Не удалось отобразить запрошенную панель типа '%s' (неизвестный тип панели)

source: No Project Open
de: Kein Projekt geöffnet
ru: Нет открытого проекта

source: The file to select
de: Datei zum auswählen
ru: Выбираемый файл

source: Select file:
de: Datei Auswählen:
ru: Выберите файл:

source: General failure obtaining application-wide visual state
de: Allgemeiner Fehler beim Abrufen des anwendungsweiten visuellen Zustandes
ru: Общий сбой при получении визуального состояния на уровне приложения

source: No windows in application-wide state
de: Keine Fenster im anwendungsweiten Zustand
ru: Нет окон в состоянии приложения

source: Creating window
de: Erstelle Fenster
ru: Создание окна

source: Creating window #%i...
de: Erstelle Fenster #%i...
ru: Создание окна #%i ...

source: Configuring window...
de: Fenster konfigurieren...
ru: Настройка окна...

source: Configuring window (%i)...
de: Konfiguriere Fenster (%i)...
ru: Окно настройки (%i)...

source: Could not set tool window visual state: No notebook view
de: Visueller Zustand für Werkzeugfenster konnte nicht eingestellt werden: Keine Notizbuchansicht
ru: Не удалось установить визуальное состояние окна инструмента: No notebook view

source: General failure in setting application-wide state
de: Allgemeiner Fehler beim Setzen des anwendungsweiten Zustandes
ru: Общий сбой при настройке состояния приложения

source: Auto-Save Files Before Debug or Execute
ru: Автоматическое сохранение файлов перед отладкой или выполнением

source: Default Project
de: Standard Projekt
ru: Проект по умолчанию

source: Failed to set panel window state:
de: Setzen des Feldfenster-Zustandes ist fehlgeschlagen:
ru: Не удалось установить состояние окна панели:

source: Toolbox: %s: Wing
de: Werkzeugkasten: %s: Wing
ru: Панель инструментов:: %s: Wing

source: Toolbox: Wing
de: Werkzeugkasten: Wing
ru: Панель инструментов: Wing

source: Failed to save portions of visual state for %s:
de: Das Speichern von Teilen des visuellen Zustandes für %s ist fehlgeschlagen:
ru: Не удалось сохранить части визуального состояния для% s:

source: Really Restore Default Tools?
de: Standard-Werkzeuge wirklich wiederherstellen?
ru: Действительно восстановить инструменты по умолчанию?

source: This command will close all currently open tools and restore the factory default tool set for the perspective '%s'. Are you sure you want to do this?
de: Dieser Befehl wird alle derzeitig geöffneten Werkzeuge schließen und den Standard-Werkzeug-Satz für die Ansicht '%s' wiederherstellen. Möchten Sie dies wirklich ausführen?
ru: Эта команда закроет все доступные в настоящее время инструменты и восстановит заводские настройки по умолчанию для перспективы "%s". Вы уверены, что хотите это сделать?

source: This command will close all currently open tools and restore the factory default tool set for user-defined perspectives. Are you sure you want to do this?
de: Dieser Befehl wird alle derzeitig geöffneten Werkzeuge schließen und den Standard-Werkzeug-Satz für Benutzer-definierte Ansichten wiederherstellen. Möchten Sie dies wirklich ausführen?
ru: Эта команда закроет все открытые в настоящее время инструменты и восстановит заводские настройки по умолчанию для пользовательских перспектив. Вы уверены, что хотите это сделать?

source: This command will close all currently open tools and restore the factory default tool set. Are you sure you want to do this?
de: Dieser Befehl wird alle derzeitig geöffneten Werkzeuge schließen und den Standard-Werkzeug-Satz wiederherstellen. Möchten Sie dies wirklich ausführen?
ru: Эта команда закроет все открытые инструменты и восстановит заводские настройки по умолчанию. Вы уверены, что хотите это сделать?

source: _Yes
de: _Ja
ru: _Да

source: _No
de: _Nein
ru: _Нет

source: (named entry point)
de: (Benannter Einsprungspunkt)
ru: (именованная точка входа)

source: Left
de: Links
ru: Влево

source: Right
de: Rechts
ru: Вправо

source: Bottom
de: Unten
ru: Вниз

source: Top
de: Oben
ru: Вверх

source: %sToolbox
de: %sWerkzeugkasten
ru: %sПанель инструментов

source: %sToolbox Split #%i
ru: %sРазделение панели инструментов #%i

source: Insert Tool
de: Werkzeug einfügen
ru: Добавить инструмент

source: New Window
de: Neues Fenster
ru: Новое окно

source: Window %s
de: Fenster %s
ru: Окно %s

source: Move %s to
de: %s verschieben in
ru: Переместить %s в

source: Remove %s
de: %s entfernen
ru: Удалить %s

source: %s Key Binding
de: %s Tastenbelegung
ru: %s привязка клавиш

source: Key binding used to show the most recently accessed %s
ru: Ключ привязки, для наиболее часто используемые %s

source: Set Key Binding for %s...
de: Tastenbelegung für %s setzen...
ru: Установить привязку клавиш для %s ...

source: Put Toolbox Back Into %s
de: Werkzeugkasten nach %s zurücksenden
ru: Вставить Toolbox обратно в %s

source: Move Toolbox to Right
de: Werkzeugkasten nach rechts verschieben
ru: Переместить панель инструментов вправо

source: Move Toolbox to Left
de: Werkzeugkasten nach links verschieben
ru: Переместить панель инструментов влево

source: Move Toolbox to Top
de: Werkzeugkasten nach oben verschieben
ru: Переместить панель инструментов вверх

source: Move Toolbox to Bottom
de: Werkzeugkasten nach unten verschieben
ru: Переместить панель инструментов вниз

source: Move Toolbox to New Window
de: Werkzeugkasten in neues Fenster verschieben
ru: Переместить панель инструментов в новое окно

source: Move Toolbox Split #%i to New Window
de: Werkzeugkasten-Teilung #%i in neues Fenster verschieben
ru: Переместить разделяемую панель инструментов #%i в новое окно

source: Add Toolbox Split
de: Teilung des Werkzeugkastens hinzufügen
ru: Добавить разделение панели инструментов

source: Remove Toolbox Split
de: Teilung des Werkzeugkastens entfernen
ru: Удалить разделение панели инструментов
