Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_refactoring.po
Languages: ru

source: _Rename Symbol
ru: Переименовать Обозначение

source: _Move Symbol
ru: Переместить Символ

source: E_xtract Function / Method
ru: Извлечь Функцию / Метод

source: _Introduce Variable
ru: Ввести Переменную

source: Symbol to _lowerCamelCase
ru: Обозначение в lowerCamelCase

source: Symbol to _UpperCamelCase
ru: Обозначение в UpperCamelCase

source: Symbol to under_scored_name
ru: Обозначение в under_scored_name

source: Symbol to UNDER_SCORED_NAME
ru: Обозначение в UNDER_SCORED_NAME

source: Select code to refactor in the editor and then use the Refactor menu
ru: Выберите код для рефакторинга в редакторе, а затем используйте меню Рефакторинг

source: Show Refactoring Documentation
ru: Показать Документацию По Рефакторингу

source: _Name:
ru: Имя:

source: _Toplevel Function
ru: Функция Верхнего Уровня

source: _Method
ru: Метод

source: N_ested Function
ru: Вложенная функция

source: E_xtract
ru: Извлечь

source: _Revert
ru: Вернуть

source: Revert all changes?
ru: Отменить все изменения?

source: Other changes were made to files. Revert them all?
ru: Были внесены другие изменения в файлы. Вернуть их всех?

source: line %s
ru: строка %s

source: lines %s through %s
ru: строки %s через %s

source: Extracting %s
ru: Извлечь %s

source: Extract function / method
ru: Извлечь function / method

source: Introducing Variable for: %s
ru: Ввести переменную для: %s

source: Introduce Variable
ru: Ввести переменную

source: Refresh
ru: Обновить

source: Show Possible Uses
ru: Показать Возможные Применения

source: Show Unlikely Uses
ru: Показать Маловероятное Использование

source: Search Project Files
ru: Поиск Файлов Проекта

source: Search for uses in all Python files in the project
ru: Искать во всех Python файлах в проекте

source: Search Original File
ru: Поиск Исходного Файла

source: Search for uses in the file where the symbol was selected
ru: Поиск использования в файле, где был выбран символ

source: Searching...
ru: Поиск...

source: New _Name:
ru: Новое имя:

source: _Rename Checked
ru: Переименовать отмеченные

source: Revert
ru: Вернуть

source: Rename in progress
ru: Переименование в процессе

source: Renaming %s to %s
ru: Переименовано %s из %s

source: Reverting renaming %s to %s
ru: Отмена переименования %s в %s

source: Rename
ru: Переименовать

source: <module global scope>
ru: <глобальная область модуля>

source: Destination
ru: Назначение

source: Destination File
ru: Файл назначения

source: _File:
ru: Файл:

source: _Scope:
ru: Область:

source: in
ru: в

source: moving %s to %s
ru: перемещение %s в %s

source: Move in progress
ru: Ход выполнения

source: Reverting
ru: Откат

source: Move
ru: Переместить

source: Refactoring
ru: Рефакторинг

source: Can't introduce variable because original expression is not valid
ru: Не удается ввести переменную, так как исходное выражение недопустимо

source: module %s
ru: модуль %s

source: class %s in %s
ru: класс %s в %s

source: method %s of %s in %s
ru: метод %s %s в %s

source: function %s in %s
ru: функция %s в %s

source: module
ru: модуль
