Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_browser.po
Languages: fr

source: Methods
fr: les méthodes

source: Functions
fr: les fonctions

source: Classes
fr: les classes

source: Attributes
fr: les attributs

source: Derived Classes
fr: Classes dérivées

source: Variables
fr: les variables

source: Follow Selection
fr: Suivre la sélection

source: When checked, the browser selection is visited in a non-sticky editor that auto-closes when hidden. Double clicking always opens a sticky (non-transient) file for editing.
fr: Si activé, la sélection de l'explorateur est visitée dans un éditeur temporaire qui se ferme automatiquement lorsqu'il est masqué. Double-cliquer ouvre toujours un fichier permanent (non-temporaire) pour l'éditer.

source: Private
fr: Privée

source: Semi-Private
fr: Semi-privée

source: Inherited
fr: Héritée

source: Imported
fr: Importée

source: Class Hierarchy
fr: Hiérarchie de classe

source: By Module
fr: Par module

source: All Classes
fr: Toutes les classes

source: Current Module
fr: Module actuel

source: Current Package
fr: Paquet actuel

source: Python Path
fr: Chemin Python

source: Browse Project Modules
fr: Parcourir les modules du projet

source: Browse Project Classes
fr: Parcourir les classes du projet

source: Browse Current Module
fr: Parcourir le module actuel

source: <i>no children</i>
fr: <i>pas d'enfants</i>

source: No symbols
fr: Pas de symboles

source: All symbols hidden
fr: Tous les symboles sont masqués

source: Public Symbols
fr: les symboles publics

source: Semi-Private Symbols
fr: les symboles semi-privés

source: Private Symbols
fr: les symboles privés

source: Inherited Symbols
fr: les symboles hérités

source: Imported Symbols
fr: les symboles importés

source: Sort Alphabetically
fr: Tri alphabétique

source: Sort by Type
fr: Tri par type

source: Sort in File Order
fr: Tri dans l'ordre du fichier

source: Hide
fr: Masquer

source: Show
fr: Afficher

source: Show Source Browser Documentation
fr: Afficher la documentation de l'Explorateur de source

source: Goto Source
fr: Aller à la source

source: Cannot find base class
fr: N'a pas pu trouver la classe de base

source: Cannot find an instance of the base class to display. If imported symbols are not visible in the browser, showing them may enable the base class to be displayed. You may also need to adjust other symbol visibility options
fr: Impossible de trouver une instance de la classe de base à afficher. Si les symboles importés ne sont pas visible dans l'explorateur, les montrer peut rendre la classe de base affichable. Vous aurez sans doute aussi besoin d'ajuster les options de visibilité des autres symboles

source: base class
fr: classe de base

source: Goto
fr: Aller à

source: Find Points of Use
fr: Trouver les points d'utilisations

source: Source browser state
fr: État de l'explorateur de source

source: Source browser visibility option %s
fr: Option de visibilité de l'explorateur de source %s

source: Source Browser
fr: Source-Explorateur

source: Source Code Module and Class Browser
fr: Modules du code source et explorateur de classe
