Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit.po
Languages: de, fr, ru

source: Sets size of an indent, in spaces, used in new files. This is overridden in non-empty files, according to the actual contents of the file. In files with tab-only indentation, this value may be modified so it is a multiple of the configured tab size. Use the Indentation Manager to alter indentation in existing files.
de: Stellt die Größe eines Einzugs (in Leerzeichen) ein, die in neuen Dateien verwendet werden. Dies wird in nicht-leeren Dateien außer Kraft gesetzt, entsprechend den aktuellen Inhalten der Datei. In Dateien mit Nur-Tab Einrückung wird diese Einstellung automatisch geändert so das es ein Vielfaches der Tabgröße wird. Verwenden Sie den Einrückungsmanager, um Einrückungen in bestehenden Dateien zu ändern.
fr: Définir la taille des indentations, en espaces, utilisées dans les nouveaux fichiers. Elle est ecrasée dans les fichiers non vides, en accord avec les contenus effectifs du fichier. Dans les fichiers avec des indentations uniquement en tabulations, cette valeur peut être modifiée, c'est alors un multiple de la taille de tabulation configurée. Utiliser le gestionnaire d'indentations pour modifier l'indentation des fichiers existants.
ru: Задает Размер отступа в пробелах, используемых в новых файлах. Это переопределяется в непустых файлах в соответствии с фактическим содержимым файла. В файлах с отступом только для табуляции это значение может быть изменено, поэтому оно кратно настроенному размеру табуляции. Используйте Диспетчер Отступов для изменения отступов в существующих файлах.

source: Set the style of indentation used in new files. This is overridden in non-empty files, according to the actual contents of the file. Use the Indentation Manager to alter indentation in existing files.
fr: Définir la taille des indentations, en espaces, utilisées dans les nouveaux fichiers. Elle est écrasée dans les fichiers non vides, en accord avec les contenus effectifs du fichier. Dans les fichiers avec des indentations uniquement en tabulations, cette valeur peut être modifiée, c'est alors un multiple de la taille de tabulation configurée. Utiliser le gestionnaire d'indentations pour modifier l'indentation des fichiers existants.
ru: Задайте стиль отступа, используемый в новых файлах. Это переопределяется в непустых файлах в соответствии с фактическим содержимым файла. Используйте Диспетчер Отступов для изменения отступов в существующих файлах.

source: Mixed Tabs and Spaces
de: Gemischte Tabs und Leerzeichen
fr: Tabulations et espaces mixés
ru: Смешанные вкладки и пробелы

source: Set to show a warning dialog when opening a Python file that contains potentially problematic indentation: Either inconsistent and possibly confusing indentation, a mix of indent styles in a single file, or mixed tab and space indentation (which is not recommended for Python).
fr: Affecter pour afficher une boîte de dialogue d'avertissement lors de l'ouverture d'un fichier Python qui contient potentiellement une indentation problématique. Soit inconsistante et possiblement une indentation confuse, un mix de styles d'indents dans un simple fichier, ou des indentations de tabulations et d'espace mixées (ce qui n'est pas recommandé pour Python).
ru: Установите для отображения диалогового окна предупреждения при открытии файла Python, который содержит потенциально проблемные отступы: либо несогласованные и, возможно, запутанные отступы, сочетание стилей отступов в одном файле, или смешанные символы табуляции и отступы в пробелах(который не рекомендуется для Python).

source: Show Warnings and Errors
de: Warnungen und Fehler anzeigen
fr: Afficher avertissements et erreurs
ru: Показывать предупреждения и ошибки

source: Show Errors only
de: Nur Fehler anzeigen
fr: Afficher uniquement les erreurs
ru: Показывать только ошибки

source: Show No Indicators
fr: Ne pas afficher d'Indicateurs
ru: Не Показывать Индикаторы

source: Controls whether Wing will show error and/or warning indicators on the editor as red and yellow underlines. When shown, hovering the mouse over the indicator shows the error or warning detail in a tooltip.
fr: Contrôle si Wing affichera des erreurs et/ou des indicateurs d'avertissement dans l'éditeur avec des sous-lignages rouges et jaunes. Lorsqu'affiché, passer la souris au-dessus de l'indicateur affiche le détail de l'erreur ou de l'avertissement dans une bulle d'aide.
ru: Управляет тем, будет ли Wing показывать индикаторы ошибок и/или предупреждений в редакторе в виде красного и желтого подчеркивания. Когда указали, при наведении указателя мыши на индикатор отображается информация об ошибке или предупреждении в всплывающей подсказке.

source: Set to true to show whitespace with visible characters by default
de: Auf wahr setzen, um Leeraum mit sichtbaren Zeichen standardmäßig anzuzeigen
fr: Affecter à vrai pour afficher les espaces avec des caractères visibles par défaut
ru: Установите значение true, чтобы показывать пробелы с видимыми символами по умолчанию

source: Set to true to show indent guides by default
de: Auf wahr setzen, um die Einrückungslinien standardmäßig anzuzeigen
fr: Affecter à vrai pour afficher les guides d'indentation par défaut
ru: Установите значение true, чтобы отображать линии отступов по умолчанию

source: Set to true to show end-of-line with visible characters by default
de: Auf wahr setzen, um das Zeilenende mit sichtbaren Zeichen standardmäßig anzuzeigen
fr: Affecter à vrai pour afficher les fins-de-lignes avec des caractères visibles par défaut
ru: Установите значение true для отображения конца строки с видимыми символами по умолчанию

source: On new blank lines
de: Auf neuen leeren Zeilen
fr: Sur les nouvelles lignes vierges
ru: На новых пустых строках

source: Controls when Wing automatically indents when return or enter is typed.
de: Kontrolliert, wann Wing automatisch einrückt, wenn die Return- oder Eingabetaste gedrückt wird.
fr: Contrôle quand Wing indente automatiquement lorsque retour ou entrée est tapé.
ru: Управление автоматическим вводом отступов Wing при возврате или вводе.

source: Controls whether Wing automatically converts indent style and size on text that is pasted into an editor.
fr: Contrôle que Wing convertisse automatiquement les taille et style d’indents sur le texte qui est collé dans l’éditeur.
ru: Определяет, будет ли Wing автоматически преобразовывать стиль отступа и размер текста, вставленного в редактор.

source: Controls whether Wing automatically adjusts indents after multi-line text is pasted. When enabled, a single undo will remove any alterations in indentation.
fr: Contrôle que Wing ajuste automatiquement les indents après qu'un texte multi-lignes soit collé. Si activé, un simple annuler enlèvera toute altération dans l'indentation.
ru: Определяет, будет ли Wing автоматически регулировать отступы после вставки многострочного текста. Если этот параметр включен, одна отмена удалит все изменения отступов.

source: Disabled
de: Deaktiviert
fr: Désactivé
ru: Отключено

source: Set the footer format to use for printing. The values allowed are the same as those for print-header-format.
fr: Fixer le format du pied de page à utiliser pour l'impression. Les valeurs autorisées sont les mêmes que celles pour le format d'impression de l'entête.
ru: Задайте Формат нижнего колонтитула для печати. Допустимые значения совпадают с значениями для формата заголовка печати.

source: Page %page%, last modified %file-date% %file-time%
de: Seite %page%, zuletzt geändert %file-date% %file-time%
fr: Page %page%, dernière modification %file-date% %file-time%
ru: Страница %page%, дата последнего изменения %file-date% %file-time%

source: Font to use in print header.
de: Schriftart der gedruckten Kopfzeile.
fr: Police à utiliser pour l'entête d'impression.
ru: Шрифт в заголовке печати.

source: Use Selected Font/Size:
de: Ausgewählte Schriftart/-größe verwenden:
fr: Utiliser la police/taille sélectionnée :
ru: Использовать Выбранный Шрифт/Размер:

source: Font to use in print footer.
de: Schriftart der gedruckten Fußzeile.
fr: Police à utiliser pour le pied de page d'impression.
ru: Шрифт для печати в Нижнем колонтитуле.

source: Font to use when printing.
de: Schriftart für Ausdrucke.
fr: Police à utiliser pour l’impression.
ru: Шрифт для печати.

source: Number of seconds between last key press and when analysis is re-enabled if analysis is to be suspended while typing occurs. If <= 0, analysis is not suspended.
de: Anzahl der Sekunden zwischen dem letzten Tastendruck und dem Zeitpunkt, an dem die Analyse wieder aktiviert wird, falls die Analyse während des Tippens unterbrochen werden soll. Wenn <= 0 wird die Analyse nicht unterbrochen.
fr: Nombre de secondes entre la dernière touche appuyée et la réactivation de l'analyse si l'analyse doit être suspendue lors de la frappe. Si <= 0, l'analyse n'est pas suspendue.
ru: Количество секунд между последним нажатием клавиши и при повторном включении анализа, если анализ должен быть приостановлен во время ввода происходит. If <= 0, анализ не приостанавливается.

source: Controls whether or not the completer is always shown automatically during typing, never auto-shown, or shown only after a certain number of characters are in the completion fragment. When auto-show is disabled, the auto-completer can still be shown on demand with the Show Completer item in the Source menu.
fr: Contrôle si le compléteur est affiché automatiquement durant l'écriture, jamais affiché automatiquement ou affiché seulement après un certain nombre de caractères qui sont dans des fragments de complétion. Quand l'affichage automatique est désactivé, on peut toujours afficher l'auto-compléteur grâce à l'élément Afficher le compléteur du menu Source.
ru: Контролирует, будет ли всегда отображаться полный набор во время набора текста, не будет отображаться автоматически или будет отображаться только после ввода определенного количества символов в фрагменте завершения. Если функция автоматического показа отключена, функция автоматического завершения по-прежнему может отображаться по требованию с помощью пункта Показать полное в меню Источника.

source: After characters:
de: Nach Zeichen:
fr: Après les caractères :
ru: После символов:

source: Delay in seconds from last key press to wait before the auto-completer is shown. If 0.0, the auto-completer is shown immediately.
de: Abschaltung in Sekunden vom letzten Tastendruck, nach welchem der Auto-Vervollständiger automatisch aufgeschlagen wird. Wenn 0.0, wird der Auto-Vervollständiger gleich aufgeschlagen.
fr: Délai en secondes entre l'appui de la dernière touche et l'affichage de l'auto-compléteur. Si c'est 0.0, l'auto-compléteur est affiché immédiatement.
ru: Задержка ожидания перед показом автокомплексора в секундах от последнего нажатия клавиши. Если 0.0, автокомплексор отображается немедленно.

source: Timeout in seconds from last key press after which the auto-completer is automatically hidden. If 0.0, the auto-completer does not time out.
de: Abschaltung in Sekunden vom letzten Tastendruck, nach welchem der Auto-Vervollständiger automatisch ausgeblendet wird. Wenn 0.0, wird der Auto-Vervollständiger nicht abgeschalten.
fr: Délai d'attente en secondes entre l'appui de la dernière touche et le masquage automatique de l'auto-compléteur. Si c'est 0.0, l'auto-compléteur n'est jamais masqué.
ru: Тайм-аут в секундах считая от последнего нажатия клавиши, после которого автозаполнение автоматически скрывается. Если 0.0, автокомплексор не отключается.

source: Enter
de: Eingabetaste
fr: Entrée
ru: Ввод

source: Space
de: Leerzeichen
fr: Espace
ru: Пробел

source: Period
de: Punkt
fr: Point
ru: Период

source: Left paren
de: Linke Klammer
fr: Parenthèse gauche
ru: Левая скобка

source: Left bracket
de: Linke eckige Klammer
fr: Crochet gauche
ru: Левая угловая скобка

source: Colon
de: Doppelpunkt
fr: Deux points
ru: Двоеточие

source: Controls which keys will enter selected completion value into the editor.
fr: Contrôle quelles touches entreront la complétion sélectionnée dans l'éditeur.
ru: Определяет, какие клавиши будут вводить завершение, выбранное в редакторе.

source: Insert at Cursor
de: Am Cursor Einfügen
fr: Insérer après le curseur
ru: Вставить после курсора

source: Replace Only Matching Symbols
de: Nur übereinstimmende Symbole ersetzen
fr: Remplace uniquement les symboles correspondants
ru: Заменить только совпадающие символы

source: Replace Any Existing Symbol
de: Alle existierende Symbole ersetzen
fr: Remplace n'Importe Quel symbole existant
ru: Заменить Любой Существующий Символ

source: Selects how completion is done in the editor: Either insert the completion at the cursor, replace any symbols that heuristically match the selected completion (and insert in other cases), or replace any existing symbol with the new symbol.
fr: Sélectionne comment la complétion est effectuée dans l'éditeur. Soit insérer la complétion au curseur, remplacer tout symbole qui correspond à la complétion sélectionnée (et insérer dans d'autres cas), ou remplacer tout symbole existant avec le nouveau symbole.
ru: Выбор способа выполнения автозаполнения в редакторе: Вставляет его в позицию курсора, заменяет все символы, которые эвристически соответствуют выбранному заполнению (и в других случаях), либо меняет любой существующий символ новым символом

source: Controls whether matching in the completer is case sensitive or not. The correct case is always used when a completion is chosen.
fr: Contrôle si la correspondance dans le compléteur est sensible à la casse ou non. La casse correcte est toujours utilisée quand une complétion est choisie.
ru: Определяет, будут ли совпадения в заполнении чуствителены к регистру или нет. Правильный случай всегда используется при выборе завершения.

source: The maximum number of lines to show in the auto-completer at once.
fr: Nombre maximum de lignes à afficher dans l'auto-compléteur en une fois.
ru: Максимальное количество строк, отображаемых в автокомплексе одновременно.

source: Disable
de: Deaktivieren
fr: Désactivé
ru: Отключить

source: Enable
de: Aktivieren
fr: Activé
ru: Включить

source: Controls whether or not use the completer in non-Python files, where it uses a simple word list generated from the existing contents of the file. If enabled, the number of characters required before the completer is shown may be specified here.This value overrides any character threshold set above.
fr: Contrôle l'utilisation du compléteur dans des fichiers non-Python, où il utilise une liste de mots simples générés depuis les contenus existants du fichier. Si activé, le nombre de caractères nécessaires avant l'affichage du compléteur peut être spécifié ici. Cette valeur écrase tout seuil de caractère affecté au-dessus.
ru: Контролирует, использовать или не использовать дополнение в файлах, отличных от Python, где он использует простой список слов, сгенерированный из существующего содержимого файла. Если этот параметр включен, то здесь может быть указано количество символов, требуемое перед отображением дополнения. Это значение переопределяет любой порог символов, указанный выше.

source: Sets the minimum size of words to add to the completion list for non-Python files. This affects only words found in the file, and not words included because they are keywords for that file type.
fr: Affecte la taille minimum de mots à ajouter à la liste de complétion pour les fichiers non-Python. Cela affecte seulement les mots trouvés dans le fichier, et pas les mots inclus car ils sont des mots clés pour ce type de fichier.
ru: Устанавливает минимальный размер слов для добавления в список завершения для файлов, отличных от Python. Влияет только на слова, найденные в файле, и не влияет на слова, включенные, потому что они ключевые для этого типа файла.

source: Column at which text should be wrapped by commands that automatically rearrange text
de: Spalte, an der Text durch Befehle, die den Text automatisch neu anordnen, umgebrochen werden sollte
fr: Colonne à laquelle le texte sera passé à la ligne par des commandes qui réarrangent le texte automatiquement
ru: Столбец, в котором текст должен быть обернут командами, которые автоматически переупорядочивают текст

source: Shows or hides line numbers on the editor.
de: Zeigt oder versteckt Zeilennummern im Editor.
fr: Afficher ou masquer les numéros de ligne dans l'éditeur.
ru: Показывает или скрывает номера строк в редакторе.

source: Whether to enable folding source code.
fr: Activer le repliement structurel du code source.
ru: Следует ли включить свернутый исходный код.

source: Selects the mime types for which folding should be allowed when folding in general is enabled.
fr: Sélectionne les types mime pour lequels le repliement devrait être autorisé lorsque le repliement en général est activé.
ru: Выбор типов mime, для которых разрешено складывание, если включено складывание вообще.

source: Above Expanded
de: Oben Erweitert
fr: Développer au-dessus
ru: Ранее Раскрытый

source: Below Expanded
de: Unten Erweitert
fr: Développer en-dessous
ru: Далее Раскрытый

source: Above Collapsed
de: Oben Zusammengeklappt
fr: Réduire au-dessus
ru: Ранее Свернутый

source: Below Collapsed
de: Unten Zusammengeklappt
fr: Réduire en-dessous
ru: Далее Свернутый

source: None
de: Keine
fr: Aucun

source: Selects the type of indicators to draw at fold points.
fr: Sélectionne le type d'indicateurs à dessiner aux points de repliement.
ru: Выбор типа индикаторов для отображения в точках сгиба.

source: Arrows
de: Pfeile
fr: Flèches
ru: Стрелки

source: Plus/Minus
fr: Plus/Moins
ru: Плюс/минус

source: Rounded Tree
de: Gerundeter Baum
fr: Arborescent Rond
ru: Скруглённое дерево

source: Square Tree
de: Quadratischer Baum
fr: Arborescent Carré
ru: Квадратное Дерево

source: Controls whether or not trailing white space after a block of code is folded up along with the block, for a more compact folded display.
fr: Contrôle si les espaces blancs de fin de chaîne qui sont à la fin d'un bloc de code sont repliés en même temps en même temps que celui-ci, ou non, pour un affichage du code replié plus compact.
ru: Для более компактного отображения можно указать, будет ли блок кода складываться вместе с блоком в конце или нет.

source: Color to use for the foreground of the fold indicators.
fr: Couleur à utiliser pour l’avant-plan des indicateurs de repliement.
ru: Цвет для использования на переднем плане индикаторов сгиба.

source: Color to use for the background of the fold indicators.
fr: Couleur à utiliser pour l’arrière-plan des indicateurs de repliement.
ru: Цвет использовать для фона индикаторов сгиба.

source: Color to use to indicate code errors in the editor.
de: Farbe die benutzt wird, um Code-Fehler im Editor anzuzeigen.
fr: Couleur à utiliser pour indiquer des erreurs de code dans l’éditeur.

source: Color to use to indicate code warnings in the editor.
de: Farbe die benutzt wird, um Code-Warnungen im Editor anzuzeigen.
fr: Couleur à utiliser pour indiquer des avertissements de code dans l’éditeur.

source: Outdent Region
de: Ausrückungsbereich
fr: Désindenter la région
ru: Отступ Области

source: Indent To Match
de: Einrücken zum Anpassen
fr: Ajuster l'indentation
ru: Отступ в соответствии

source: Comment out Region
de: Bereich auskommentieren
fr: Commenter la région
ru: Комментировать регион

source: Uncomment out Region
de: Kommentar im Bereich aufheben
fr: Décommenter la région
ru: Раскомментировать Регион

source: Always Select
de: Immer auswählen
fr: Toujours sélectionner
ru: Всегда выбирать

source: Retain Select
de: Auswählen beibehalten
fr: Garder la sélection
ru: Сохранить Выбор

source: Never Select
de: Niemals auswählen
fr: Ne jamais sélectionner
ru: Никогда Не Выбирать

source: This controls whether to retain selection in the editor after certain operations. The editor may always select the text that was operated on, only retain existing selections, or never select after the operation completes.
fr: Cela contrôle comment retenir la sélection dans l’éditeur après certaines opérations. L’éditeur peut toujours sélectionner le texte qui a été travaillé, seulement retenir les sélections existantes, ou ne jamais sélectionner après que l’opération ait été complétée.
ru: Этот параметр определяет, следует ли сохранять выделение в редакторе после выполнения определенных операций. Редактор может всегда выбирать текст, на котором он работал, только сохранять существующие выборки или никогда не выбирать после завершения операции.

source: Editor Action
de: Editor-Aktion
fr: Action de l'éditeur
ru: Действие Редактора

source: Policy
de: Richtlinie
fr: Politique
ru: Правила

source: Enabled to automatically highlight the matching braces next to the cursor or as they are typed.
fr: Activer pour automatiquement mettre en évidence les accolades liées entre elles à côté du curseur où elles sont tapées.
ru: Включить, чтобы автоматически выделять соответствующие фигурные скобки рядом с курсором или как они набраны.

source: Enable or disable Wing's auto-editing capability. When enabled, a default set of individual auto-editing operations (such as auto-closing quotes and parenthesis and auto-entering invocation arguments) will be activated. The individual operations can then be enabled or disabled independently in preferences.
fr: Active ou désactive la capacité d'auto-édition de Wing. Si activé, un jeu individuel par défaut d'opérations d'auto-édition (comme l'auto-fermeture des guillemets et parenthèses et l'auto-entrée d'arguments d'invocation) sera actif. Les opérations individuelles peuvent être alors activées ou désactivées indépendamment dans les préférences.
ru: Включение или отключение функции автоматического редактирования Wing. Если этот параметр включен, активируется набор отдельных операций автоматического редактирования по умолчанию (например, кавычки и скобки автоматического закрытия и аргументы автоматического ввода вызова). Затем отдельные операции можно включить или отключить в отдельных настройках.

source: Enable to auto-close quotes, parenthesis, braces, comments, and so forth.
fr: Activer l'auto-fermeture des guillemets, parenthèses, accolades, commentaires, et ainsi de suite.
ru: Включить автоматическое закрытие кавычек, скобок, скобок, комментариев и т. д.

source: Enable auto-entry of invocation arguments for a function or method call.
fr: Activer l’auto-entrée des arguments d’invocation pour une fonction ou un appel de méthode.
ru: Включение автоматического ввода аргументов вызова для вызова функции или метода.

source: Enable placing quotes around a non-empty selection.
fr: Active le placement de guillemets autour d'une sélection non-vide.
ru: Включить размещение кавычек вокруг непустой выборки.

source: Enable commenting out a non-empty selection when a comment character is pressed.
fr: Commente une sélection non-vide quand un caractère de commentaire est pressé.
ru: Включение комментирования непустого выделения при нажатии символа комментария.

source: Enable surrounding non-empty selection when a parenthesis is pressed.
fr: Activer l'entourage d'une sélection non-vide quand une parenthèse est pressée.
ru: Включите обрамление непустого выбора при нажатии скобки.

source: Enable creating a new block with a selected range of lines when colon is pressed.
fr: Activer la création d’un nouveau bloc avec un nombre de ligne sélectionnées quand deux-points sont pressés.
ru: Включить создание нового блока с выбранным диапазоном строк при нажатии двоеточия.

source: Enable auto-entering spaces around operators and punctuation.
fr: Active l'auto-entrée d'espaces autour des opérateurs et de la ponctuation.
ru: Включить авто-ввод пробелов вокруг операторов и пунктуацию.

source: Enable auto-entering spaces after keywords.
fr: Active l'auto-entrée d'espaces après les mots clés.
ru: Включить автоматическое ввод пробелов после ключевых слов.
