Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_proj_commands.po
Languages: de

source: These commands act on the project manager or on the current project, regardless of whether the project list has the keyboard focus.
de: Diese Befehle sind für den Projektmanager oder das aktuelle Projekt, ungeachtet der Tatsache, ob die Tastatur für die Projektliste aktiviert ist.

source: Utility method to get location of active editor.
de: Gebrauchsmethode, um den Ort des aktiven Editors zu erhalten.

source: Finds a view to apply project commands to.
de: Sucht eine Ansicht auf die Projektbefehle angewendet werden können.

source: Raise the project manager window
de: Das Fenster des Projektmanagers aufschlagen

source: Open a project file from a remote host
de: Projektdatei von einem Remote-Host öffnen

source: Save current project to a remote host
de: Aktuelles Projekt auf einem Remote-Host speichern

source: Remote URL Required
de: Remote-URL benötigt

source: Shared Remote Host Configuration Required
de: Geteilte Remote-Host Konfiguration benötigt

source: The remote host configuration for the filename %s is not a shared configuration, so saving a project there is not allowed. Please use a shared remote host configuration instead.
de: Die Remote-Host Konfiguration für den Dateinamen %s ist keine geteilte Konfiguration, daher ist dort das Speichern eines Projekte nicht gestattet. Bitte benutzen Sie stattdessen eine geteilte Remote-Host Konfiguration.

source: Close currently open project file
de: Gegenwärtig geöffnete Projektdatei schließen

source: Save project file.
de: Projektdatei speichern.

source: Add an existing file to the project.
de: Eine bestehende Datei zum Projekt hinzufügen.

source: Add directory to project.
de: Verzeichnis zum Projekt hinzufügen.

source: Add the frontmost currently open file to project
de: Die vorderste der gegenwärtig geöffneten Dateien zum Projekt hinzufügen

source: Remove directory from project.
de: Verzeichnis aus Projekt entfernen.

source: Remove currently selected file or package from the project
de: Die gegenwärtig ausgewählte Datei oder das Paket vom Projekt entfernen.

source: View or change project-wide properties
de: Projektweite Eigenschaften ansehen oder ändern

source: View project properties for a particular file (current file if none is given)
de: Projekteigenschaften für eine bestimmte Datei (aktuelle Datei wenn keine angegeben)

source: Show the project manager's directory properties dialog
de: Den Verzeichnis-Eigenschaften-Dialog des Projektmanagers anzeigen

source: Open files currently selected in the project manager
de: Die gegenwärtig im Projektmanager ausgewählten Dateien öffnen

source: Open file currently selected in the project manager
de: Die gegenwärtig ausgewählte Datei im Projektmanager öffnen

source: Browse file currently selected in the project manager
de: Die gegenwärtig ausgewählte Datei im Projektmanager durchsuchen

source: Start debugging the file currently selected in the project manager
de: Debuggen der gegenwärtig ausgewählten Datei im Projektmanager starten

source: Execute the file currently selected in the project manager
de: Die gegenwärtig ausgewählte Datei im Projektmanager ausführen

source: View project as directory tree from project file
de: Projekt als Verzeichnisbaum von der Projektdatei anzeigen

source: View project as flattened directory tree from project file
de: Projekt als abgeflachten Verzeichnisbaum von der Projektdatei anzeigen

source: Commands that are available only when the project view has the keyboard focus.
de: Befehle, die nur zur Verfügung stehen, wenn die Tastatur für die Projektansicht aktiviert ist.

source: Rename the currently selected file or directory in the project view
de: Die in der Projektansicht ausgewählte Datei oder das Verzeichnis umbenennen

source: New name for the directory
de: Neuer Name für das Verzeichnis

source: New Directory Name
de: Neuer Verzeichnisname

source: New name for the file
de: Neuer Name für die Datei

source: New File Name
de: Neuer Dateiname

source: Search in file or directory currently selected in the project manager
de: In der aktuell im Projektmanager ausgewählten Datei oder dem Verzeichnis suchen
