Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_debug_client.po
Languages: ru

source: Could not determine OS type (err={})
ru: Не удалось определить тип ОС (err={})

source: Detecting OS type
ru: Определение типа ОС

source: Failed to transfer remote agent; could not determine cygpath (err={})
ru: Не удалось передать удаленного агента; не могу определить cygpath (err={})

source: Failed to transfer remote agent (err={})
ru: Не удалось передать удаленного агент (err={})

source: Failed to start command line: %s
ru: Не удалось запустить командную строку: %s

source: There are unsaved files open on this remote host. Please save or close them before editing the remote host configuration.
ru: На этом удаленном узле открыты несохраненные файлы. Сохраните или закройте их перед редактированием конфигурации удаленного узла.

source: Cannot Edit Remote Host
ru: Не удается изменить удаленный хост

source: This remote host configuration is being used to access the currently open project. To edit it, please close the project first.
ru: Эта конфигурация удаленного хоста используется для доступа к текущему открытому проекту. Чтобы изменить его, сначала закройте проект.

source: Remote Host Is Being Used
ru: Используется Удаленный Хост

source: This remote host is in use and editing its configuration will affect the following:
ru: Этот удаленный хост используется, и изменение его конфигурации повлияет на следующее:

source: Cannot Remove Remote Host
ru: Не удается удалить удаленный хост

source: This remote host configuration cannot be removed since it is used as follows:
ru: Эта конфигурация удаленного узла не может быть удалена, так как она используется следующим образом:

source: You must close files and/or reconfigure your project to avoid using this remote host before you can remove it.
ru: Перед удалением необходимо закрыть файлы и/или перенастроить проект, чтобы избежать использования этого удаленного узла.

source: Confirm Remote Host Deletion
ru: Подтвердить удаление удаленного хоста

source: Are you sure you want to delete remote host configuration '%s'?
ru: Вы действительно хотите удалить конфигурацию удаленного хоста '%s'?

source: The currently open project is stored on this remote host
ru: Текущий открытый проект хранится на этом удаленном хосте

source: The project's Python Executable is on this remote host
ru: Исполняемый файл Python проекта находится на этом удаленном узле

source: Files and directories in the project are on this remote host
ru: Файлы и каталоги в проекте находятся на этом удаленном хосте

source: Files on the remote host are open in the editor
ru: Файлы на удаленном хосте открываются в редакторе

source: Probing %s
ru: Зондирование %s

source: Missing Remote Host Configuration
ru: Отсутствует Конфигурация Удаленного Узла

source: There is no remote host configuration for host %s. Do you want to create one?
ru: Конфигурация удаленного хоста для узла % s отсутствует. Вы хотите создать его?

source: Remote Agent Failed to Start
ru: Не удалось запустить удаленный Агент

source: Remote Agent Failed to Install
ru: Удаленный агент не удалось установить

source: The remote agent could not be installed on host id %s.
ru: Удаленный агент не может быть установлен на хосте с кодом %s.

source: The stored host identity does not match.
ru: Сохраненный идентификатор хоста не совпадает.

source: The remote agent was not found. Do you want to install it now?
ru: Удаленный агент не найден. Вы хотите установить его сейчас?

source: Output received:
ru: Полученный результат:

source: No output was received.
ru: Нет вывода.

source: Open Local _File...
ru: Открыть локальный файл...

source: Open _Remote File...
ru: Открыть удаленный файл...

source: Sa_ve As Remote File...
ru: Сохранить как удаленный файл...

source: Open _Remote Project...
ru: Открытый удаленный проект...

source: Sa_ve Project On Remote Host...
ru: Сохранить проект на удаленном хосте...

source: Remote Host is Ready
ru: Удаленный хост готов

source: Wing's remote agent for remote host identifier %s is up to date and working.
ru: Удаленный агент Wing для идентификатора удаленного хоста %s является актуальным и работает.

source: Host Name:
ru: Имя хоста:

source: Version:
ru: Версия:

source: File System Encoding:
ru: Кодировка файловой системы:

source: Remote Agent Process ID:
ru: Process ID удаленного агента:

source: Installation Directory:
ru: Каталог установки:

source: Home Directory:
ru: Домашний каталог:

source: Base Directory:
ru: Базовый каталог:

source: Initializing...
ru: Инициализация ...

source: Connected but not ready
ru: Подключено, но не готово

source: Create a new remote host
ru: Создать новый удаленный хост

source: Duplicate the selected remote host
ru: Дублировать выбранный удаленный хост

source: Edit the selected remote host
ru: Изменение выбранного удаленного узла

source: Delete the selected remote host
ru: Удалить выбранный удаленный хост

source: Probe the selected remote host
ru: Проверить выбранный удаленный хост

source: Probe
ru: Проба

source: Clear
ru: Очистить

source: Hostname
ru: Имя хоста

source: Base Directory
ru: Базовый каталог

source: Manage Remote Hosts
ru: Управление удаленными хостами

source: Overwrite Existing Remote Host?
ru: Перезаписать существующий удаленный хост?

source: Another configuration for that remote host already exists. Are you sure you want to overwrite the existing remote host configuration '%s'?
ru: Другая конфигурация для этого удаленного узла уже существует. Вы уверены, что хотите перезаписать существующую конфигурацию удаленного узла "%s"?

source: Remote Host: %s
ru: Удаленный хост: %s

source: Recent Hosts
ru: Последние Хосты

source: Use Remote Host's Default
ru: Использовать удаленный хост по умолчанию

source: The unique ID for this remote host configuration. This is used in all references to resources on the remote host.
ru: Уникальный идентификатор для этой конфигурации удаленного узла. Используется во всех ссылках на ресурсы удаленного узла.

source: Host Name
ru: Имя хоста

source: The remote host's DNS name or IP address. This may include the user name in the form user@hostname or user@ipaddress.
ru: DNS-имя или IP-адрес удаленного хоста. Включает имя пользователя в форме user@hostname или user@ipaddress.

source: Forward X11
ru: Переадресация X11

source: Use specified port:
ru: Использовать указанный порт:

source: Remote Agent Port
ru: Порт удаленного агента

source: Use Random Port
ru: Использовать Случайный Порт

source: Remote Debug Ports
ru: Удаленные Порты Отладки

source: Use Random Ports
ru: Использовать Случайные Порты

source: Start with this port:
ru: Начните с этого порта:

source: File Encoding
ru: Кодировка Файлов

source: The default encoding to use for files on the remote host.
ru: Кодировка по умолчанию для файлов на удаленном узле.

source: I/O Encoding
ru: I/O кодировка

source: The encoding to use for I/O when debugging or executing code on the remote host.
ru: Кодировка, используемая для ввода-вывода при отладке или выполнении кода на удаленном узле.

source: Show I/O Encoding Preference
ru: Показать Предпочтения I/O Encoding

source: Identifier 'localhost' is a reserved name
ru: Идентификатор 'localhost' - это зарезервированное имя

source: You must specify the remote host name or IP address.
ru: Необходимо указать имя удаленного узла или IP-адрес.

source: Cannot evaluate: no debug program
ru: Не удается определить: нет программы отладки

source: Cannot evaluate: debug program is running
ru: Не удается определить: запущена программа отладки

source: Right-click for option menu
ru: Правый клик для меню опций

source: Cannot evaluate: debugger not ready
ru: Не удается определить: отладчик не готов

source: Cannot evaluate: unknown or invalid debug mode
ru: Не удается определить: неизвестный или недопустимый режим отладки

source: Watch
ru: Окно наблюдения

source: Watch Debug Data Values and Expressions
ru: Просмотр отладочных значений данных и выражений

source: No reference value selected
ru: Не выбрано контрольное значение

source: No value found
ru: Значение не найдено

source: No reference to track
ru: Нет ссылки на трек

source: No parent reference to track
ru: Нет родительской ссылки на трек

source: No parent found
ru: Родители не найдены

source: No parent value found
ru: Родительское значение не найдено

source: No symbolic path found
ru: Символический путь не найден

source: Value not in module scope
ru: Значение вне области модуля

source: Invalid watch style
ru: Неверный стиль окна наблюдения

source: Value
ru: Значение

source: Variable
ru: Переменная

source: Watch tool tree state
ru: Просмотр состояния дерева инструментов

source: Watch tool state
ru: Просмотр состояния инструмента

source: Debug %s watch on %s
ru: Отладка %s наблюдение за %s

source: Debug %s watch on %s: %s
ru: Отладка %s наблюдение за %s: %s

source: Debug watch tree state
ru: Отладка Состояние дерева наблюдения

source: Add Expression
ru: Добавить Выражение

source: Clear Selected
ru: Очистить Выбранные

source: Clear All
ru: Очистить все

source: Use Tree View
ru: В Виде Дерева

source: Use Combo View
ru: Комбинированное Представление

source: Watching
ru: Наблюдение

source: Cannot edit sub-value name::Only top-level watch point names can be edited
ru: Не удается изменить имя суб-значения:: Можно редактировать только имена точек наблюдения верхнего уровня

source: Cannot edit watchpoint name::Only expressions can be edited
ru: Невозможно изменить имя точки наблюдения:: можно редактировать только выражения

source: Debug I/O
ru: I/O Отладки

source: Debug Process I/O
ru: I/O Процесса Отладки

source: Close current buffer
ru: Закрыть текущий буфер

source: No debug process
ru: Нет процесса отладки

source: Debug process terminated
ru: Процесс отладки завершен

source: Debug I/O appears in context where process was launched
ru: Ввод-Вывод Отладки показывает контекст запущенного процесса

source: See external console for debug I/O
ru: См. Раздел внешняя консоль для ввода-вывода отладки

source: Debug I/O (stdin, stdout, stderr) appears below
ru: Отладки ввода/вывода (стандартный ввод, стандартный вывод, стандартный вывод) появляется ниже

source: _Never Auto-Show
ru: Никогда Авто-Шоу

source: Al_ways Auto-Show on Output
ru: Всегда авто-шоу на выходе

source: Auto-Show on _First Output
ru: Авто-шоу при первом выходе

source: Retain _History
ru: Сохранить Историю

source: Show _Child Processes
ru: Показать Дочерние Процессы

source: Configure _External Console...
ru: Настройка Внешней Консоли...

source: Configure Enco_ding...
ru: Настройка Кодировки...

source: in file {}
ru: в файле {}

source: line {}
ru: строка {}

source: %s, prompt %i, line %s
ru: %s, prompt %i, строка %s

source: File<html>&nbsp;</html>
ru: Файл<html>&nbsp;</html>

source: %s, line %s, in <literal>%s</literal>
ru: %s, строка %s, в <literal>%s</literal>

source: Exceptions
ru: Исключения

source: Debug Process Exceptions
ru: Исключения Процесса Отладки

source: Move up the exception stack
ru: Перейти вверх по стеку исключений

source: Show innermost frame of the exception stack
ru: Показать внутренний фрейм стека исключений

source: Move down the exception stack
ru: Перейти вниз по стеку исключений

source: Frame Up
ru: Кадр вверх

source: Show Position
ru: Показать Позицию

source: Frame Down
ru: Кадр вниз

source: _Ignore this exception location
ru: Игнорировать это местоположение исключения

source: Wing reports exceptions that are likely to indicate a bug in code, including some that may be handled normally outside the debugger. Use this check box to ignore an exception you are not interested in. Ignored exceptions are still reported if they later lead to program termination. You can also use the Configure item in the Options menu to alter when Wing reports exceptions and to edit the lists of exceptions that are always reported or always ignored.
ru: Wing сообщает об исключениях, которые могут указывать на ошибку в коде, включая некоторые, которые могут обрабатываться обычно вне отладчика. Используйте этот флажок, чтобы игнорировать исключение, которое вас не интересует. Игнорируемые исключения по-прежнему сообщаются, если они позже приводят к завершению программы. Вы также можете использовать пункт «Настроить» в меню «Параметры», для изменений поведения Wing, когда сообщать об исключениях и редактировать списки исключений, которые всегда сообщаются или всегда игнорируются.

source: Copy the exception and traceback to the clipboard
ru: Скопируйте исключение и трассировку в буфер обмена

source: Copy _Traceback
ru: Копировать трассировку

source: Clear this exception display to blank and remove any remaining debugger run markers from source code.
ru: Очистите отображения этого исключения и удалите все оставшиеся маркеры запуска отладчика из исходного кода.

source: Truncate the exception message to at most 10 lines, each with at most 1024 characters.
ru: Усеките сообщение об исключении не более чем на 10 строк, каждая из которых содержит не более 1024 символов.

source: _Truncate Long Summaries
ru: Сократить длину итогов

source: Indicate files that are in the project in the Exception traceback
ru: Указать файлы проекта в трассировке исключений

source: Indicate _Project Files
ru: Указать Файлы Проекта

source: Clear the list of all previously ignored exceptions
ru: Очистить список всех ранее игнорировавшихся исключений

source: Clear _Ignored Exceptions
ru: Очистить Игнорируемые Исключения

source: Change between exception reporting modes and add/remove exceptions that are always reported or always ignored.
ru: Переключение между режимами отчетов об исключениях и добавлением / удалением исключений, о которых всегда сообщается или которые всегда игнорируются.

source: C_onfigure...
ru: Настроить...

source: Copy
ru: Копия

source: Could not find file for {}, line {}
ru: Не удалось найти файл для {}, строка {}

source: Could not start shell process
ru: Не удалось запустить процесс оболочки

source: Could not create process launcher
ru: Не удалось создать средство запуска процессов

source: Aborted remote inspect
ru: Прервать удаленный осмотр

source: (unavailable; shell was cleared)
ru: (недоступен; оболочка была очищена)

source: Python Shell
ru: Оболочка Python

source: Internal Wing Error -- please submit a bug report
ru: Внутренняя Ошибка Wing -- пожалуйста, отправьте отчет об ошибке

source: Restarting shell process...
ru: Перезапуск процесса оболочки...

source: Cannot execute: program is exiting
ru: Не удается выполнить: программа завершает работу

source: Executing command. Please wait for result
ru: Выполнение команды. Пожалуйста, дождитесь результата

source: Commands will be debugged. Use arrow keys for history.
ru: Команды в отладке. Используйте клавиши со стрелками для истории.

source: Commands execute without debug. Use arrow keys for history.
ru: Команды выполняются без отладки. Используйте клавиши со стрелками для истории.

source: Needs restart for Python env
ru: Требуется перезагрузка для Python env

source: <fragment>
ru: <фрагмент>

source: File "%s", line %s, in %s
ru: Файл "%s", строка %s, из %s

source: cleared
ru: очищен

source: unavailable
ru: недоступен

source: %s, prompt %i, line %s
ru: %s, prompt %i, строка %s

source: Stale Python Shell Environment
ru: Устаревшая Среда Оболочки Python

source: Warning: The configured Python environment has changed since the Python Shell was started. Do you want to restart it now?
ru: Предупреждение: Настройки среды Python изменилась с момента запуска оболочки Python. Вы хотите перезапустить его сейчас?

source: _Restart
ru: Перезапуск

source: aborted (disconnected)
ru: прервано (отключено)

source: Interactive Python Shell
ru: Интерактивная оболочка Python

source: Set active range of code in the editor
ru: Установить активный диапазон кода в редакторе

source: Clear active range
ru: Очистить активный диапазон

source: Click to enable debugging Python Shell commands
ru: Нажмите, чтобы включить отладку команд оболочки Python

source: Click to disable debugging Python Shell commands
ru: Нажмите, чтобы отключить отладку команд оболочки Python

source: Show the active range in the editor
ru: Показывать активный диапазон в редакторе

source: Debug the active range
ru: Отладка активного диапазона

source: Execute the active range
ru: Выполнение активного диапазона

source: No Active Editor::Could not set an active range because there is no current editor with a Python file.
ru: Нет активного редактора::Не удалось установить активный диапазон, потому что нет текущего редактора с файлом Python.

source: Copy _With Prompts
ru: Копировать с Promts (>>>)

source: _Goto Definition
ru: Перейти к определению

source: Move Cursor Up (Ctrl-Up)
ru: Переместить курсор вверх (Ctrl-Up)

source: Move Cursor Down (Ctrl-Down)
ru: Переместить курсор вниз (Ctrl-Down)

source: Insert Line Break (Ctrl-Return)
ru: Вставить разрыв строки (Ctrl-Return)

source: Error: could not create process launcher
ru: Ошибка: не удалось запустить процесс

source: Error: cannot evaluate local file %s on remote host %s
ru: Ошибка: не удается проанализировать локальный файл %s на удаленном узле %s

source: Error: cannot evaluate remote file %s on host %s (host mismatch)
ru: Ошибка: не удается проанализировать удаленный файл %s на узле %s (несоответствие узла)

source: Error: cannot evaluate remote file %s on localhost
ru: Ошибка: не удается проанализировать удаленный файл %s на localhost

source: [Failed to inspect remote file; could not evaluate]
ru: [Не удалось проверить удаленный файл; не удалось проанализировать]

source: evaluate %s
ru: анализируем %s

source: evaluate lines %i-%i from %s
ru: оценка строк %i-%i из %s

source: evaluate selection on lines %i-%i from %s
ru: оценка выборки по строкам %i-%i из%s

source: Set Current Directory from Active Editor
ru: Установка текущего каталога из активного редактора

source: Pr_ompt to Confirm Restart
ru: Запрос подтверждения перезагрузки

source: Show Python Shell Doc_umentation
ru: Показать документацию Python Shell

source: Manage Launch Configurations...
ru: Управление конфигурациями запуска ...

source: Disabling debug listen (too many connections)
ru: Отключение отладки Listen (слишком много подключений)

source: Not listening (too many connections)
ru: Нет прослушивания (слишком много подключений)

source: Not listening
ru: Нет прослушивания

source: Allowed hosts:
ru: Разрешенные хосты:

source: Listening for connections
ru: Прослушивание соединений

source: Listen failed
ru: Не удалось прослушать

source: Could not watch value::%s
ru: Не удалось просмотреть значение ::%s

source: Ignored Exceptions Cleared
ru: Игнорируемые исключения удалены

source: Previously ignored exceptions have been cleared: %i exception(s) were removed.
ru: Ранее игнорируемые исключения были очищены: %i исключение(й) были удалены.

source: Unknown process (terminated)
ru: Неизвестный процесс (завершен)

source: Kill Also Associated Processes?
ru: Завершить также связанные процессы?

source: Select the process group members to kill
ru: Выберите группу процессов для завершения

source: _Leave Other Processes Running
ru: _Оставить другие процессы выполняемыми

source: Kill _Selected Processes Only
ru: Завершить _Выбранные процессы

source: Kill Entire Process _Group
ru: Завершить все процессы _Группы

source: _Always Do This Without Prompting
ru: _Всегда делать это без Подсказок

source: Invalid debug.location-map preferences key: %s
ru: Недопустимый ключ предпочтений debug.location-map: %s

source: Skipping invalid debug.location-map preference value: %s
ru: Пропуск недопустимого значения предпочтения debug.location-map: %s

source: Found under host name %s
ru: Найдено под именем хоста %s

source: Tuple items must be strings
ru: Элементы кортежа должны быть строками

source: Skipping invalid debug.location-map preference entry: %s
ru: Пропуск недопустимой записи предпочтения debug.location-map: %s

source: Should be a tuple of (remote, local) tuples
ru: Должен быть кортеж (удаленных, локальных) кортежей

source: Unable to create support file for debugger. Please check to see if your Wing settings directory exists
ru: Не удалось создать файл поддержки для отладчика. Проверьте, существует ли ваш каталог настроек Wing

source: Unable to create %s because the disk is read-only or a directory called %s could not be created. You will not be able to use the debugger.
ru: Не удалось создать %s, потому что диск доступен только для чтения или каталог с именем %s не может быть создан. Вы не сможете использовать отладчик.

source: Controls whether or not the debugger listens for connections from an externally launched program. This should be enabled when the debug program is not launched by the IDE.
ru: Контролирует, прослушивает ли отладчик соединения из программы, запускаемой извне. Это должно быть включено, если программа отладки не запускается в среде IDE.

source: Remote IP Address
ru: Удаленный IP-адрес

source: Same as localhost
ru: То же, что и localhost

source: Specify mapping
ru: Укажите сопоставление

source: Controls how Wing reports exceptions that are raised by your debug process. By default, Wing shows exceptions at the time that the exception traceback would normally be printed. Alternatively, Wing can try to predict which exceptions are unhandled, and stop immediately when unhandled exceptions are raised so that any finally clauses can be stepped through in the debugger. Wing can also stop on all exceptions (even if handled) immediately when they are raised, or it can wait to report fatal exceptions as the debug process terminates. In the latter case Wing makes a best effort to stop before the debug process exits or at least to report the exception post-mortem, but one or both may fail if working with externally launched debug processes. In that case, we recommend using When Printed exception reporting mode.
ru: Контролирует, как Wing сообщает об исключениях, которые возникают в процессе отладки. По умолчанию Wing показывает исключения в то время, когда трассировка исключения обычно печатается. В качестве альтернативы, Wing может попытаться предсказать, какие исключения необработаны, и немедленно прекратить работу, когда необработанные исключения будут подняты так, что любые окончательные предложения могут быть пройдены в отладчике. Wing также может останавливаться на всех исключениях (даже если обрабатывается) сразу же после их поднятия или может ожидать сообщения о фатальных исключениях, когда процесс отладки завершается. В последнем случае Wing прилагает все усилия, чтобы остановить процесс отладки или, по крайней мере, сообщить об исключении post-mortem, но один или оба могут потерпеть неудачу, если работают с внешними запущенными процессами отладки. В этом случае мы рекомендуем использовать режим «Отпечатанные исключения» (When Printed exception reporting mode).

source: When Printed (Default)
ru: При печати (по умолчанию)

source: At Process Termination
ru: При завершении процесса

source: Always Immediately
ru: Всегда сразу

source: Controls whether to stop on exceptions logged with logging.exception if the exception mode is set to 'When Printed'
ru: Определяет, следует ли останавливаться на исключениях, зарегистрированных в logging.exception, если для режима исключения задано значение "при печати"( 'When Printed')
