Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_command.po
Languages: de, fr, ru

source: Cannot execute %s: incorrect value for %s
de: %s kann nicht ausgeführt werden: Fehlerhafter Wert für %s
fr: Impossible d'exécuter %s : valeur incorrecte pour %s
ru: Невозможно выполнить %s: неверное значение для %s

source: %sarginfo[%s].doc not valid. Using None.
de: %sarginfo[%s].doc ungültig. None wird verwendet.
fr: %sarginfo[%s].doc n'est pas valide. None est utilisé.
ru: %sarginfo[%s].doc недействительно. Использовано None.

source: %sarginfo[%s].type not valid. Treating arg as small string.
de: %sarginfo[%s].type ungültig. Behandelt Argument als kleinen String.
fr: %sarginfo[%s].type n'est pas valide. Les arguments sont traités commes des chaînes courtes.
ru: %sarginfo[%s].type недействительно. Обработка arg как маленькая строка.

source: %sarginfo[%s].formlet not valid. Treating arg as small string.
de: %sarginfo[%s].formlet ungültig. Behandelt Argument als kleinen String.
fr: %sarginfo[%s].formlet n'est pas valide. Les arguments sont traités commes des chaînes courtes.
ru: %sarginfo[%s].formlet недействительно. Обработка arg как маленькая строка.

source: Callable %s.arginfo[%s].%s failed. Using default.
de: Ausführbares Objekt %s.arginfo[%s].%s gescheitert. Voreinstellung wird verwendet.
fr: L'appelable %s.arginfo[%s].%s a échoué. Utilisation de la configuration par défaut.
ru: Вызов %s.arginfo[%s].%s неудачный. Будет использовано значение по умолчанию.

source: Command name is not a string
de: Befehlsname ist kein String.
fr: Le nom de la commande n'est pas une chaîne
ru: Имя команды не является строкой

source: Command doc is not a None, string, or callable
de: Befehl doc ist kein None, String oder ausführbares Objekt (Callable)
fr: Le doc de la commande n'est ni None, ni une chaîne, ni appelable
ru: Документация Команды не является строкой или вызовом

source: Command label is not a string or callable
de: Befehlskennzeichen ist kein String oder ausführbares Objekt (Callable)
fr: Le label de la commande n'est ni une chaîne, ni appelable
ru: Метка команды не является строкой или вызовом

source: %sarginfo not dict or callable. Using short string args.
de: %sarginfo weder dict noch ausführbar. Short-String-Argumente werden verwendet.
fr: %arginfo n'est ni un dictionnaire, ni appelable. Utilisation des arguments en chaîne courte.
ru: %sarginfo не dict или вызов. Использование коротких строк args.

source: %sarginfo[%s]: %s not an arg name.
de: %sarginfo[%s]: %s kein Argumentname.
fr: %sarginfo[%s] : %s n'est pas un nom d'argument.
ru: %sarginfo[%s]: %s не имя arg.

source: %sarginfo[%s] not CArgInfo or callable
de: %sarginfo[%s] kein CArgInfo oder ausführbar
fr: %sarginfo[%s] n'est ni un CArgInfo, ni appelable
ru: %sarginfo[%s] не является CArgInfo или вызовом

source: %sarginfo[%s]: exception inspecting value
de: %sarginfo[%s]: Exception kontrollierender Wert
fr: %sarginfo[%s] : exception durant l'inspection de la valeur
ru: %sarginfo[%s]: исключение при проверке значения

source: %sarginfo for %s not found. Using short string.
de: %sarginfo für %s nicht gefunden. Short-String wird verwendet.
fr: %sarginfo pour %s non trouvé. Utilisation d'une chaîne courte.
ru: %sarginfo для %s не найдено. Используя короткую строку.

source: Error executing %s.available()
de: Fehler beim Ausführen von %s.available()
fr: Erreur à l'exécution de %s.available()
ru: Ошибка выполнения %s.available()

source: Tried to execute unavailable command %s
de: Es wurde versucht, einen nicht verfügbaren Befehl auszuführen %s
fr: Tentative d'exécution de la commande non disponible %s
ru: Попытка выполнить недоступную команду %s

source: Error obtaining args for script %s
de: Argumente nicht gefunden für Skript %s
fr: Erreur en obtenant les arguments pour le script %s
ru: Ошибка получения аргументов для скрипта %s

source: Error obtaining args for command %s
de: Argumentfehler beim Ausführen des Befehls %s
fr: Erreur en obtenant les arguments pour la commande %s
ru: Ошибка получения аргументов для команды %s

source: Error executing script %s
de: Fehler beim Ausführen von Skript %s
fr: Erreur durant l'exécution du script %s
ru: Ошибка при выполнении скрипта %s

source: Error executing command %s
de: Fehler beim Ausführen des Befehls %s
fr: Erreur durant l'exécution de la commande %s
ru: Ошибка выполнения команды %s

source: Callable %s.arginfo raised an exception
de: Ausführbares Objekt %s.arginfo hatt eine Exception aufgeschlagen
fr: L'appel %s.arginfo a levé une exception
ru: Вызываемый %s.arginfo вызвал исключение

source: Callable %s.arginfo returned invalid arginfo; treating args as short string
de: Ausführbares Objekt %s.arginfo hatt ungültige Info-Sequenz des Arguments gegeben; behandelt Argumente als Short-String
fr: L'appel %s.arginfo a retourné des arginfo invalides ; traitant des arguments commes des chaînes courtes
ru: Вызов % s.arginfo возвращает недопустимый arginfo; обработка аргументов как короткой строки

source: Default
de: Voreinstellung
fr: Défaut
ru: По умолчанию

source: %s: Callable default arginfo failed
de: %s: Ausführung der Voreinstellung arginfo fehlgeschlagen
fr: %s : L'appel à l'arginfo par défaut a échoué
ru: %s: Вызываемый по умолчанию arginfo не выполнен

source: Callable %s.arginfo[%s] failed; treating arg as short string
de: Ausführbares Objekt %s.arginfo[%s] fehlgeschlagen; behandele Argument als Short-String
fr: L'appel %s.arginfo[%s] a échoué ; traitement des arguments commes des chaînes courtes
ru: Вызов %s.arginfo [% s] не удался; обработка arg как короткая строка

source: Callable %s.label failed; using label derived from command name
de: Ausführbares Objekt %s.label fehlgeschlagen; vom Befehlsnamen abgeleitetes Kennzeichen wird verwendet.
fr: L'appel à %s.label a échoué ; utilisant un label dérivé du nom de commande
ru: Вызов %s.label ошибка; использование метки, производной от имени команды

source: Callable %s.label returned non-string; using label derived from command name
de: Ausführung von %s.label gab non-string zurück; vom Befehlsnamen abgeleitetes Kennzeichen wird verwendet.
fr: L'appel à %s.label a retourné autre chose qu'une chaîne ; utilisant un label dérivé du nom de commande
ru: Вызов %s.label вернул не-строку; использование метки, полученной из имени команды

source: Callable %s.doc failed; using ''
de: Ausführung von %s.doc gescheitert; '' wird verwendet
fr: L'appel à %s.doc a échoué ; utilisant ''
ru: Вызов %s.doc вернул ошибку; использование ''

source: Callable %s.doc returned non-string; using ''
de: Ausführung von %s.doc gab non-string zurück, '' wird verwendet
fr: L'appel à %s.doc a retourné autre chose qu'une chaîne ; utilisant ''
ru: Вызов %s.doc вернул не строку; использование ''

source: Callable %s.flags returned non-dict; using {}
de: Ausführung von %s.flags gab non-dict zurück, {} wird verwendet
fr: L'appel au drapeaux %s n'a pas retourné un dictionnaire; utilisation de {}.
ru: Вызов %s.flags вернул non-dict; использование {}

source: * Error(s) loading %s.%s.%s:
de: * Fehler beim Laden %s.%s.%s:
fr: * Erreur(s) en chargeant %s.%s.%s :
ru: * Ошибка(и) загрузки %s.%s.%s:

source: Exception while loading %s.%s.%s
de: Exception beim Laden %s.%s.%s
fr: Déclenchement d'une exception durant le chargement de %s.%s.%s
ru: Исключение при загрузке %s.%s.%s
