Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_search_commands.po
Languages: de, fr, ru

source: Globally available commands defined for the search manager. These commands are available regardless of whether a search manager is visible or has keyboard focus.
de: Global verfügbare Befehle, die für den Suchmanager definiert sind. Diese Befehle stehen zur Verfügung, selbst wenn der Suchmanager nicht sichtbar ist oder die Tastatur für ihn nicht aktiviert ist.
fr: Commandes disponibles globalement pour le gestionnaire de recherches Ces commandes sont disponibles que le gestionnaire de recherches soit visible ou ait son focus sur le clavier.
ru: Глобально доступные команды, определенные для диспетчера поиска. Эти команды доступны независимо от того, является ли диспетчер поиска видимым или имеет фокус клавиатуры.

source: Bring up the search manager in search mode.
de: Suchmanager im Suchmodus aufschlagen.
fr: Amener en évidence le gestionnaire de recherches en mode recherche.
ru: Вызовите менеджер поиска в режиме поиска.

source: Search again using the search manager's current settings.
de: Nochmal suchen und dabei die aktuellen Einstellungen des Suchmanagers verwenden.
fr: Chercher de nouveau en utilisant les configurations actuelles du gestionnaire de recherche.
ru: Выполните поиск снова, используя текущие настройки менеджера поиска.

source: Search again using the search manager's current settings in forward direction
de: Nochmal vorwärts suchen und dabei die aktuellen Einstellungen des Suchmanagers verwenden
fr: Chercher de nouveau en utilisant les configurations actuelles du gestionnaire de recherche en direction avant
ru: Выполните поиск снова, используя текущие настройки менеджера поиска в прямом направлении

source: Search again using the search manager's current settings in backward direction
de: Nochmal rückwärts suchen und dabei die aktuellen Einstellungen des Suchmanagers verwenden
fr: Chercher de nouveau en utilisant les configurations actuelles du gestionnaire de recherche en direction arrière
ru: Выполните поиск снова, используя текущие настройки менеджера поиска в обратном направлении

source: Bring up the search manager in replace mode.
de: Den Suchmanager im Ersetzen-Modus aufschlagen.
fr: Amener en évidence le gestionnaire de recherches en mode remplacer.
ru: Вызовите диспетчер поиска в режиме замены.

source: Replace current selection with the search manager.
de: Die aktuelle Auswahl mit dem Suchmanager ersetzen.
fr: Remplacer la sélection actuelle avec le gestionnaire de recherches.
ru: Заменить текущий выбор менеджером поиска.

source: Replace current selection and search again.
de: Die aktuelle Auswahl ersetzen und weiter suchen.
fr: Remplacer la sélection actuelle et chercher de nouveau.
ru: Замените текущее выделение и выполните поиск снова.

source: Find view: one in the active document window is preferred and then one in a floating window. If 2+ meet the criteria, the last used for a search is returned
ru: Найти вид: один в активном окне документа является предпочтительным, а затем один в плавающем окне. Если 2 + удовлетворяют критериям, возвращается последнее использованное для поиска

source: Get initial text to put in search field.
de: Anfangstext erhalten, der in das Suchfeld eingegeben werden soll.
fr: Récupérer le texte initial à placer dans le champ de recherche.
ru: Получить исходный текст, чтобы положить в поле поиска.

source: Search forward using current selection
de: Mit der aktuellen Auswahl vorwärts suchen
fr: Recherche avant en utilisant la sélection actuelle
ru: Поиск вперед с использованием текущего выделения

source: Search backward using current selection
de: Mit der aktuellen Auswahl rückwärts suchen
fr: Recherche arrière en utilisant la sélection actuelle
ru: Поиск назад с использованием текущего выделения

source: Search on current selection using the Search in Files tool. The look_in argument gets entered in the look in field if not None or ''. The current selection is put into the search field if it doesn't span multiple lines and either use_selection is true or there's nothing in the search field. The given search text is used instead, if provided
fr: Chercher dans la sélection actuelle en utilisant l'outil Chercher dans Fichiers. L’argument look_in est entré dans le champ d'examen si non None ou ‘’. La sélection actuelle est mise dans le champ de recherche si elle ne couvre pas plusieurs lignes et soit use_selection est Vrai ou il n'y a rien dans le champ de recherche. Le texte de recherche est utilisé à la place, si fourni.
ru: Поиск выделенного с помощью инструмента «Поиск в файлах». Аргумент look_in вводится в поле look in, если отличается от None или ". Текущий выбор помещается в поле поиска, если он не охватывает несколько строк, и значение use_selection равно true, или в поле поиска ничего нет. Вместо этого используется заданный текст поиска, если он указан

source: Move to the next found match in the Search in Files tool.
de: Zur nächsten gefundenen Übereinstimmung im In-Dateien-Suchen-Werkzeug gehen.
fr: Se déplacer vers la correspondance suivante trouvée dans l'outil Chercher dans fichiers.
ru: Перейдите к следующему найденному совпадению в инструменте «Поиск в файлах».

source: Move to the previous found match in the Search in Files tool.
de: Zur vorhergehenden gefundenen Übereinstimmung im In-Dateien-Suchen-Werkzeug gehen.
fr: Se déplacer vers la correspondance précédente trouvée dans l'outil Chercher dans fichiers.
ru: Перейдите к предыдущему найденному совпадению в инструменте «Поиск в файлах».

source: Pause the currently running batch search, if any
de: Pausieren der aktuellen Stapel-Suche, falls vorhanden
ru: Приостановить текущий пакетный поиск, если таковой имеется

source: Commands for a particular search manager instance. These are only available when the search manager has they keyboard focus.
de: Befehle für eine bestimmte Instanz des Suchmanagers. Diese sind nur verfügbar, wenn der Suchmanager aktiviert ist.
fr: Commandes pour une instance particulière du gestionnaire de recherche Elles sont disponibles uniquement quand le gestionnaire de recherche a son focus sur le clavier.
ru: Команды для конкретного экземпляра диспетчера поиска. Они доступны только в том случае, если диспетчер поиска находится в фокусе клавиатуры.

source: Place a forward tab at the current cursor position in search or replace string
de: Ein Vorwärts-Tab an der aktuellen Cursor-Position im Suchen- oder Ersetzen- String setzen
fr: Placer une tabulation avant à la position actuelle du curseur dans la chaîne à chercher ou remplacer
ru: Поместите прямую вкладку в текущую позицию курсора в строке поиска или замены

source: Cut selected text
de: Ausgewählten Text ausschneiden
fr: Couper le texte sélectionné
ru: Вырезать выделенный текст

source: Copy selected text
de: Ausgewählten Text kopieren
fr: Copier le texte sélectionné
ru: Копировать выделенный текст

source: Clear selected text
de: Ausgewählten Text löschen
fr: Effacer le texte sélectionné
ru: Очистить выделенный текст

source: Paste text from clipboard
de: Text aus der Zwischenablage einfügen
fr: Coller le texte depuis le presse-papier
ru: Вставить текст из буфера обмена

source: Display search and replace in files tool.
de: Werkzeuge "Suchen und Ersetzen in Dateien" anzeigen.
fr: Afficher l'outil chercher et remplacer dans les fichiers.
