Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_edit.po
Languages: de, fr, ru

source: REPLACE
de: ERSETZEN
ru: ЗАМЕНИТЬ

source: VISUAL LINE
de: SICHTBARE LINIE
ru: ВИЗУАЛИЗИРОВАТЬ СТРОКУ

source: SELECT LINE
de: ZEILE AUSWÄHLEN
ru: ВЫБРАТЬ СТРОКУ

source: VISUAL BLOCK
de: SICHTBARER BLOCK
ru: ВИЗУАЛИЗИРОВАТЬ БЛОК

source: SELECT BLOCK
de: BLOCK AUSWÄHLEN
ru: ВЫБРАТЬ БЛОК

source: VISUAL
de: SICHTBAR
ru: ВИЗУАЛЬНЫЙ

source: SELECT
de: AUSWÄHLEN
ru: ВЫБРАТЬ

source: [Line Select]
de: [Zeilenauswahl]
ru: [Выбор Строки]

source: [Block Select]
de: [Blockauswahl]
ru: [Выбор Блока]

source: [Char Select]
de: [Zeichenauswahl]
ru: [Выбор символов]

source: Cannot insert file
de: Kann Datei nicht einfügen
ru: Не удается вставить файл

source: The selected file could not be read.
ru: Не удалось прочитать выбранный файл.

source: VI Mode Registers
de: VI-Modus-Register
ru: VI Режимы Регистров

source: Defines the action of the Tab key, one of: "Default for Personality" to emulate the selected Keyboard Personality. "Indent To Match" to indent the current line or selected line(s) to match the context, "Move to Next Tab Stop" to enter indentation characters so the caret reaches the next tab stop, "Indent Region" to increase the indentation of the selected line(s) by one level, or "Insert Tab Character" to insert a Tab character (chr(9)). For Python files, "Smart Tab" is an option that varies the tab key action according to the location of the caret within the line.
ru: Определяет действие клавиши Tab, одним из следующих значений: "Персональные умолчания", чтобы эмулировать некоторые характеристики клавиатуры. "Отступ в соответствии" для отступа текущей строки или выбранной строки(ок) в соответствии с контекстом, "Перейти к следующей Позиции Табуляции" для ввода символов отступа, чтобы курсор достиг следующей остановки вкладки, "Отступ Региона" для увеличения отступа выбранной строки(ок) на один уровень или "Вставить Символ Табуляции" для вставки символа Tab (chr(9)). Для файлов Python, во вкладке "Умная табуляция" вариант, который варьирует ключевые действия в зависимости от местоположения курсора в строке.

source: Set the header format to use for printing. This can be any text with any of the following special fields mixed in: %basename% - base file name; %prepend-fullpath% - full path file name; %prepend-relative% - relative path with from project file; %append-relative% - file name with relative path appended; %append-fullpath% - file name with full path appended; %file-time% - file modification time; %file-date% - file modification date; %current-time% - current time; %current-date% - current date; %page% - current page being printed
ru: Установите формат заголовка для печати. Это может быть любой текст с любым из следующих специальных полей, смешанных в: %basename% - базовое имя файла; %prepend-fullpath% - полное имя файла; %prepend-relative% - относительный путь от файла проекта ; %append-relative% - Имя файла с добавленным относительным путем; %append-fullpath% - Имя файла с добавленным полным путем; %file-time% - время модификации файла; %file-date% - дата изменения файла; %current-time% - текущее время; %current-date% - текущая дата; %page% - текущая печатаемая страница

source: When enabled, the Python auto-completer enters the completion automatically whenever a key other than a valid symbol name key is pressed. Press a modifier key (Shift, Alt, or Ctrl) by itself to exit the completer without entering a completion. When disabled, only the configured completion keys enter the completion into the editor.
ru: Когда включено, автокомплексор Python применяет автозавершение всякий раз, когда нажимается клавиша, отлична от текущего значения клавиши. Нажмите клавишу модификатора (Shift, Alt или Ctrl) самостоятельно, чтобы выйти из дополнения без ввода завершения. Когда отключено, только настроенные ключи завершают ввод в редактор.

source: Tab
ru: Табуляция

source: Whether and how to show a line at a collapsed fold point. Controls the position of the line and whether it is shown for collapsed or expanded fold points.
ru: Следует ли и каким образом показывать линию для точки свернутой области. Управляет положением линии и отображением её для свернутых или раскрытых точек сгиба.

source: Enable auto-wrapping of arguments during auto-invocation.
ru: Включить автоматическую обертку аргументов во время автоматического вызова.

source: Auto-enter newline and auto-indent after typing a colon that starts a new Python block and indent following line or block of lines when colon is pressed repeatedly. This also starts a new Python block using a selected range of lines as the body, if colon is pressed on a non-empty selection.
ru: Автоматически вводить новую строку и автоматически отступать после ввода двоеточия, который запускает новый блок Python и отступ после строки или блока строк при повторном нажатии двоеточия. Это также запускает новый блок Python с использованием выделенного диапазона строк в качестве тела, если двоеточие нажатj на непустом выборе.

source: Control whether and how edge markers are shown in the editor.
ru: Управляет отображением маркеров ребер в редакторе.

source: Mode
de: Modus
ru: Режим

source: Use default foreground colors for all text when printing. This is necessary when using a dark background in the GUI and printing on white paper.
ru: Используйте цвета переднего плана по умолчанию для всего текста при печати. Это необходимо при использовании темного фона в графическом интерфейсе и печати на белой бумаге.

source: Drop into Python shell after executing any Python file in the OS Commands tool
ru: Попасть в оболочку Python после выполнения любого файла Python в инструменте Команды ОС

source: Whether or not mini-search is case sensitive. May match the current keyboard personality's default, use case sensitive search only if an upper case character is typed, always search case sensitive, or always search case insensitively.
ru: Независимо от того, является ли мини-поиск чувствительным к регистру. Может соответствовать текущему значению клавиатуры по умолчанию, использовать поиск с учетом регистра только в том случае, если набран символ верхнего регистра, всегда поиск с учетом регистра или всегда поиск без учета регистра.

source: Rectangle
de: Rechteck
ru: Прямоугольник

source: Navigation
ru: Навигация

source: Commenting
de: Kommentieren
ru: Комментирование

source: Script-Defined Items
ru: Элементы, Определенные Сценарием

source: The type of split to create with commands that display in other split. The default is to split horizontally if the window width is greater than the height and to split vertically otherwise.
ru: Тип разделения для создания с командами, которые отображаются в другом разбиении. По умолчанию используется горизонтальное разделение, если Ширина окна больше высоты, и вертикальное разделение в противном случае.

source: When to use a custom mouse cursor. The color of the cursor will be the color of the caret.
ru: Если используется пользовательский курсор мыши. Цвет курсора будет цветом каретки.

source: Buggy Code
de: Fehlerhafter Code

source: Remove Bookmark
de: Lesezeichen entfernen

source: Create a new bookmark category
de: Neue Lesezeichen-Kategorie erstellen

source: Edit the selected bookmark category
de: Ausgewählte Lesezeichen-Kategorie bearbeiten

source: Delete the selected bookmark category
de: Ausgewählte Lesezeichen-Kategorie löschen

source: Manage Bookmark Categories
de: Lesezeichen-Kategorien verwalten

source: The bookmark's category, if any
de: Die Lesezeichen-Kategorie, falls vorhanden

source: Notes
de: Anmerkungen

source: Invalid Bookmark Data
de: Ungültige Lesezeichen-Daten

source: Edit Bookmark
de: Lesezeichen bearbeiten

source: n/a
de: entf.

source: Use Pseudo-TTY
de: Pseudo-TTY benutzen

source: Cannot Add File Type
de: Dateityp kann nicht hinzugefügt werden

source: Cannot Remove File Type
de: Dateityp kann nicht entfernt werden

source: Cannot Rename File Type
de: Dateityp kann nicht umbenannt werden

source: Unable to copy default snippet %s
de: Konnte Standard-Schnipsel %s nicht kopieren

source: Cannot Add Snippet
de: Schnipsel kann nicht hinzugefügt werden

source: Cannot Change Snippet Context or Name
de: Kontext oder Name des Schnipsel kann nicht geändert werden

source: Line Feed \n (Posix/Unix/OS X)
de: Zeilenvorschub \n (Posix/Unix/OS X)

source: Plain Underline
de: Einfache Unterstreichung

source: Thick Underline
de: Dicke Unterstreichung

source: Squiggly Underline
de: Verschnörkelte Unterstreichung

source: Plain Box
de: Normale Box

source: Filled Box
de: Gefüllte Box
