Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_wingide_topcommands.po
Languages: de, fr

source: Implements model ctrl-tab document switching.
de: Implementiert Model Strg-Tab Dokumentwechsel.
fr: Implémente le modèle de permutation de document ctrl-tab.

source: Move to different location.
de: Zu anderer Position gehen.
fr: Déplacer à un endroit différent.

source: These are the high level application control commands.
fr: Voici les commandes de contrôle de haut niveau de l'application.

source: Constructor; fGuiMgr is invariant.
de: Constructor; fGuiMgr ist unveränderlich.
fr: Constructeur ; fGuiMgr est invariant.

source: Quit the application.
de: Anwendung beenden.
fr: Quitter l'application.

source: Restart the application
de: Anwendung neu starten
fr: Redémarrer l'application

source: Show the application-wide about box
de: Die anwendungsweite Über-Box anzeigen
fr: Afficher la boîte «Au sujet de» de l'application

source: Open a file from disk
de: Eine Datei von der Festplatte öffnen
fr: Ouvrir un fichier depuis le disque

source: File open failed
de: Öffnen der Datei gescheitert
fr: L'ouverture du fichier a échoué

source: Remote file %s could not be inspected.
de: Remote-Datei %s konnte nicht untersucht werden.
fr: Le fichier distant %s n’a pas pu être inspecté.

source: %s is a directory and cannot be opened.
de: %s ist ein Verzeichnis und kann nicht geöffnet werden.
fr: %s est un répertoire et ne peut pas être ouvert.

source: Open a file from local disk or a remote host, prompting with file selection dialog if necessary. The dialog shown depends on the default starting directory, and may be for local files or remote files.
fr: Ouvrir un fichier depuis le disque local ou un hôte distant, demandant avec une boite de dialogue de sélection de fichier si nécessaire. La boite de dialogue affichée dépend du répertoire de départ par défaut, et peut être pour les fichiers locaux ou distants.

source: Open File
de: Datei öffnen
fr: Ouvrir un fichier

source: Select file to open
de: Zu öffnende Datei auswählen
fr: Sélectionner le fichier à ouvrir

source: Prompt user to open a file from local disk
fr: Demander à l’utilisateur d’ouvrir un fichier depuis un disque local

source: Prompt user to open a file from a remote host
fr: Demander à l’utilisateur d’ouvrir un fichier depuis un hôte distant

source: Open Remote File
de: Entfernte Datei öffnen
fr: Ouvrir un fichier distant

source: The file to select
de: Die auszuwählende Datei
fr: Le fichier à sélectionner

source: Select file to open:
de: Zu öffnende Datei auswählen:
fr: Sélectionner le fichier à ouvrir :

source: Open a file from disk using keyboard-driven selection of the file
fr: Ouvrir un fichier depuis le disque en utilisant la sélection du fichier par contrôle du clavier

source: Create a new file
de: Eine neue Datei erstellen
fr: Créer un nouveau fichier

source: Create a new scratch buffer with given title and mime type. The buffer is never marked as changed but can be saved w/ save-as.
de: Einen neuen Notizspeicher aufschlagen mit bestimmten Titel und Mime-Typ. Der Puffer wird nie als geändert angezeigt aber er kann unter einem anderen Namen gespeichert werden.
fr: Créer un nouveau tampon vide avec le titre et le type mime donné. Le tampon n'est pas marqué comme modifié mais peut être enregistré avec «Enregistrer sous».

source: Create a new document window with same documents and panels as in the current document window (if any; otherwise empty with default panels)
de: Ein neues Dokumentfenster mit den gleichen Dokumenten und Feldern wie im aktuellen Dokumentfenster (falls vorhanden, ansonsten leer mit Standard-Feldern) erstellen
fr: Créer une nouvelle fenêtre de documents avec les même documents et panneaux que dans la fenêtre de documents actuelle (s'il y en a une; dand l'autre cas une fenêtre vide avec les panneaux par défaut)

source: Create a new panel window of given type
de: Ein neues Feldfenster des gegebenen Typs erstellen
fr: Créer une nouvelle fenêtre de panneaux du type donné

source: Hide/remove all tools and restore to original default state
de: Alle Werkzeuge ausblenden/entfernen und den ursprünglichen Standard-Zustand wiederherstellen
fr: Masque/enlève tous les outils et restaure l'état par défaut originel

source: Close the current window and all documents and panels in it
de: Das aktuelle Fenster und alle Dokumente und Felder in diesem schließen
fr: Ferme la fenêtre actuelle et tous les documents et panneaux qu'elle contient

source: Save all unsaved items, prompting for names for any new items that don't have a filename already.
fr: Enregistrer tous les éléments non sauvegardés, demandant des noms pour tous les nouveaux éléments qui n'ont pas déjà de noms de fichier.

source: Check whether anything needs saving
de: Überprüfen, ob irgendetwas gespeichert werden muss
fr: Vérifie si quelque chose a besoin d'être sauvegardé

source: Close active document. Abandon any changes when ignore_changes is True. Close empty windows when close_window is true and quit if all document windows closed when can_quit is true.
fr: Ferme le document actif. Abandonne toute modification quand ignore_changes est Vrai. Ferme les fenêtres vides quand close_window est Vrai et quitte si toutes les fenêtres de documents sont fermées quand can_quit est Vrai.

source: Save active document. Also close it if close is True.
de: Aktives Dokument speichern. Dokument außerdem schließen when 'close' (schließen) auf Wahr gesetzt ist.
fr: Enregistre le document actif. Le ferme aussi si close est Vrai.

source: Save active document to a new file
de: Aktives Dokument in einer neuen Datei speichern
fr: Enregistrer le document actif dans un nouveau fichier

source: Save active document to a new file on a remote host
fr: Enregistrer le document actif dans un nouveau fichier sur un hôte distant

source: The location to write the file
de: Verzeichnis, in dem die Datei gespeichert wird
fr: L'emplacement où écrire le fichier

source: Write file:
de: Datei auswählen:
fr: Écrire le fichier :

source: First line to write or None for all
de: Erste zu schreibende Zeile oder None für alle
fr: Première ligne à écrire ou None pour toutes

source: Last line to write or None for all
de: Letzte zu schreibende Zeile oder None für alle
fr: Dernière ligne à écrire ou None pour toutes

source: Set to False to keep the editor pointed at the old file
fr: Fixer à Faux pour garder l'éditeur pointé sur le vieux fichier

source: Conflicting Filenames
de: Dateinamen-Konflikt
fr: Noms de fichier en conflit

source: The file %s is open in another editor. Please specify another file name to save to.
de: Die Datei %s ist in einen anderen Editor schon geöffnet. Bitte wählen Sie einen anderen Namen zum Speichern aus.
fr: Le fichier %s est ouvert dans un autre éditeur. Veuillez spécifier un nouveau nom de fichier pour les enregistrer.

source: Write current document to given location and close it. Saves to current file name if the given filename is None.
de: Aktuelles Dokument an dem angegebenen Ort speichern und es dann schließen. Speichert unter dem aktuellen Dateinamen, wenn der gegebene Dateiname 'None' ist.
fr: Écrire le document actuel à l'emplacement donné et le fermer. Enregistre le nom de fichier actuel si le nom de fichier donné est None.

source: Write current document to given location only if it contains any changes and close it. Writes to current file name if given filename is None.
de: Aktuelles Dokument an dem angegebenen Ort nur dann speichern, wenn es Änderungen enthält, und es dann schließen. Speichert unter dem aktuellen Dateinamen, wenn der gegebene Dateiname 'None' ist.
fr: Écrire le document actuel à l'emplacement donné seulement s'il comporte des modifications et le fermer. Écrit le nom de fichier actuel si le nom de fichier donné est None.

source: The new filename for the file
de: Neuer Dateiname für die Datei
fr: Le nouveau nom de fichier du fichier

source: Rename file:
de: Datei umbenennen:
fr: Renommer le fichier :

source: Rename current file, moving the file on disk if it exists.
fr: Renommer le fichier actuel, déplacer le fichier sur le disque si il existe.

source: Name of the new file
de: Name der neuen Datei
fr: Nom du nouveau fichier

source: New file:
de: Neue Datei:
fr: Nouveau fichier :

source: Create a new blank file on disk, open it in an editor, and add it to the current project.
de: Eine neue, leere Datei auf der Festplatte erstellen, sie in einem Editor öffnen und zum aktuellen Projekt hinzufügen.
fr: Créer un nouveau fichier vierge sur le disque, l'ouvrir dans un éditeur, et l'ajouter au projet en cours.

source: The file %s is open in another editor. Please choose another file name.
de: Die Datei %s ist in einen anderen Editor schon geöffnet. Bitte wählen Sie einen anderen Dateinamen aus.
fr: Le fichier %s est ouvert dans un autre éditeur. Veuillez choisir un autre nom de fichier.

source: Name of the new directory
de: Name des neuen Verzeichnisses
fr: Nom du nouveau répertoire

source: New directory:
de: Neues Verzeichnis:
fr: Nouveau répertoire :

source: Create a new directory on disk and add it to the current project.
fr: Créer un nouveau répertoire sur le disque et l'ajouter au projet actuel.

source: Name of the new package
de: Name des neuen Pakets
fr: Nom du nouveau package

source: New package:
de: Neues Paket:
fr: Nouveau package :

source: Create a new Python package directory on disk, add it to the current project, and open the new __init__.py in the editor.
fr: Créer un nouveau répertoire de package Python sur le disque, l'ajouter au projet actuel et ouvrir le nouveau __init__.py dans l’éditeur.

source: Abandon any changes in the current document and reload it from disk. Prompts for user to confirm the operation unless either there are no local changes being abandoned or confirm is set to False.
de: Änderungen im aktuellen Dokument verwerfen und es neu von der Festplatte laden. Fordert den Benutzer auf, die Operation zu bestätigen, außer wenn keine lokalen Änderungen vorhanden sind, die verworfen werden, oder wenn Bestätigen auf 'Falsch' gesetzt ist.
fr: Abandonner toute modification dans le document actuel et le recharger depuis le disque. Demander à l'utilisateur de confirmer l'opération à moins qu'il n'y ait pas de modifications locales en cours d'abandon ou que confirm soit affecté à Faux.

source: Abandon Changes?
de: Änderungen verwerfen?
fr: Abandonner les changements ?

source: Do you really want to abandon your changes and reread this file from disk?
de: Wollen Sie Ihre Änderungen wirklich verwerfen und diese Datei von der Festplatte neu lesen?
fr: Voulez vous vraiment abandonner vos modifications et relire ce fichier depuis le disque ?

source: _Abandon Changes
de: Änderungen _verwerfen
fr: _Abandonner les modifications

source: _Cancel
de: _Abbrechen
fr: Annuler

source: Return arg info sequence for switch-document command.
de: Info-Sequenz des Arguments zum Befehl Dokument wechseln zurücksenden.
fr: Retourne la séquence arg info pour la commande échanger-document.

source: Document to switch to
de: Das Dokument, zu dem gewechselt werden soll
fr: Document à échanger vers

source: Switch to document:
de: Wechseln zu Dokument:
fr: Échanger le document :

source: Switches to named document. Name may either be the complete name or the last path component of a path name.
de: Wechselt zum genannten Dokument. Name kann entweder ein vollständiger Name oder die letzte Pfadkomponente eines Pfadnamens sein.
fr: Bascule au document nommé. Le nom peut être soit un nom complet ou le dernier composant d'un chemin.

source: Start moving between documents in the order they were visited. Starts modal key interaction that ends when a key other than tab is seen or ctrl is released.
fr: Commencer à se déplacer entre les documents dans l'ordre où ils ont été visités. Démarre une interaction de touche modale qui termine quand une touche autre que la tabulation est vue ou que ctrl est relâché.

source: Switches to previous document most recently visited in the current window or window set if in one-window-per-editor windowing mode.
de: Wechselt zum vorherigen Dokument, das zuletzt im aktuellen Fenster oder im Fensterset, wenn Sie sich im Fenstermodus Ein-Fenster-pro-Editor befinden, besucht wurde.
fr: Passer au document précédent le plus récemment ouvert dans la fenêtre actuelle ou groupement de fenêtre en mode une-fenêtre-par-éditeur.

source: Switch to the next window alphabetically by title
de: Zum nächsten Fenster in Alphabetischer Reihenfolge
fr: Passer à la fenêtre suivante dans l'ordre alphabétique des titres

source: Switch to the previous window alphabetically by title
fr: Passer à la fenêtre précédente dans l'ordre alphabétique des titres

source: Get list of (title, window) sorted alphabetically by title and current window
de: Eine Liste von (Titel, Fenster) holen, die alphabetisch nach Titel und aktuellem Fenster sortiert ist
fr: Récupérer la liste des (titre, fenêtre) triée alphabétiquement par titre et fenêtre actuelle

source: Name of the command to execute
de: Name des auszuführenden Befehls
fr: Nom de la commande à exécuter

source: Command
de: Befehl
fr: Commande

source: Execute given command by name, collecting any args as needed
de: Gegebenen Befehl nach Namen ausführen, irgendwelche Argumente sammeln, wie benötigt
fr: Exécute la commande donnée par son nom en collectant tous les arguments nécessaires

source: Cannot parse command name: %s
de: Kommando-Name konnte nicht ausgewertet werden: %s
fr: Impossible d’analyser le nom de la commande : %s

source: Command not found: %s
de: Kommando nicht gefunden: %s
fr: Commande non trouvée : %s

source: Force reload of all scripts, from all configured script directories. This is usually only needed when adding a new script file. Existing scripts are automatically reloaded when they change on disk.
de: Das Neuladen aller Skripte, von allen konfigurierten Skriptverzeichnissen, erzwingen. Dies ist normalerweise nur erforderlich, wenn eine neue Skript-Datei hinzugefügt wird. Existierende Skripte werden automatisch neu geladen, wenn sie auf der Festplatte geändert wurden.
fr: Force le rechargement de tous les scripts, depuis tous les répertoires de scripts configurés. C'est normalement nécessaire seulement lors de l'ajout d'un nouveau fichier de script. Les scripts existant sont automatiquement rechargé lorsqu'il sont modifiés sur le disque.

source: Display interactive tip manager
de: Interaktiven Hinweismanager anzeigen
fr: Afficher la gestion des conseils interactifs

source: Show the HTML version of the Wing users manual
de: HTML-Version des Wing Benutzerhandbuches anzeigen
fr: Afficher la version HTML du manuel de l'utilisateur de Wing

source: Show the PDF version of the Wing users manual for either US Letter or A4, depending on user's print locale
de: PDF-Version des Wing Benutzerhandbuches anzeigen, entweder in US Letter oder A4, abhängig vom Druckort des Benutzers
fr: Afficher la version PDF du manuel utilisateur de Wing pour aussi bien US Letter que A4, en fonction de la locale d'impression de l'utilisateur

source: Show the Python users manual
de: Das Python-Benutzerhandbuches anzeigen
fr: Afficher le manuel utilisateur de Python

source: Show the Wingware home page
de: Die Wingware Homepage anzeigen
fr: Afficher la page d'accueil de Wingware

source: Show the Wingware store for purchasing a license
de: Den Wingware Shop anzeigen um eine Lizenz zu erwerben
fr: Afficher le magasin Wingware pour acheter une licence

source: Show the Wing Q&A site
fr: Afficher le site de Questions/Réponses de Wing

source: Show the Wing support site home page
de: Homepage der Wing Support Site anzeigen
fr: Afficher la page d'accueil du site de support de Wing

source: Show the Python Success Stories page
de: Seite der Python Success Stories anzeigen
fr: Afficher la page d'histoires à succès de Python

source: Show the python.org site home page
de: Homepage der python.org Site anzeigen
fr: Afficher la page d'accueil du site python.org

source: Show the python.org site search page
de: Suchseite der python.org Seite anzeigen
fr: Afficher la page de recherche du site python.org

source: Show the Python for Beginners web page
de: Die Webseite Python für Anfänger anzeigen
fr: Afficher la page internet de Python pour les débutants

source: Show the Python donations web page
de: Die Python Spenden-Webseite anzeigen
fr: Afficher la page internet des donations Python

source: Panel Type
de: Feldtyp
fr: Type de panneau

source: Edit the preferences file using the preferences GUI, optionally opening to the section that contains the given preference by name
de: Die Einstellungsdatei, die die GUI-Einstellungen nutzt, bearbeiten; optional im Abschnitt öffnen, der die gegebenen Einstellungen nach Namen enthält
fr: Éditer le fichier de préférences utilisant les préférences de l'interface utilisateur graphique, optionellement en ouvrant à la section qui contient la préférence donnée par nom

source: Show the plugins GUI for enabling and disabling plugins
fr: Afficher les plugins d'interface graphique utilisateur pour activer et désactiver les plugins

source: Edit the preferences as a text file
de: Die Einstellungen als eine Textdatei bearbeiten
fr: Éditer les préférences comme un fichier texte

source: Enter a sequence of digits indicating number of times to repeat the subsequent command or keystroke.
de: Eine Reihenfolge von Ziffern eingeben, die die Anzahl der Wiederholungen des nachfolgenden Befehls oder Tastenanschlags anzeigt.
fr: Entrer une séquence de chiffres indiquant le nombre de fois à répéter la commande à venir ou la frappe du clavier.

source: VI style repeat/numeric modifier for following command
de: Wiederholen/numerischer Modifikator (VI-Stil) für den folgenden Befehl
fr: Style VI du modifieur répéter/numérique pour la commande suivante

source: Show the line numbers in editors
de: Zeilennummern in Editoren anzeigen
fr: Afficher les numéros de lignes dans les éditeurs

source: Hide line numbers in editors
de: Zeilennummern in Editoren ausblenden
fr: Masquer les numéros de lignes dans les éditeurs

source: Execute the file at the given location or use the active view if loc is None.
de: Die Datei am gegebenen Ort ausführen oder die aktive Ansicht verwenden, wenn loc None ist.
fr: Exécuter le fichier à l'emplacement donné ou utiliser la vue active si loc est None.

source: Execute the given command line in the OS Commands tool using default run directory and environment as defined in project properties, or the values set in an existing command with the same command line in the OS Commands tool.
fr: Exécute la ligne de commande donnée dans l'outil Commandes de l’OS en utilisant le répertoire de lancement par défaut et l'environnement comme défini dans les propriétés du projet, ou les valeurs fixées dans une commande existante avec la même ligne de commande dans l'outil Commandes de l’OS.

source: Execute one of the stored commands in the OS Commands tool, selecting it by its title
fr: Exécute une des commandes stockées dans l'outil Commandes de l’OS, la sélectionnant par son titre

source: Title
de: Titel
fr: Titre

source: Title:
de: Titel:
fr: Titre :

source: Show console
de: Konsole anzeigen
fr: Afficher la console

source: Terminate one of the stored commands in the OS Commands tool, selecting it by its title
fr: Exécute une des commandes stockées dans l'outil Commandes de l’OS, la sélectionnant par son titre

source: Execute one of the stored commands in the OS Commands tool, selecting it by its internal ID
fr: Exécute une des commandes stockées dans l'outil Commandes de l’OS, la sélectionnant par son ID interne

source: Show the selected file in the Explorer, Finder, or other OS-provided file manager. Shows the given file, if any, or the current file selected in the GUI.
fr: Affiche le fichier sélectionné dans l'Explorateur, le Finder, ou tout autre gestionnaire de fichiers fourni par l’OS. Affiche le fichier donné, si existant, ou le fichier courant sélectionné dans l'Interface utilisateur.

source: Show the given documentation section
de: Gegebenen Dokumentationsabschnitt anzeigen
fr: Afficher la section de la documentation concernée

source: Show the tutorial
de: Tutorial anzeigen
fr: Afficher le tutoriel

source: Show the quick start guide
de: Schnellstart-Anleitung anzeigen
fr: Afficher le guide de démarrage rapide

source: Show the How-Tos index
de: How-Tos-Index anzeigen
fr: Afficher l'index des guides pratiques

source: Show the Wing Tips window
de: Fenster mit Wing Tipps anzeigen
fr: Afficher la fenêtre des conseils Wing

source: Show the given document section in HTML format.
de: Gegebenen Dokumentabschnitt in HTML-Format anzeigen.
fr: Afficher la section de la documentation concernée en format HTML.

source: Search using given text and the toolbar search area. The search is always forward from the current cursor or selection position
fr: Recherche utilisant le texte donné et la zone de recherche de la barre d'outil. La recherche est toujours en avant depuis l'emplacement actuel du curseur ou de la position de la sélection

source: Search successful (wrapped)
de: Suche erfolgreich (umbrochen)
fr: Recherche réussie (passage à la ligne)

source: No search match
de: Keine Suchtreffer
fr: Aucune recherche ne correspond

source: Search successful
de: Suche erfolgreich
fr: Recherche réussie

source: Move to next match of text already entered in the toolbar search area
fr: Se déplacer vers la correspondance suivante du texte déjà rentré dans la zone de recherche de la barre d'outil

source: Move to previous match of text already entered in the toolbar search area
fr: Se déplacer vers la correspondance précédente du texte déjà entré dans la zone de recherche de la barre d'outil

source: Move focus to toolbar search entry.
fr: Déplacer le focus vers l'entrée de la barre de recherche.

source: Show the feedback submission dialog
de: Dialog für Feedback anzeigen
fr: Afficher la boite de dialogue d'envoi de retour d'expériences

source: Show the bug reporting dialog
de: Dialog für Fehlerberichte anzeigen
fr: Afficher la boite de dialogue de rapport de bug

source: Check for updates to Wing and offer to install any that are available
de: Nach Updates für Wing suchen und vorschlagen, verfügbare Updates zu installieren
fr: Vérifier les mises a jour Wing et propose de les installer si il y en a de disponibles

source: Apply a manually downloaded update
fr: Appliquer une mise-à-jour téléchargée manuellement

source: Checking Installation
de: Prüfe Installation
fr: Vérification de l’installation

source: Reading Catalog
de: Katalog wird gelesen
fr: Lecture du catalogue

source: Scanned %i of %i files
fr: %i fichiers scannés sur %i

source: Installation is Valid
de: Installation ist in Ordnung
fr: L'installation est valide

source: No problems were found with your installation of Wing %s version %s
fr: Aucun problème n'a été trouvé avec votre installation de Wing %s version %s

source: Installation Problems Found
de: Probleme mit der Installation gefunden
fr: Problèmes d'installation trouvés

source: Prompt user and copy the tutorial directory from the Wing installation to the directory selected by the user
de: Kopiert das Tutorial-Verzeichnis aus der Wing Installation in ein Verzeichnis, das vom Benutzer ausgewählt wird.
fr: Demande à l'utilisateur et copie le répertoire de tutoriel depuis l'installation de Wing vers le répertoire sélectionné par l'utilisateur

source: Could not copy tutorial
de: Tutorial konnte nicht kopiert werden
fr: N'a pas pu copié le tutoriel

source: No valid directory was selected.
de: Es wurde kein gültiges Verzeichnis ausgewählt.
fr: Aucun répertoire valide n'a été sélectionné.

source: tutorial
fr: tutoriel
