Repository: wingware-dev/wing9-po-all
Catalog: PO/*/src_guimgr_commands.po
Languages: de, fr

source: Commands for the documentation viewer that are available regardless of where the focus is.
fr: Commandes pour le visionneur de documentation qui sont disponibles où que soit le focus.

source: Search all documentation.
de: In gesamter Dokumentation suchen.
fr: Chercher dans toute la documentation.

source: Commands for the documentation viewer. These are available when the documentation viewer has the keyboard focus.
de: Befehle für die Dokumentationsansicht. Diese stehen zur Verfügung, wenn die Tastatur für die Dokumentationsansicht aktiviert ist.
fr: Commandes pour le visionneur de documentation. Elles sont disponibles quand le visionneur de documentation a le focus sur le clavier.

source: Go back to prior page in the history of those that have been viewed
fr: Retourner à la page précédente dans l'historique des pages vues

source: Go forward to next page in the history of those that have been viewed
fr: Aller à la page suivante dans l'historique des pages vues

source: Go to the previous page in the current document
de: Zur vorherigen Seite im aktuellen Dokument gehen
fr: Aller à la page précédente

source: Go to the next page in the current document
de: Zur nächsten Seite im aktuellen Dokument gehen
fr: Aller à la page suivante

source: Go to the document contents page
de: Zur Inhaltsseite des Dokuments gehen
fr: Aller au sommaire

source: Initiate incremental mini-search forward from the cursor position, optionally entering the given search string.
de: Inkrementale Mini-Suche vorwärts an der Cursor-Position beginnen; den Suchstring wahlweise eingeben.
fr: Initier une mini-recherche incrémentale en avant à partir de la position du curseur, optionellement en entrant la chaîne recherche donnée.

source: Initiate incremental regular expression mini-search forward from the cursor position, optionally entering the given search string.
de: Inkrementale Mini-Suche vorwärts für reguläre Ausdrücke an der Cursor-Position beginnen; den Suchstring wahlweise eingeben.
fr: Initier une mini-recherche d'expression régulière incrémentale en avant à partir de la position du curseur, optionellement en entrant la chaîne recherche donnée.

source: Initiate incremental mini-search backward from the cursor position, optionally entering the given search string.
de: Inkrementale Mini-Suche rückwärts an der Cursor-Position beginnen; den Suchstring wahlweise eingeben.
fr: Initier une mini-recherche incrémentale en arrière à partir de la position du curseur, optionellement en entrant la chaîne recherche donnée.

source: Initiate incremental regular expression mini-search backward from the cursor position, optionally entering the given search string.
de: Inkrementale Mini-Suche rückwärts für reguläre Ausdrücke an der Cursor-Position beginnen; den Suchstring wahlweise eingeben.
fr: Initier une mini-recherche d'expression régulière incrémentale en arrière à partir de la position du curseur, optionellement en entrant la chaîne recherche donnée.

source: Repeat the most recent isearch, using same string and regex/text. Reverse direction when reverse is True.
de: Die letzte Suche wiederholen und dafür den gleichen String und Regex/Text verwenden. Suchrichtung umdrehen, wenn "reverse" (umdrehen) auf Wahr gesetzt ist.
fr: Répeter la isearch la plus récente, utilisant la même chaine et les mêmes expressions régulières/text. Inverser la direction quand reverse est Vrai.

source: Initiate incremental mini-search forward from the cursor position, using current selection as the search string. Set persist=False to do the search but end the interactive search session immediately.
de: Eine inkrementale Mini-Suche vorwärts an der Cursor-Position beginnen; dabei die aktuelle Auswahl als Suchstring verwenden. Die Option "persist=False" setzen, um die Suche auszuführen, aber die interaktive Suchsitzung sofort zu beenden.
fr: Initier une mini-recherche incrémentale en avant à partir de la position du curseur, en utilisant la sélection actuelle comme chaîne de recherche. Affecter persist=False pour faire la recherche mais terminer la session de recherche interactive immédiatement.

source: Initiate incremental mini-search backward from the cursor position, using current selection as the search string. Set persist=False to do the search but end the interactive search session immediately.
de: Inkrementale Mini-Suche rückwärts an der Cursor-Position beginnen; dabei die aktuelle Auswahl als Suchstring verwenden. Die Option "persist=False" setzen, um die Suche auszuführen, aber die interaktive Suchsitzung sofort zu beenden.
fr: Initier une mini-recherche incrémentale en arrière à partir de la position du curseur, en utilisant la sélection actuelle comme chaîne de recherche. Affecter persist=False pour faire la recherche mais terminer la session de recherche interactive immédiatement.

source: Copy any selected text.
fr: Copier n'importe quel texte sélectionné.

source: Increase documentation font size
fr: Augmenter la taille de police de la documentation

source: Decrease documentation font size
fr: Diminuer la taille de police de la documentation

source: Reset documentation font size to default
fr: Réinitialiser la taille de police de la documentation par défaut

source: Commands for the Wing Tips tool. These are only available when the tool is visible and has focus
de: Befehle für das Werkzeug Wing Tipps. Diese sind nur verfügbar, wenn das Werkzeug sichtbar und aktiviert ist.
fr: Commandes pour l'outil de Conseils Wing. Elles sont disponibles seulement quand l'outil est visible et a le focus

source: Go to the previous page in Wing Tips
de: Zur vorherigen Seite der Wing Tipps gehen
fr: Aller à la page précédente des conseils Wing

source: Go to the next page in Wing Tips
fr: Aller à la page suivante dans les conseils Wing

source: Go to the Wing Tips contents page
fr: Aller à la page de contenus des conseils Wing

source: Go to a next unseen Wing Tips page
de: Zu die nächste ungesehene Seite der Wing Tipps gehen
fr: Aller à une page suivante non vue des conseils Wing

source: Close the Wing Tips window
de: Das Wing Tipps Fenster schließen
fr: Fermer la fenêtre de conseils Wing

source: Commands for a particular editor split, available when the editor in that split has the keyboard focus. Additional commands affecting the editor's content are defined separately.
de: Befehle für einen bestimmten Editor-Teil. Diese sind nur verfügbar, wenn die Tastatur für den Editor-Teil aktiviert ist. Zusätzliche Befehle, die den Inhalt des Editors beeinflussen sind separat definiert.
fr: Commandes pour une division particulière de l'éditeur, elles sont disponibles quand l'éditeur dans cette division a le focus du clavier. Les commandes additionnelles affectant le contenu de l'éditeur sont définies séparément.

source: Constructor
fr: Constructeur

source: Activate the file menu for the editor.
de: Dateimenü für den Editor aktivieren.
fr: Activer le menu fichier pour l'éditeur.

source: Move back in history to previous visited editor position
fr: Se déplacer en arrière dans l'historique vers la position d'éditeur visitée précédente

source: Move forward in history to next visited editor position
fr: Se déplacer en avant dans l'historique vers la position d'éditeur visitée suivante

source: Increase height of this split
de: Höhe dieses Teils vergrößern
fr: Augmenter la hauteur de cette division

source: Decrease height of this split
de: Höhe dieses Teils verkleinern
fr: Diminuer la hauteur de cette division

source: Increase width of this split
de: Breite dieses Teils vergrößern
fr: Augmenter la largeur de cette division

source: Decrease width of this split
de: Breite dieses Teils verkleinern
fr: Diminuer la largeur de cette division

source: Commands that control splitting up an editor panel. These are available when one split in the editor panel has the keyboard focus.
de: Befehle, die das Teilen eines Editor-Feldes steuern. Diese sind verfügbar, wenn die Tastatur für einen Teil im Editor-Feld aktiviert ist.
fr: Commandes qui contrôlent le découpage de divisions d'un panneau d'éditeur. Elles sont disponibles quand une division dans le panneau d'éditeur a le focus du clavier.

source: Split current view horizontally.
de: Aktuelle Ansicht waagerecht teilen.
fr: Diviser la vue actuelle horizontalement.

source: Split current view horizontally and open selected file
de: Aktuelle Ansicht senkrecht teilen und ausgewählte Datei öffnen
fr: Diviser la vue actuelle horizontalement et ouvrir le fichier sélectionné

source: The file to select
de: Die auszuwählende Datei
fr: Fichier à sélectionner

source: Select file:
de: Datei auswählen:
fr: Sélectionner un fichier :

source: Split current view vertically. Create new editor in new view when new==1.
de: Aktuelle Ansicht senkrecht teilen. Neuen Editor in neuer Ansicht erstellen, wenn "new==1".
fr: Diviser la vue actuelle verticalement. Créer un nouvel éditeur dans une nouvelle vue quand new==1.

source: Split current view vertically and open selected file
de: Aktuelle Ansicht senkrecht teilen und ausgewählte Datei öffnen
fr: Diviser la vue actuelle verticalement et ouvrir le fichier sélectionné

source: Commands available only when the editor is in non-modal editing mode
de: Befehle sind nur verfügbar, wenn der Editor im nicht-modalen Bearbeitungsmodus ist
fr: Commandes disponibles seulement quand l'éditeur est en mode d'édition non-modale

source: Turn on auto-select mode character by character
de: Modus 'Automatisch auswählen' Zeichen für Zeichen anschalten
fr: Activer le mode d'auto-sélection caractère par caractère

source: Turn on auto-select mode line by line
de: Modus 'Automatisch auswählen' Zeile für Zeile anschalten
fr: Activer le mode d'auto-sélection ligne par ligne

source: Exit visual mode and return back to default mode
de: Visuellen Modus verlassen und zum Standard-Modus zurückkehren
fr: Sortir du mode visuel et revenir au mode par défaut.

source: Commands available only when the editor is in browse mode (used for VI bindings and possibly others)
de: Befehle sind nur verfügbar, wenn der Editor im Durchsuchen-Modus ist (verwendet für VI-Bindings und möglicherweise andere)
fr: Commandes disponibles seulement quand l'éditeur est en mode explorateur (utilisé pour les raccourcis VI et probablement d'autres)

source: Enter editor insert mode
de: In den Editor-Einfügemodus gehen
fr: Entrer dans le mode d'insertion de l'éditeur

source: Enter editor replace mode
de: In den Editor-Ersetzenmodus gehen
fr: Entrer dans le mode de remplacement de l'éditeur

source: Enter editor visual mode. Unit should be one of 'char', 'line', or 'block'.
de: In den visuellen Modus des Editors gehen. Die Einheit sollte entweder 'char' (Zeichen), 'line' (Zeile) oder 'block' (Block) sein.
fr: Entrer le mode visuel de l'éditeur. L'unité doit être une de 'char', 'line', ou 'block'.

source: Turn on auto-select using previous mode and selection
fr: Activer l'auto-sélection en utilisant le mode et la sélection précédents

source: Commands available only when the editor is in visual mode (used for VI bindings and some others)
de: Befehle sind nur verfügbar, wenn der Editor im visuellen Modus ist (verwendet für VI-Bindings und einige andere)
fr: Commandes uniquement disponibles quand l'éditeur est en mode visuel (utilisé pour des raccourcis VI et quelques autres)

source: Enter editor browse mode
de: In den Durchsuchen-Modus des Editors gehen
fr: Entrer le mode de naviguation de l'éditeur

source: Alter type of editor visual mode or exit back to browse mode. Unit should be one of 'char', 'line', or 'block'.
de: Art des visuellen Modus des Editors ändern oder zum Durchsuchen-Modus zurückkehren. Die Einheit sollte entweder 'char' (Zeichen), 'line' (Zeile) oder 'block' (Block) sein.
fr: Altérer le type du mode visuel d'éditeur ou revenir vers le mode explorateur. L'unité doit être une de 'char', 'line', ou 'block'.

source: Commands available only when editor is in insert mode (used for VI bindings and possibly others)
de: Befehle sind nur verfügbar, wenn der Editor im Einfügemodus ist (verwendet für VI-Bindings und möglicherweise andere)
fr: Commandes uniquement disponibles quand l'éditeur est en mode insertion (utilisé pour des raccourcis VI et quelques autres)

source: Commands available only when editor is in replace mode (used for VI bindings and possibly others)
de: Befehle sind nur verfügbar, wenn der Editor im Ersetzen-Modus ist (verwendet für VI-Bindings und möglicherweise andere)
fr: Commandes uniquement disponibles quand l'éditeur est en mode remplacement (utilisé pour des raccourcis VI et quelques autres)

source: Show or minimize the horizontal tool area
de: Den waagerechten Werkzeugbereich anzeigen oder minimieren
fr: Afficher ou minimiser la zone d'outils horizontale

source: Show or minimize the vertical tool area
de: Den senkrechten Werkzeugbereich anzeigen oder minimieren
fr: Afficher ou minimiser la zone d'outils verticale

source: Show the horizontal tool area
de: Waagerechten Werkzeugbereich anzeigen
fr: Afficher la zone d'outils horizontale

source: Minimize the horizontal tool area
de: Waagerechten Werkzeugbereich minimieren
fr: Minimiser la zone d'outils horizontale

source: Show the vertical tool area
de: Senkrechten Werkzeugbereich anzeigen
fr: Afficher la zone d'outils verticale

source: Minimize the vertical tool area
de: Senkrechten Werkzeugbereich minimieren
fr: Minimiser la zone d'outils verticale

source: Hide the horizontal tool area
de: Waagerechten Werkzeugbereich ausblenden
fr: Masquer la zone d'outils horizontale

source: Hide the vertical tool area
de: Senkrechten Werkzeugbereich ausblenden
fr: Masquer la zone d'outils verticale

source: Hide both the vertical and horizontal tool areas and toolbar, saving previous state so it can be restored later with exit_fullscreen
de: Sowohl die senkrechten als auch die waagerechten Werkzeugbereiche und die Werkzeugleiste ausblenden. Dabei den vorherigen Zustand speichern, so dass er später mit der Option 'exit_fullscreen' (Vollbildschirm verlassen) wieder hergestellt werden kann.
fr: Masquer les zones d'outils verticales, horizontales et la barre d'outils, sauvegardant l'état précédent ainsi il pourra être restauré plus tard avec exit_fullscreen

source: Restore previous non-fullscreen state of all tools and tool bar
de: Vorherigen Nicht-Vollbildschirm-Zustand aller Werkzeuge und der Werkzeugleiste wieder herstellen
fr: Restaurer l'état non-plein écran précédent de tous les outils et de la barre d'outils

source: Show toolbars in all document windows
fr: Afficher les barres d'outils dans toutes les fenêtres de document

source: Hide toolbars in all document windows
fr: Masquer les barres d'outils dans toutes les fenêtres de document

source: Commands for windows in general. These are available for the currently active window, if any.
de: Befehle für Fenster. Diese sind für das derzeitig aktive Fenster, wenn vorhanden, verfügbar.
fr: Commandes pour les fenêtres en général. Elles sont disponibles pour la fenêtre active actuelle, si existante.

source: Move the keyboard focus forward within the Window to the next editable area
fr: Déplacer le focus du clavier en avant dans la fenêtre vers la zone éditable suivante

source: Move focus to first editor split
de: Erste Editor-Teilung aktivieren
fr: Déplacer le focus à la première division de l'éditeur

source: Move focus to last editor split
de: Letzte Editor-Teilung aktivieren
fr: Déplacer le focus à la dernière division de l'éditeur

source: Move focus to previous editor split
fr: Déplacer le focus à la division précédente de l'éditeur

source: Move focus back to the current editor, out of any tool, if there is an active editor.
fr: Déplacer le focus du clavier en arrière dans l'éditeur actuel, en dehors de tout outil, si il y a un éditeur actif.

source: Commands available when the tool bar search entry area has the keyboard focus.
de: Befehle für das Suchfeld in der Werkzeugleiste. Diese stehen zur Verfügung, wenn die Tastatur für das Suchfeld in der Werkzeugleiste aktiviert ist.
fr: Commandes disponibles quand l'entrée de recherche de la barre d'outils a le focus sur le clavier.

source: Cut selection
de: Ausgewählten Text ausschneiden
fr: Couper la sélection

source: Paste from clipboard
de: Text aus der Zwischenablage einfügen
fr: Coller du presse-papier

source: Move forward one character
de: Vorwärts ein Zeichen
fr: Se déplacer en avant d'un caractère

source: Move forward one character, extending the selection
de: Vorwärts ein Zeichen, Text-Auswahl an der neue Position anpassen
fr: Se déplacer en avant d'un caractère, en étendant la sélection

source: Move forward one word
de: Vorwärts ein Wort
fr: Se déplacer en avant d'un mot

source: Move forward one word, extending the selection
de: Vorwärts ein Wort, Text-Auswahl an der neue Position anpassen
fr: Se déplacer en avant d'un mot, en étendant la sélection

source: Move backward one character
de: Zurück ein Zeichen
fr: Se déplacer en arrière d'un caractère

source: Move backward one character, extending the selection
de: Zurück ein Zeichen, Text-Auswahl an der neue Position anpassen
fr: Se déplacer en arrière d'un caractère, en étendant la sélection

source: Move backward one word
de: Zurück ein Wort
fr: Se déplacer en arrière d'un mot

source: Move backward one word, extending the selection
de: Zurück ein Wort, Text-Auswahl an der neue Position anpassen
fr: Se déplacer en arrière d'un mot, en étendant la sélection

source: Move to the beginning of the toolbar search entry
de: Zurück zum Anfang des Suchtextes in der Werkzeugleiste
fr: Se déplacer au début de l'entrée de recherche de la barre d'outils

source: Move to the beginning of the toolbar search entry, extending the selection
de: Zurück zum Anfang des Suchtextes in der Werkzeugleiste, Text-Auswahl an der neue Position anpassen
fr: Se déplacer au début de l'entrée de recherche de la barre d'outils, en étendant la sélection

source: Move to the end of the toolbar search entry
de: Zum Ende des Suchtextes in der Werkzeugleiste
fr: Se déplacer à la fin de l'entrée de recherche de la barre d'outils

source: Move to the end of the toolbar search entry, extending the selection
fr: Se déplacer à la fin de l'entrée de recherche de la barre d'outils, en étendant la sélection

source: Delete character in front of the cursor
de: Ein Zeichen vor den Cursor löschen
fr: Supprimer le caractère devant le curseur

source: Delete word in front of the cursor
de: Ein Wort vor den Cursor löschen
fr: Supprimer le mot devant le curseur

source: Delete character behind the cursor
de: Ein Zeichen hinter den Cursor löschen
fr: Supprimer le caractère derrière le curseur

source: Delete word behind the cursor
de: Ein Wort hinter den Cursor löschen
fr: Supprimer le mot derrière le curseur

source: Standard editor commands for use when a QLineEdit instance has the focus.
fr: Commandes standard de l’éditeur à utiliser quand une instance QLineEdite a le focus.

source: Turn on auto-select block mode
de: Modus 'Block automatisch auswählen' anschalten

source: Perform vi mode ctrl-v action which either does a paste or does start-select-block. The default is to map ctrl-v to clipboard on Windows and OS X. This can be overridden by the VI Mode Ctrl-X/C/V preference.
de: VI-Modus-Aktion 'Strg-V', die entweder eine Einfügung vornimmt oder start-select-block ausführt. Standardmäßig wird Strg-V in Windows und OS X zur Zwischenablage abgebildet. Dies kann mit der Einstellung VI-Modus Strg-X/C/V überschrieben werden.

source: Perform vi mode ctrl-x action which either does a cut or does initiate-numeric-modified with the following digit key press. The default is to map ctrl-x to clipboard on Windows and OS X. This can be overridden by the VI Mode Ctrl-X/C/V preference.
de: VI-Modus-Aktion 'Strg-X' ausführen, die entweder ein Ausschneiden vornimmt oder initiate-numeric-modified mit dem nächsten Betätigen einer Zifferntaste ausführt. Standardmäßig wird Strg-X in Windows und OS X zur Zwischenablage abgebildet. Dies kann mit der Einstellung VI-Modus Strg-X/C/V überschrieben werden.

source: Perform vi mode ctrl-c action which either does a copy or nothing if ctrl-x/v/c are not being used for clipboard actions. The default is to map ctrl-c to clipboard on Windows and OS X. This can be overridden by the VI Mode Ctrl-X/C/V preference.
de: VI-Modus-Aktion 'Strg-C' ausführen, die entweder ein Kopieren vornimmt oder nichts ausführt, wenn Strg-X/V/C nicht für Aktionen der Zwischenablage verwendet werden. Standardmäßig wird Strg-C in Windows und OS X zur Zwischenablage abgebildet. Dies kann mit der Einstellung VI-Modus Strg-X/C/V überschrieben werden.

source: Perform vi mode ctrl-x action which either does a cut or nothing depending on whether ctrl-x/v/c are mapped to clipboard actions. The default is to map ctrl-x to clipboard on Windows and OS X. This can be overridden by the VI Mode Ctrl-X/C/V preference.
de: VI-Modus-Aktion 'Strg-X' ausführen, die entweder ein Ausschneiden vornimmt oder nichts ausführt, abhängig davon, ob Strg-X/V/C für Aktionen der Zwischenablage verwendet werden. Standardmäßig wird Strg-X in Windows und OS X zur Zwischenablage abgebildet. Dies kann mit der Einstellung VI-Modus Strg-X/C/V überschrieben werden.

source: Perform vi mode ctrl-c action which either does a copy or enters browse mode if ctrl-x/v/c are not being used for clipboard actions. The default is to map ctrl-c to clipboard on Windows and OS X. This can be overridden by the VI Mode Ctrl-X/C/V preference.
de: VI-Modus-Aktion 'Strg-C' ausführen, die entweder ein Kopieren vornimmt oder in den Durchsuchen-Modus geht, wenn Strg-X/V/C nicht für Aktionen der Zwischenablage verwendet werden. Standardmäßig wird Strg-C in Windows und OS X zur Zwischenablage abgebildet. Dies kann mit der Einstellung VI-Modus Strg-X/C/V überschrieben werden.

source: Commands for windows that contain dockable tool areas. These are available for the currently active window, if any.
de: Befehle für Fenster, die ankoppelbare Werkzeugbereiche enthalten. Diese sind für das derzeitig aktive Fenster, wenn vorhanden, verfügbar.

source: Move focus to next or previous editor split, optionally wrapping when the end is reached.
de: Aktivierung zur nächsten oder vorherigen Editor-Teilung verschieben; wenn das Ende erreicht ist, kann wahlweise umgebrochen werden.
